{"module":"mpm_simple.c","summary":"This module implements a minimal MPM (Multi-Processing Module) for the Apache HTTP server. It handles the core server operations including process management, threading, and configuration validation. The simple MPM manages child processes and worker threads according to configuration parameters.","logs":[{"function":"simple_open_logs","message_template":"simple_open_logs: no listening sockets available, shutting down","reason":"Logs an alert when the server cannot bind to any listening sockets. Likely due to port conflicts, permission issues, or the specified ports already being in use.","resolution":"Check if another process is using the configured port(s). Verify the Listen directives in the Apache configuration. Ensure the server has appropriate permissions to bind to the specified ports. If running as non-root, make sure ports above 1024 are used."},{"function":"simple_pre_config","message_template":"simple_core_init_once: Fatal Error Encountered","reason":"Logs a critical error when the initial setup of the MPM core fails. This is a fundamental initialization error that prevents the server from starting.","resolution":"Check system resources (memory, file descriptors). Review Apache error logs for more specific error messages that might precede this one. Verify Apache configuration files for syntax errors. May require system administrator intervention to address resource limitations."},{"function":"simple_pre_config","message_template":"simple_pre_config: apr_proc_detach(%s) failed","reason":"Logs a critical error when the server fails to detach from the terminal (either in foreground or daemon mode). This prevents the server from properly starting as a daemon or in foreground mode.","resolution":"Check system permissions and resources. On Unix systems, verify the user running Apache has appropriate permissions. Review system limit settings (ulimit). May require system administrator intervention to address permission or resource issues."},{"function":"simple_check_config","message_template":"simple_check_config: SimpleProcCount must be at most %d","reason":"Logs a critical error when the configured number of child processes exceeds the maximum allowed limit. This prevents the server from starting with an invalid configuration.","resolution":"Modify the SimpleProcCount directive in Apache configuration to use a value less than or equal to the maximum limit (SIMPLE_MAX_PROC). Restart Apache after making the configuration change."},{"function":"simple_check_config","message_template":"simple_check_config: SimpleProcCount must be at least %d","reason":"Logs a critical error when the configured number of child processes is below the minimum required limit. This prevents the server from starting with an invalid configuration.","resolution":"Modify the SimpleProcCount directive in Apache configuration to use a value greater than or equal to the minimum limit (SIMPLE_MIN_PROC). Restart Apache after making the configuration change."},{"function":"simple_check_config","message_template":"simple_check_config: SimpleThreadCount must be at most %d","reason":"Logs a critical error when the configured number of worker threads per process exceeds the maximum allowed limit. This prevents the server from starting with an invalid configuration.","resolution":"Modify the SimpleThreadCount directive in Apache configuration to use a value less than or equal to the maximum limit (SIMPLE_MAX_THREADS). Restart Apache after making the configuration change."},{"function":"simple_check_config","message_template":"simple_check_config: SimpleThreadCount must be at least %d","reason":"Logs a critical error when the configured number of worker threads per process is below the minimum required limit. This prevents the server from starting with an invalid configuration.","resolution":"Modify the SimpleThreadCount directive in Apache configuration to use a value greater than or equal to the minimum limit (SIMPLE_MIN_THREADS). Restart Apache after making the configuration change."}],"project":"apache\/httpd"}