{"module":"simple_run.c","summary":"This module implements the main execution loops for Apache's 'simple' MPM (Multi-Processing Module). It manages worker threads, event polling, socket listeners, and timer events, providing the core event-driven functionality for the HTTP server.","logs":[{"function":"simple_setup_workers","message_template":"simple_setup_workers: apr_thread_pool_create with %d threads failed","reason":"Failed to create the thread pool with the specified number of threads. Likely due to system resource limitations such as insufficient memory or hitting OS thread limits.","resolution":"Reduce the number of configured threads or increase system resources. Check system limits (ulimit) and ensure sufficient memory is available. The MaxRequestWorkers and ThreadsPerChild directives may need adjustment."},{"function":"simple_setup_listeners","message_template":"simple_setup_workers: apr_socket_opt_set(APR_SO_NONBLOCK = 1) failed on %pI","reason":"Failed to set a listening socket to non-blocking mode. This could indicate OS socket limitations or a resource issue.","resolution":"Check system socket limits and configuration. Ensure the system has sufficient file descriptors available and that the socket implementation supports non-blocking operation."},{"function":"simple_setup_listeners","message_template":"simple_setup_workers: apr_pollcb_add failed on %pI","reason":"Failed to add a socket to the poll callback system. This could indicate resource limits or incompatibility with the polling mechanism.","resolution":"Check for system resource limits (file descriptors, memory). May need to switch to a different MPM or adjust system limits if the polling implementation has constraints."},{"function":"simple_run_loop","message_template":"simple_main_loop: apr_pollcb_poll failed","reason":"The polling function failed during the main event loop. This is a critical error that prevents the server from processing requests.","resolution":"Check system logs for more detailed error information. This could indicate resource exhaustion, OS limits, or a potential bug in the MPM implementation. Restarting the server might resolve temporary issues."},{"function":"simple_single_process_hack","message_template":"simple_single_child_hack: simple_setup_listeners failed","reason":"Failed to set up the listening sockets in single process mode. This could be due to permission issues, port conflicts, or system resource limitations.","resolution":"Verify the server has permission to bind to the configured ports. Check if another process is already using the same ports. May need to run with higher privileges or change port configuration."},{"function":"simple_setup_privs","message_template":"simple_setup_privs: ap_run_drop_privileges failed","reason":"Failed to drop privileges after binding to ports. This is a security-related error that might prevent the server from running with reduced privileges.","resolution":"Check user\/group configuration in httpd.conf. Ensure the configured user exists and the server has permission to switch to it. May need to adjust the User\/Group directives or system permissions."},{"function":"simple_setup_pollcb","message_template":"simple_setup_pollcb: apr_pollcb_create failed for all possible backends!","reason":"Failed to create a poll callback using any of the supported mechanisms (kqueue, port, epoll). This indicates the operating system doesn't support any of the high-performance event notification systems required.","resolution":"Consider using a different MPM that doesn't require these polling mechanisms, or upgrade to an OS that supports at least one of these event notification systems. This error typically indicates an incompatibility with the underlying platform."},{"function":"simple_child_loop","message_template":"simple_child_loop: simple_setup_workers failed","reason":"Failed to set up worker threads in a child process. This prevents the server from processing requests in this child.","resolution":"Check system resources and thread limits. May need to reduce the number of worker threads configured or increase system limits. Review the ThreadsPerChild directive and system ulimit settings."},{"function":"simple_child_loop","message_template":"simple_child_loop: simple_setup_sockets failed","reason":"Failed to set up the listening sockets in a child process. This prevents the server from accepting new connections in this child.","resolution":"Check for permission issues or resource limitations. May need to adjust system limits for file descriptors or investigate potential conflicts with other processes using the same ports."},{"function":"simple_main_loop","message_template":"simple_main_loop: simple_setup_workers failed","reason":"Failed to set up worker threads in the main process. This is a critical error that prevents the server from processing requests.","resolution":"Check system resources and thread limits. May need to reduce the number of worker threads or increase system limits. This error occurs in the parent\/main process and affects the entire server operation."},{"function":"simple_main_loop","message_template":"simple_main_loop: simple_setup_timers failed","reason":"Failed to set up the timer system in the main process. This prevents proper scheduling of periodic tasks like checking child process counts.","resolution":"Check system resources and ensure the server has sufficient memory. This is an internal error that might indicate resource exhaustion or a bug in the timer implementation. Restarting the server might resolve temporary issues."}],"project":"apache\/httpd"}