{"module":"mod_lua.c","summary":"This module implements Lua script integration into Apache HTTP Server, managing Lua state lifecycle, script loading\/reloading, and error handling for embedded Lua scripts.","logs":[{"function":"ap_lua_init_mutex","message_template":"mod_lua: Failed to reopen mutex lua-ivm-shm in child","reason":"Failed to initialize the global IVM mutex in a child process after fork. This is a critical error that prevents proper module operation.","resolution":"Check system resources and permissions. This could indicate memory issues or insufficient permissions to create mutexes. Restart Apache with proper permissions."},{"function":"pstack_dump","message_template":"Lua Stack Dump: [%s]","reason":"Debug function showing the Lua stack contents when debugging is enabled. The %s parameter indicates the context or reason for the dump.","resolution":"Informational log used for debugging. No resolution required unless investigating a specific Lua script issue."},{"function":"pstack_dump","message_template":"%d:  '%s'","reason":"Shows a string value at a specific position in the Lua stack during debugging.","resolution":"Informational log used for debugging. No resolution required."},{"function":"pstack_dump","message_template":"%d:  userdata","reason":"Shows a userdata object at a specific position in the Lua stack during debugging.","resolution":"Informational log used for debugging. No resolution required."},{"function":"pstack_dump","message_template":"%d:  lightuserdata","reason":"Shows a lightuserdata object at a specific position in the Lua stack during debugging.","resolution":"Informational log used for debugging. No resolution required."},{"function":"pstack_dump","message_template":"%d:  NIL","reason":"Shows a nil value at a specific position in the Lua stack during debugging.","resolution":"Informational log used for debugging. No resolution required."},{"function":"pstack_dump","message_template":"%d:  None","reason":"Shows a None value at a specific position in the Lua stack during debugging.","resolution":"Informational log used for debugging. No resolution required."},{"function":"pstack_dump","message_template":"%d:  %s","reason":"Shows a boolean value (true\/false) at a specific position in the Lua stack during debugging.","resolution":"Informational log used for debugging. No resolution required."},{"function":"pstack_dump","message_template":"%d:  %g","reason":"Shows a numeric value at a specific position in the Lua stack during debugging.","resolution":"Informational log used for debugging. No resolution required."},{"function":"pstack_dump","message_template":"%d:  <table>","reason":"Shows a table object at a specific position in the Lua stack during debugging.","resolution":"Informational log used for debugging. No resolution required."},{"function":"pstack_dump","message_template":"%d:  <thread>","reason":"Shows a thread object at a specific position in the Lua stack during debugging.","resolution":"Informational log used for debugging. No resolution required."},{"function":"pstack_dump","message_template":"%d:  <function>","reason":"Shows a function object at a specific position in the Lua stack during debugging.","resolution":"Informational log used for debugging. No resolution required."},{"function":"pstack_dump","message_template":"%d:  unknown: [%s]","reason":"Shows an unknown type at a specific position in the Lua stack during debugging, with its typename.","resolution":"Informational log used for debugging. No resolution required unless investigating Lua script issues."},{"function":"loadjitmodule","message_template":"Failed to init LuaJIT: %s","reason":"Failed to initialize the LuaJIT engine. This occurs when the JIT module cannot be loaded or started, possibly due to compatibility issues.","resolution":"Check that the correct version of LuaJIT is installed and compatible with the Apache module. May require reinstalling LuaJIT or updating the mod_lua configuration."},{"function":"vm_construct","message_template":"loading lua file %s","reason":"Debug log showing that a Lua file is being loaded into a new Lua VM instance.","resolution":"Informational debug log, no resolution required."},{"function":"vm_construct","message_template":"Error loading %s: %s","reason":"Failed to load a Lua script file. This could be due to syntax errors in the script, file permissions issues, or memory problems.","resolution":"Check the Lua script for syntax errors. Verify file permissions allow Apache to read the file. If message indicates 'memory allocation error', increase available memory to Apache."},{"function":"ap_lua_get_lua_state","message_template":"creating lua_State with file %s","reason":"Debug log indicating that a new Lua state is being created for a specific file.","resolution":"Informational debug log, no resolution required."},{"function":"ap_lua_get_lua_state","message_template":"(re)loading lua file %s","reason":"Debug log showing that a Lua file is being reloaded due to cache settings or modifications to the file.","resolution":"Informational debug log, no resolution required. If this appears too frequently, consider adjusting cache settings for better performance."}],"project":"apache\/httpd"}