{"module":"lua_passwd.c","summary":"A password hashing module for Apache HTTP Server that implements various hashing algorithms including SHA1, MD5, CRYPT, and BCRYPT. It provides functions to generate random salts and create password hashes while handling various error conditions.","logs":[{"function":"generate_salt","message_template":"generate_salt(): BUG: Buffer too small","reason":"Logs an error when the buffer allocated for salt generation is too small for the requested salt size. Likely due to a programming error or incorrect buffer size calculation.","resolution":"This is an internal bug. Check the code that calls generate_salt() to ensure it's providing proper buffer sizes. Report this error to the developers as it indicates a code issue rather than a configuration problem."},{"function":"generate_salt","message_template":"Unable to generate random bytes: %pm","reason":"Logs an error when the system fails to generate random bytes for salt creation. Likely due to entropy pool depletion or issues with the random number generator.","resolution":"Check system entropy sources (e.g., \/dev\/random, \/dev\/urandom). On Linux systems, ensure rngd or haveged is running. On virtualized environments, make sure entropy sources are properly virtualized."},{"function":"mk_password_hash","message_template":"could not encode password: %pm","reason":"Logs an error when the APR MD5 encoding function fails to encode the password with the generated salt. Could be due to memory allocation issues or internal APR errors.","resolution":"Check system resources, particularly available memory. Ensure the APR library is properly installed and functioning. If the issue persists, consider using a different hashing algorithm."},{"function":"mk_password_hash","message_template":"crypt() failed: %pm","reason":"Logs an error when the system crypt() function fails to hash the password. This could be due to system resource limitations or crypt library issues.","resolution":"Verify that the crypt library is properly installed and functioning. Check system error logs for more details. Consider using a different hashing algorithm if crypt() is consistently failing."},{"function":"mk_password_hash","message_template":"Warning: Password truncated to 8 characters by CRYPT algorithm.","reason":"Warns when a password longer than 8 characters is used with the CRYPT algorithm, which only uses the first 8 characters, potentially weakening security.","resolution":"Consider using a more secure hashing algorithm like BCRYPT or APMD5 that can handle longer passwords. Educate users about the 8-character limitation of CRYPT when it must be used for compatibility reasons."},{"function":"mk_password_hash","message_template":"Unable to generate random bytes: %pm","reason":"Logs an error when random bytes cannot be generated for BCRYPT salt. Similar to the error in generate_salt but specific to the BCRYPT algorithm context.","resolution":"Same as for the similar error in generate_salt: check system entropy sources and ensure proper system configuration for random number generation."},{"function":"mk_password_hash","message_template":"Unable to encode with bcrypt: %pm","reason":"Logs an error when the BCRYPT algorithm fails to encode the password hash. Could be due to library issues, incompatible bcrypt implementation, or resource constraints.","resolution":"Ensure the bcrypt library is properly installed and compatible with your system. Check for memory issues if bcrypt is failing consistently. Consider using a different hashing algorithm if problems persist."},{"function":"mk_password_hash","message_template":"mk_password_hash(): unsupported algorithm %d","reason":"Logs an error when an unsupported or unknown hashing algorithm ID is provided. Likely due to configuration errors or code using algorithms not supported by this build.","resolution":"Check the algorithm configuration in your Apache setup. Ensure you're only using algorithms that are compiled into your version of Apache. This could happen if configuration files were copied from a system with different compile-time options."}],"project":"apache\/httpd"}