{"module":"lua_dbd.c","summary":"This module provides Apache Lua bindings for database operations, allowing Lua scripts to connect to databases, execute queries, and handle result sets using either mod_dbd or APR database drivers.","logs":[{"function":"lua_db_acquire","message_template":"mod_dbd doesn't seem to have been loaded.","reason":"Attempt to use mod_dbd for database connection, but the module is not loaded or not available.","resolution":"Ensure mod_dbd is loaded in your Apache configuration using LoadModule directive and properly configured with DBDriver and DBDParams."},{"function":"lua_db_acquire","message_template":"Could not acquire connection from mod_dbd. If your database is running, this may indicate a permission problem.","reason":"The mod_dbd module is loaded but could not establish a connection to the database server.","resolution":"Verify database credentials, ensure database server is running, check network connectivity, and confirm the database user has appropriate permissions."},{"function":"lua_db_acquire","message_template":"Could not allocate memory for database!","reason":"Memory allocation failure when attempting to create a pool for database operations.","resolution":"Check server memory usage and consider increasing available memory or optimizing other processes to reduce memory consumption."},{"function":"lua_db_acquire","message_template":"No database connection string was specified.","reason":"An attempt was made to connect to a database but without providing a connection string.","resolution":"Provide a valid connection string when calling the database acquire function in your Lua script."},{"function":"lua_db_acquire","message_template":"driver for %s not available","reason":"The specified database driver is not available in the current Apache installation.","resolution":"Install the required database client libraries and recompile mod_dbd with support for the requested database driver."},{"function":"lua_db_acquire","message_template":"can't find driver for %s","reason":"The requested database driver module could not be found.","resolution":"Verify that the driver name is correct and that the corresponding module is installed and in the proper location."},{"function":"lua_db_acquire","message_template":"driver for %s is invalid or corrupted","reason":"The database driver module was found but could not be loaded due to corruption or incompatibility.","resolution":"Reinstall the database driver module or update it to a version compatible with your Apache and APR versions."},{"function":"lua_db_acquire","message_template":"mod_lua not compatible with APR in get_driver","reason":"Incompatibility between mod_lua and the Apache Portable Runtime (APR) when attempting to get a database driver.","resolution":"Ensure you're using compatible versions of mod_lua and APR. You might need to upgrade or downgrade one of them to resolve the incompatibility."},{"function":"lua_db_prepared_select","message_template":"Error in executing prepared statement: Expected %d arguments, got %d.","reason":"A prepared statement was executed with an incorrect number of parameters.","resolution":"Adjust your Lua code to provide the exact number of parameters required by the prepared statement. Check your SQL query for the number of placeholders."},{"function":"lua_db_prepared","message_template":"Could not find any prepared statement called %s!","reason":"An attempt was made to use a prepared statement that doesn't exist or wasn't properly created.","resolution":"Verify that the prepared statement name is correct and that it was successfully created using DBDPrepareSQL directive before trying to use it."},{"function":"lua_db_prepared_select","message_template":"Database connection seems to be closed, please reacquire it.","reason":"An attempt was made to use a prepared statement on a database connection that has been closed.","resolution":"Re-establish the database connection before attempting to use prepared statements. Check if your connection is being closed unexpectedly."},{"function":"lua_db_prepared_query","message_template":"Database connection seems to be closed, please reacquire it.","reason":"An attempt was made to execute a query on a database connection that has been closed.","resolution":"Re-establish the database connection before attempting to execute queries. Ensure your connection management logic keeps connections open for needed operations."},{"function":"lua_db_get_row","message_template":"(oob)","reason":"When retrieving column names from a result set, a column index was out of bounds.","resolution":"This is typically an internal error indicating a mismatch between the reported number of columns and the actual result set. Verify your SQL query structure and database schema."}],"project":"apache\/httpd"}