{"module":"lua_config.c","summary":"This module provides Apache HTTP Server with Lua integration capabilities, specifically for configuring Lua handlers, mapping them to URL patterns, and providing logging functions for Lua scripts to interact with Apache's logging system.","logs":[{"function":"cfg_lua_map_handler","message_template":"Unable to compile regular expression, '%s'","reason":"Logs an error when the regular expression pattern provided in Lua configuration cannot be compiled. This typically occurs when the pattern syntax is invalid.","resolution":"Check the syntax of the regular expression pattern in your Lua configuration. Common issues include unbalanced parentheses, incorrect character classes, or using Lua pattern syntax instead of standard regex syntax."},{"function":"cmd_emerg","message_template":"%s","reason":"Logs an emergency-level message from Lua code. Used for severe errors that require immediate attention, such as the server being unusable.","resolution":"This indicates a critical system failure. Check server resources, file system integrity, and review the specific error message for details on what system component failed."},{"function":"cmd_alert","message_template":"%s","reason":"Logs an alert-level message from Lua code. Used for serious conditions that should be corrected immediately.","resolution":"This indicates a serious issue requiring immediate attention. Review the specific message content to understand what component is affected and may require intervention."},{"function":"cmd_crit","message_template":"%s","reason":"Logs a critical-level message from Lua code. Used for critical conditions such as hardware errors or important resource allocation failures.","resolution":"Check system resources like disk space, memory, and network connectivity. The specific message will indicate which resource or component is in critical state."},{"function":"cmd_err","message_template":"%s","reason":"Logs an error-level message from Lua code. Used for error conditions that prevent normal operation but aren't critical.","resolution":"Review the Lua script logic and fix the underlying issue. Typical problems include file access permissions, network connectivity issues, or logic errors in the script."},{"function":"cmd_warn","message_template":"%s","reason":"Logs a warning-level message from Lua code. Used for warning conditions that don't affect operation but may indicate potential problems.","resolution":"No immediate action required, but review the warning message to address potential issues before they become errors. May indicate configuration inconsistencies or deprecation notices."},{"function":"cmd_notice","message_template":"%s","reason":"Logs a notice-level message from Lua code. Used for normal but significant conditions worth noting.","resolution":"Informational only, no resolution required. These messages indicate important normal events like configuration reloads or module initialization."},{"function":"cmd_info","message_template":"%s","reason":"Logs an info-level message from Lua code. Used for informational messages about normal operation.","resolution":"Informational only, no resolution required. These provide insight into normal operations and can be used for monitoring system behavior."},{"function":"cmd_debug","message_template":"%s","reason":"Logs a debug-level message from Lua code. Used for detailed debug information for troubleshooting.","resolution":"Informational only, no resolution required. Useful for developers to understand script execution flow and variable states during debugging."},{"function":"cmd_trace1","message_template":"%s","reason":"Logs a trace1-level message from Lua code. Used for the most detailed tracing information.","resolution":"Informational only, intended for developers. These verbose logs help with detailed troubleshooting of Lua script execution."},{"function":"cmd_trace2","message_template":"%s","reason":"Logs a trace2-level message from Lua code. Used for very detailed tracing information.","resolution":"Informational only, intended for developers. Contains granular execution details for troubleshooting."},{"function":"cmd_trace3","message_template":"%s","reason":"Logs a trace3-level message from Lua code. Used for detailed tracing information.","resolution":"Informational only, intended for developers. Contains execution details for troubleshooting."},{"function":"cmd_trace4","message_template":"%s","reason":"Logs a trace4-level message from Lua code. Used for tracing information.","resolution":"Informational only, intended for developers. Contains execution details for troubleshooting."},{"function":"cmd_trace5","message_template":"%s","reason":"Logs a trace5-level message from Lua code. Used for tracing information.","resolution":"Informational only, intended for developers. Contains execution details for troubleshooting."},{"function":"cmd_trace6","message_template":"%s","reason":"Logs a trace6-level message from Lua code. Used for tracing information.","resolution":"Informational only, intended for developers. Contains execution details for troubleshooting."},{"function":"cmd_trace7","message_template":"%s","reason":"Logs a trace7-level message from Lua code. Used for tracing information.","resolution":"Informational only, intended for developers. Contains execution details for troubleshooting."},{"function":"cmd_trace8","message_template":"%s","reason":"Logs a trace8-level message from Lua code. Used for the finest-grained tracing information.","resolution":"Informational only, intended for developers. Contains the most detailed execution information for troubleshooting complex issues."}],"project":"apache\/httpd"}