{"module":"lua_passwd.h","summary":"A header file defining constants, structures, and function prototypes for password hashing in Apache. It includes definitions for various password hashing algorithms, error codes for password operations, and a context structure for password processing.","logs":[{"function":"mk_password_hash","message_template":"Error messages stored in ctx->errstr when ERR_FILEPERM is returned","reason":"File permission errors when trying to access password files or directories","resolution":"Check file and directory permissions related to password files. Ensure the process has appropriate read\/write access to the necessary files."},{"function":"mk_password_hash","message_template":"Error messages stored in ctx->errstr when ERR_SYNTAX is returned","reason":"Syntax errors in password format or configuration","resolution":"Verify the syntax of password entries or configuration. Ensure passwords follow the expected format for the selected algorithm."},{"function":"mk_password_hash","message_template":"Error messages stored in ctx->errstr when ERR_PWMISMATCH is returned","reason":"Password mismatch during verification or comparison","resolution":"Ensure the provided password matches the expected one. This may indicate a user error or authentication attempt with incorrect credentials."},{"function":"mk_password_hash","message_template":"Error messages stored in ctx->errstr when ERR_INTERRUPTED is returned","reason":"The password operation was interrupted by a signal or other event","resolution":"Check for system interruptions or signals that might disrupt the operation. May require retrying the operation."},{"function":"mk_password_hash","message_template":"Error messages stored in ctx->errstr when ERR_OVERFLOW is returned","reason":"Buffer overflow detected during password processing","resolution":"Check if passwords exceed MAX_PASSWD_LEN (256) or if output buffers are properly sized. May indicate security issues or exceptionally long inputs."},{"function":"mk_password_hash","message_template":"Error messages stored in ctx->errstr when ERR_BADUSER is returned","reason":"Invalid or non-existent user specified for password operations","resolution":"Verify the user exists and is correctly specified. Check user database or directory service if applicable."},{"function":"mk_password_hash","message_template":"Error messages stored in ctx->errstr when ERR_INVALID is returned","reason":"Invalid parameters or input provided to the password function","resolution":"Check that all parameters to the function are valid. Ensure proper initialization of the passwd_ctx structure before use."},{"function":"mk_password_hash","message_template":"Error messages stored in ctx->errstr when ERR_RANDOM is returned","reason":"Failed to generate random data for password hashing, likely during salt creation","resolution":"Check system entropy sources and random number generation capabilities. On some systems, this may indicate insufficient entropy or issues with \/dev\/random or similar."},{"function":"mk_password_hash","message_template":"Error messages stored in ctx->errstr when ERR_GENERAL is returned","reason":"General error occurred during password processing that doesn't fit other categories","resolution":"Check system resources, memory availability, and application logs for more specific information. This is a catch-all error that may require more context to diagnose."},{"function":"mk_password_hash","message_template":"Error messages stored in ctx->errstr when ERR_ALG_NOT_SUPP is returned","reason":"The requested password hashing algorithm is not supported on this platform","resolution":"Check if the algorithm is supported on the current platform based on the definitions like CRYPT_ALGO_SUPPORTED, BCRYPT_ALGO_SUPPORTED, etc. May require selecting a different algorithm or upgrading dependencies."}],"project":"apache\/httpd"}