{"module":"mod_lua.c","summary":"The mod_lua module enables the execution of Lua code within the Apache HTTP server at various request processing stages. It provides integration with Apache's request handling lifecycle, allowing Lua scripts to perform tasks such as request processing, authentication, authorization, and content filtering.","logs":[{"function":"lua_handler","message_template":"handling [%s] in mod_lua","reason":"Informational message that mod_lua is handling a specific file. This indicates the module has taken responsibility for processing the request.","resolution":"This is an informational message, no resolution required."},{"function":"lua_handler","message_template":"Unable to compile VM, see logs","reason":"Failed to compile the Lua Virtual Machine for a request handler. This typically occurs due to syntax errors in the Lua script or missing dependencies.","resolution":"Check the Lua script for syntax errors. Verify that all required Lua modules are available and properly configured in the LuaPackagePath and LuaPackageCPath directives."},{"function":"lua_handler","message_template":"got a vm!","reason":"Debug message indicating that a Lua VM was successfully created for handling a request.","resolution":"This is an informational message, no resolution required."},{"function":"lua_handler","message_template":"lua: Unable to find entry function '%s' in %s (not a valid function)","reason":"The specified entry function could not be found in the Lua script. This occurs when the function name specified in the configuration doesn't match any function in the script.","resolution":"Verify that the function name in your configuration (e.g., LuaMapHandler) matches a function that actually exists in your Lua script. Check for typos in either location."},{"function":"report_lua_error","message_template":"Lua error: %s","reason":"A Lua script encountered an error during execution. The specific error message from Lua is included.","resolution":"Examine the error message for details on what went wrong. Check the Lua script for logical errors, nil references, or type errors. You may need to add error handling to your Lua code."},{"function":"lua_setup_filter_ctx","message_template":"lua: Failed to obtain lua interpreter for %s %s","reason":"Failed to obtain a Lua interpreter for a filter. This could be due to resource constraints or configuration problems.","resolution":"Check system resources and Apache configuration. You may need to adjust the number of Lua VMs in your configuration or review the LuaScope setting. Verify the filter script exists and is accessible."},{"function":"lua_setup_filter_ctx","message_template":"lua: Unable to find entry function '%s' in %s (not a valid function)","reason":"The specified entry function for a filter could not be found in the Lua script.","resolution":"Verify that the function name in your filter configuration matches a function that exists in your Lua script. Ensure the script is properly loaded and parsed."},{"function":"lua_output_filter_handle","message_template":"lua: Error while executing filter: %s","reason":"An error occurred during the execution of a Lua output filter. The filter script encountered a runtime error.","resolution":"Examine the error message for details. Check the Lua filter script for errors, particularly in how it processes request or response data. Test the filter with simple content first to isolate the issue."},{"function":"lua_request_rec_hook_harness","message_template":"Lua hook %s:%s for phase %s returned %d","reason":"Informational message showing the return value from a Lua hook function for a particular request processing phase.","resolution":"This is an informational message. If the return value is unexpected, check your Lua hook function logic to ensure it's returning the intended Apache status code."},{"function":"lua_request_rec_hook_harness","message_template":"Lua hook %s:%s for phase %s did not return a numeric value","reason":"A Lua hook function did not return a numeric value as required. Apache hook functions must return specific status codes to properly participate in request processing.","resolution":"Modify the Lua hook function to return a proper Apache status code (e.g., apache2.OK, apache2.DECLINED, etc.). Check your function to ensure it has a return statement with the appropriate value."},{"function":"lua_map_handler","message_template":"lua: Failed to obtain Lua interpreter for entry function '%s' in %s","reason":"Failed to obtain a Lua interpreter for a mapped handler. This could be due to resource limitations or configuration issues.","resolution":"Check system resources and Apache configuration. You may need to adjust LuaScope, verify file permissions, or ensure the script is correctly specified in your configuration."},{"function":"lua_map_handler","message_template":"lua: Unable to find entry function '%s' in %s (not a valid function)","reason":"The specified entry function for a mapped handler could not be found in the Lua script.","resolution":"Verify that the function name in your LuaMapHandler configuration matches a function that exists in your Lua script. Check for typos or other naming issues."},{"function":"lua_map_handler","message_template":"lua: Lua handler %s in %s did not return a value, assuming apache2.OK","reason":"A Lua handler function did not explicitly return a value, so the module is assuming an OK status for the request.","resolution":"If this behavior is intended, no action is needed. For better clarity, modify your Lua handler to explicitly return apache2.OK or another appropriate status code."},{"function":"register_package_dir","message_template":"Unable to build full path to file, %s","reason":"The module could not build a full path to a specified Lua file. This usually happens with invalid file paths in configuration.","resolution":"Check the file path in your LuaPackagePath or similar configuration. Ensure the path exists, is accessible to the Apache process, and follows proper syntax for your operating system."},{"function":"register_lua_scope","message_template":"Scope type of '%s' cannot be used because this server does not have threading support (APR_HAS_THREADS)","reason":"The configured Lua scope (thread or server) requires thread support, but the current Apache installation was not built with threading support.","resolution":"Change your LuaScope configuration to use a scope that doesn't require threading (e.g., 'once', 'request', or 'conn'). Alternatively, rebuild Apache with threading support if needed."},{"function":"register_lua_scope","message_template":"Invalid value for LuaScope, '%s', acceptable values are: 'once', 'request', 'conn'","reason":"The value specified for LuaScope directive is not one of the supported options.","resolution":"Update your LuaScope configuration to use one of the supported values: 'once', 'request', 'conn', and possibly 'thread' and 'server' if your Apache has threading support."},{"function":"register_lua_inherit","message_template":"LuaInherit type of '%s' not recognized, valid options are 'none', 'parent-first', and 'parent-last'","reason":"An invalid value was specified for the LuaInherit directive, which controls how Lua configurations are inherited.","resolution":"Update your LuaInherit configuration to use one of the supported values: 'none', 'parent-first', or 'parent-last'."},{"function":"register_lua_codecache","message_template":"LuaCodeCache type of '%s' not recognized, valid options are 'never', 'stat', and 'forever'","reason":"An invalid value was specified for the LuaCodeCache directive, which controls how Lua code is cached.","resolution":"Update your LuaCodeCache configuration to use one of the supported values: 'never', 'stat', or 'forever'."},{"function":"lua_post_config","message_template":"mod_lua: Failed to create shared memory segment on file %s","reason":"The module failed to create a shared memory segment during server startup. This affects the module's ability to share data between processes.","resolution":"Check file permissions, available system memory, and Apache's configuration. The module might fall back to a different method, but if persistent issues occur, investigate system limits and Apache's shared memory configuration."},{"function":"lua_authz_check","message_template":"Unable to compile VM for authz provider %s","reason":"Failed to compile the Lua VM for an authorization provider. This affects the module's ability to perform authorization checks.","resolution":"Check the Lua script specified for the authorization provider for syntax errors. Verify file permissions and that all required dependencies are available."},{"function":"lua_authz_check","message_template":"Unable to find entry function '%s' in %s (not a valid function)","reason":"The specified entry function for an authorization provider could not be found in the Lua script.","resolution":"Verify that the function name in your LuaAuthzProvider configuration matches a function that exists in your Lua script. Check for typos or function visibility issues."},{"function":"lua_authz_check","message_template":"Error: authz provider %s: too many arguments","reason":"The authorization provider function was called with too many arguments, causing a stack overflow in Lua.","resolution":"Review your Lua authorization provider function to ensure it handles the correct number of arguments. Also check your Apache configuration for how the authorization provider is being called."},{"function":"lua_authz_check","message_template":"Error executing authz provider %s: %s","reason":"An error occurred while executing a Lua authorization provider. The specific error from Lua is included.","resolution":"Examine the Lua error message for details on what went wrong. Check the authorization provider script for logical errors or other issues. Add error handling code to handle potential edge cases."},{"function":"lua_authz_check","message_template":"Error: authz provider %s did not return integer","reason":"The Lua authorization provider did not return an integer value as required. Authorization functions must return specific status codes.","resolution":"Modify your Lua authorization provider function to return a proper integer status code (AUTHZ_GRANTED, AUTHZ_DENIED, etc.). Ensure it handles all execution paths with proper return values."},{"function":"lua_authz_check","message_template":"Error: authz provider %s: invalid return value %d","reason":"The Lua authorization provider returned an integer value, but it's not one of the expected authorization result codes.","resolution":"Update your Lua authorization provider to return only valid authorization codes (AUTHZ_GRANTED, AUTHZ_DENIED, AUTHZ_NEUTRAL, etc.). Check the documentation for valid return values."},{"function":"lua_insert_filter_harness","message_template":"LuaHookInsertFilter not yet implemented","reason":"The LuaHookInsertFilter functionality is mentioned in the configuration but not yet implemented in the module.","resolution":"Avoid using the LuaHookInsertFilter directive as it's not yet implemented. Use the supported LuaInputFilter and LuaOutputFilter directives instead for filtering functionality."}],"project":"apache\/httpd"}