{"module":"mod_md_md.h","summary":"Header file for Apache mod_md module that defines data structures and constants for the Managed Domain (MD) system. This module handles certificate management for domains, particularly using the ACME protocol for automatic SSL\/TLS certificate provisioning and renewal.","logs":[{"function":"md_state_t enumeration","message_template":"MD_S_UNKNOWN","reason":"Domain has not been analyzed yet and its status is unknown.","resolution":"This is an initial state and usually transitions to another state after analysis. No immediate action needed unless domain remains in this state."},{"function":"md_state_t enumeration","message_template":"MD_S_INCOMPLETE","reason":"Domain is missing necessary information and cannot go live.","resolution":"Check domain configuration. Ensure all required fields are filled in, such as contact information, CA URL, or other mandatory domain properties."},{"function":"md_state_t enumeration","message_template":"MD_S_COMPLETE","reason":"Domain has all necessary information and can go live.","resolution":"Informational state, no resolution required. Domain is properly configured."},{"function":"md_state_t enumeration","message_template":"MD_S_EXPIRED_DEPRECATED","reason":"Certificate has expired (deprecated state enum).","resolution":"This is a deprecated status code, but might indicate certificate expiration. Check certificate validity and renewal settings."},{"function":"md_state_t enumeration","message_template":"MD_S_ERROR","reason":"Domain data is flawed and unable to be processed as is.","resolution":"Check domain configuration for errors. Look at the 'state_descr' field for more specific error information. May require correcting domain definitions or certificate settings."},{"function":"md_state_t enumeration","message_template":"MD_S_MISSING_INFORMATION","reason":"User has not agreed to Terms of Service or other required information is missing.","resolution":"Ensure Terms of Service have been accepted for the CA. Update configuration to include any missing required information for certificate issuance."},{"function":"md_job_notify_cb","message_template":"reason parameter","reason":"Notification callback providing information about job status.","resolution":"This is a callback mechanism for notifications. Resolution depends on the specific reason provided to the callback."},{"function":"md_t structure","message_template":"state_descr field","reason":"Description of the current state of the managed domain.","resolution":"Check this description for details about why a domain might be in a particular state. Provides human-readable explanation of domain status."}],"project":"apache\/httpd"}