{"module":"md_acme_acct.h","summary":"This header file defines the interface for ACME account management in mod_md, an Apache module for automated certificate management. It includes structures, constants, and function declarations for creating, updating, validating, and managing ACME accounts used in the certificate issuance process.","logs":[{"function":"md_acme_acct_update","message_template":"Failed to update ACME account information from server","reason":"The account update operation failed, possibly due to network issues, server unavailability, or authentication problems with the ACME server.","resolution":"Check network connectivity, verify the ACME server URL is correct and the server is operational. Ensure the account credentials are valid and have not been revoked."},{"function":"md_acme_acct_validate","message_template":"Account validation failed","reason":"The ACME account could not be validated with the server, possibly due to authentication issues or account status problems.","resolution":"Verify the account is in good standing with the ACME provider. The account may need to be re-registered if it was deactivated or revoked."},{"function":"md_acme_agree","message_template":"Failed to agree to Terms of Service","reason":"The operation to agree to the Terms of Service URL failed, potentially due to communication issues with the server or the TOS URL being invalid.","resolution":"Check the Terms of Service URL, ensure network connectivity to the ACME server, and verify the account has proper permissions to update its TOS agreement."},{"function":"md_acme_check_agreement","message_template":"New Terms of Service agreement required","reason":"The ACME provider has updated their Terms of Service, and the account needs to agree to the new terms before continuing operations.","resolution":"Review the new Terms of Service and use md_acme_agree to accept the new terms if acceptable."},{"function":"md_acme_find_acct_for_md","message_template":"Could not find ACME account for managed domain","reason":"No existing ACME account could be found that matches the requirements of the managed domain, such as the specified CA URL or EAB settings.","resolution":"Register a new account using md_acme_acct_register with appropriate parameters matching the domain's requirements."},{"function":"md_acme_acct_register","message_template":"Failed to register new ACME account","reason":"Account registration with the ACME server failed, possibly due to invalid contact information, server issues, or network problems.","resolution":"Verify the contact information is valid, ensure the ACME server is operational, and check network connectivity. External Account Binding credentials may be required by the CA."},{"function":"md_acme_acct_save","message_template":"Failed to save ACME account to store","reason":"The system could not persist the ACME account information to the store, likely due to file system permissions or disk space issues.","resolution":"Check file system permissions for the account storage location (typically under server config directory), ensure adequate disk space, and verify the store is properly configured."},{"function":"md_acme_acct_deactivate","message_template":"Failed to deactivate ACME account","reason":"The request to deactivate the account at the ACME server failed, possibly due to network issues or server-side problems.","resolution":"Verify network connectivity and try again. If the account is already deactivated on the server side, this may be ignored."},{"function":"md_acme_acct_load","message_template":"Failed to load ACME account from store","reason":"Could not load the account information from the persistent store, possibly due to missing or corrupted account files (account.json or account.pem).","resolution":"Check if the account files exist in the expected location and have correct permissions. The account may need to be re-registered if files are corrupted or missing."},{"function":"md_acme_acct_matches_url","message_template":"Account does not match ACME server URL","reason":"The account is not configured for use with the specified ACME server URL.","resolution":"Use or create an account that matches the required ACME server URL."},{"function":"md_acme_acct_matches_md","message_template":"Account not compatible with managed domain requirements","reason":"The account's CA URL or External Account Binding settings don't match those required by the managed domain.","resolution":"Register a new account with settings that match the domain's requirements, particularly the CA URL and any required External Account Binding credentials."}],"project":"apache\/httpd"}