{"module":"md_acme_acct.c","summary":"This module implements ACME account management for Apache's certificate provisioning system. It handles account registration, validation, updates, and deactivation while managing cryptographic keys and authentication for interactions with ACME certificate authority servers.","logs":[{"function":"md_acme_acct_from_json","message_template":"account has no url","reason":"The ACME account data is missing the required URL field which uniquely identifies the account with the Certificate Authority.","resolution":"Verify the account data is valid and complete. May require re-registering the account with the CA if the data is corrupted."},{"function":"md_acme_acct_from_json","message_template":"account has no CA url: %s","reason":"The ACME account data is missing the Certificate Authority URL, which is required to interact with the CA.","resolution":"Check the account configuration to ensure the CA URL is properly set. This could happen if the configuration file is corrupted or the CA details were not properly saved."},{"function":"md_acme_acct_load","message_template":"error reading account: %s","reason":"There was an error loading the account data from storage, which could be due to file permission issues or corrupted data.","resolution":"Check file permissions and ownership for the account data. You may need to repair or recreate the account if the data is corrupted."},{"function":"md_acme_acct_load","message_template":"loading key: %s","reason":"An error occurred when attempting to load the private key for the ACME account.","resolution":"Verify the key file exists and has correct permissions. If the key is corrupted, you may need to recreate the account with a new key."},{"function":"find_acct","message_template":"account candidate %s\/%s","reason":"Informational message indicating a potential matching account was found during the search process.","resolution":"Information log, no resolution required"},{"function":"find_acct","message_template":"found account %s for %s: %s, status=%d","reason":"An account matching the search criteria has been found with its status indicated.","resolution":"Information log, no resolution required. If status is not 'valid', may need to address account issues."},{"function":"acct_find","message_template":"acct_find: got account %s","reason":"Informational message indicating a specific account was successfully retrieved.","resolution":"Information log, no resolution required"},{"function":"acct_find","message_template":"acct_find: none found","reason":"No matching ACME account was found in the storage during the search process.","resolution":"If an account is expected to exist, check configuration parameters. You may need to register a new account if none exists."},{"function":"acct_find_and_verify","message_template":"acct_find_and_verify: found %s","reason":"An account was found during the search and verify process.","resolution":"Information log, no resolution required"},{"function":"acct_find_and_verify","message_template":"acct_find_and_verify: verified %s","reason":"The account was successfully verified with the ACME server, confirming it is valid and usable.","resolution":"Information log, no resolution required"},{"function":"md_acme_find_acct_for_md","message_template":"no account found, looking in STAGING","reason":"No account was found in the main accounts storage, so the system will check the staging area as a fallback.","resolution":"Information log. If no account is ultimately found, you'll need to register a new one."},{"function":"md_acme_acct_id_for_md","message_template":"acct_id_for_md %s -> %s","reason":"Maps a managed domain to its corresponding ACME account ID for tracking purposes.","resolution":"Information log, no resolution required"},{"function":"acct_upd","message_template":"acct update response: %s","reason":"Shows the raw response from the ACME server when updating an account, useful for debugging.","resolution":"Information log, no resolution required unless the response contains errors"},{"function":"acct_upd","message_template":"new acct without location","reason":"The ACME server responded to an account creation request without providing a location header, which is required by the ACME protocol.","resolution":"This indicates a problem with the ACME server implementation. Try using a different ACME server or report the issue to the server operator."},{"function":"acct_upd","message_template":"updated acct %s","reason":"Account details were successfully updated with the ACME server.","resolution":"Information log, no resolution required"},{"function":"md_acme_acct_update","message_template":"acct update","reason":"Informational message indicating an account update operation is being initiated.","resolution":"Information log, no resolution required"},{"function":"md_acme_acct_validate","message_template":"acct update failed for %s","reason":"The attempt to update and validate the account with the ACME server has failed, suggesting the account might be invalid or revoked.","resolution":"Check if the ACME server is accessible and verify account status. You may need to create a new account if this one has been revoked."},{"function":"md_acme_acct_validate","message_template":"trying acct update via ToS agreement","reason":"After a normal account update failed, the system is trying a fallback method by explicitly agreeing to the Terms of Service.","resolution":"Information log. If this also fails, you may need to manually check the account status or create a new account."},{"function":"get_eab","message_template":"apache:eab-hmac-invalid","reason":"The External Account Binding HMAC value provided is not valid base64, preventing account authentication with the ACME server.","resolution":"Verify that the EAB HMAC value in your configuration is correctly formatted in base64. Contact your CA if you need a new valid HMAC value."},{"function":"get_eab","message_template":"external account binding HMAC value is not valid base64","reason":"Detailed error message explaining that the HMAC value for external account binding is not properly base64 encoded.","resolution":"Check the EAB HMAC configuration value for proper base64 formatting. You might need to request a new HMAC value from your CA."},{"function":"get_eab","message_template":"apache:eab-hmac-fail","reason":"The system failed to compute the MAC (Message Authentication Code) for external account binding, possibly due to cryptographic function errors.","resolution":"This could indicate issues with the cryptographic libraries or invalid HMAC key format. Verify your installation and EAB credentials."},{"function":"get_eab","message_template":"external account binding MAC could not be computed","reason":"Detailed error message when the system fails to generate the MAC for external account binding authentication.","resolution":"Check for issues with cryptographic libraries, ensure correct EAB credentials, and verify system has sufficient resources for crypto operations."},{"function":"md_acme_acct_register","message_template":"create new account","reason":"Informational message indicating that a new ACME account registration process is starting.","resolution":"Information log, no resolution required"},{"function":"md_acme_acct_register","message_template":"invalid agreement uri (%s): %s","reason":"The Terms of Service agreement URI provided is not valid, preventing account registration or update.","resolution":"Check the ToS URI in your configuration. It must be a valid, absolute URI. If using 'accepted', ensure the ACME server advertises a valid ToS URL."},{"function":"md_acme_acct_register","message_template":"invalid contact uri (%s): %s","reason":"One of the contact URIs provided for the account is not valid according to ACME specifications.","resolution":"Update the contact information with valid URIs. Usually, these should be mailto: URIs with valid email addresses."},{"function":"md_acme_acct_register","message_template":"reusing key from account %s","reason":"The system is reusing an existing account key, which may help maintain identity across ACME protocol versions.","resolution":"Information log, no resolution required"},{"function":"md_acme_acct_register","message_template":"created new account key","reason":"A new cryptographic key pair was generated for use with this ACME account.","resolution":"Information log, no resolution required"},{"function":"md_acme_acct_register","message_template":"registered new account %s","reason":"A new ACME account was successfully registered with the Certificate Authority.","resolution":"Information log, no resolution required"},{"function":"md_acme_acct_deactivate","message_template":"delete account %s from %s","reason":"The system is attempting to deactivate (delete) an ACME account at the specified CA.","resolution":"Information log. Note that this operation is permanent - the account cannot be reactivated."}],"project":"apache\/httpd"}