{"module":"md_acmev2_drive.c","summary":"This module implements the ACMEv2 protocol for certificate renewal in Apache's mod_md module. It handles the process of creating and monitoring certificate orders, managing domain validations, and retrieving certificates from ACME certificate authorities like Let's Encrypt.","logs":[{"function":"ad_setup_order","message_template":"Loaded order from staging","reason":"Indicates the system successfully loaded an existing ACME order from the staging area. This is informational and shows the certificate renewal process is using a previously created order.","resolution":"No resolution needed. This is a normal informational message."},{"function":"ad_setup_order","message_template":"%s: loading order","reason":"Debug message logged when there's an error loading an order from staging. The %s parameter is the MD (managed domain) name.","resolution":"Check file permissions and storage integrity in the staging area. This could indicate storage corruption or access issues."},{"function":"ad_setup_order","message_template":"Creating new order","reason":"Indicates the system is creating a new ACME order because no valid existing order was found.","resolution":"No resolution needed. This is a normal informational message during certificate acquisition."},{"function":"ad_setup_order","message_template":"%s: ordering ACME profile '%s'","reason":"Debug message indicating which specific ACME profile is being ordered for a domain. This tracks which certificate type or parameters are being requested.","resolution":"No resolution needed. This is a normal debug message."},{"function":"ad_setup_order","message_template":"%s: mandatory ACME profile '%s' is not offered by CA","reason":"Error logged when a mandatory ACME profile specified in configuration is not supported by the Certificate Authority. This prevents certificate issuance.","resolution":"Either change the CA provider to one that supports the required profile, or modify the configuration to use a profile that is supported by the current CA. Check the CA's documentation for supported certificate profiles."},{"function":"ad_setup_order","message_template":"%s: ACME profile '%s' is not offered by CA, continuing without","reason":"Debug message indicating a non-mandatory profile isn't available from the CA, but the system will continue with default settings.","resolution":"No immediate resolution needed. If the specific profile features are desired, consider switching to a CA that supports that profile."},{"function":"ad_setup_order","message_template":"saving order in staging","reason":"Error context message when there's a problem saving the ACME order to the staging area.","resolution":"Check file system permissions and available disk space. Ensure the web server process has write access to the staging directory."},{"function":"md_acmev2_drive_renew","message_template":"%s: (ACMEv2) need certificate","reason":"Debug message indicating certificate renewal process has started for a domain.","resolution":"No resolution needed. This is a normal debug message during certificate renewal."},{"function":"md_acmev2_drive_renew","message_template":"Error waiting on domain names to be validated","reason":"Error indicating the domain validation process failed. This may happen due to DNS issues, network problems, or incorrect challenge response configuration.","resolution":"Check that DNS is properly configured for all domains. Ensure the server is reachable from the internet and that challenge files can be served or DNS TXT records can be set. Review the ACME CA logs for more specific details on which validations failed."},{"function":"md_acmev2_drive_renew","message_template":"Error waiting for order to become ready","reason":"Error when the ACME order doesn't transition to the 'ready' state within the expected timeframe. Likely due to validation problems or CA issues.","resolution":"Check domain validation status. Verify all domains in the certificate are accessible and properly configured. The ACME CA might be experiencing delays or issues - check their status page or try again later."},{"function":"md_acmev2_drive_renew","message_template":"%s: finalized order","reason":"Debug message indicating the order has been successfully finalized, and the system is now waiting for the certificate to be issued.","resolution":"No resolution needed. This is a normal debug message during successful certificate issuance."},{"function":"md_acmev2_drive_renew","message_template":"Error waiting for order to become valid.","reason":"Error when the ACME order doesn't transition to 'valid' state after finalization. This could be due to CA processing delays or issues with the CSR.","resolution":"Check that the CSR was properly formed and all required information was included. The CA might be experiencing delays - check their status page. If persistent, try creating a new order."},{"function":"md_acmev2_drive_renew","message_template":"Order valid, but certificate url is missing.","reason":"Error when an order is marked valid by the CA but doesn't contain a URL to download the certificate. This indicates a protocol error or CA issue.","resolution":"This is likely a CA-side issue or a protocol implementation bug. Check for updates to the software. If persistent, report the issue to the CA as it violates the ACME protocol specification."}],"project":"apache\/httpd"}