{"module":"md_acme_order.h","summary":"This header file defines the interface for handling ACME (Automated Certificate Management Environment) orders as part of a certificate management system. It provides structures and functions for creating, manipulating, saving, loading, and monitoring ACME orders used in certificate issuance workflows.","logs":[{"function":"md_acme_order_load","message_template":"Failed to load order from order.json","reason":"This message would likely be logged when there's a failure to load an ACME order from storage. This could happen if the file is corrupted or missing.","resolution":"Check if the order.json file exists in the expected location and has correct permissions. The file might need to be recreated by reinitiating the certificate request process."},{"function":"md_acme_order_save","message_template":"Failed to save order to order.json","reason":"This message would likely be logged when there's a failure to save an ACME order to storage. This could happen due to disk space issues or permission problems.","resolution":"Verify that the server has sufficient disk space and that the process has write permissions to the directory where order.json should be stored."},{"function":"md_acme_order_register","message_template":"Failed to register ACME order for domains","reason":"This message would likely be logged when there's a failure to register a new ACME order with the certificate authority. This could be due to network issues or problems with the ACME server.","resolution":"Check network connectivity to the ACME server. Verify that the account is properly registered and has the necessary permissions to request certificates for the specified domains."},{"function":"md_acme_order_start_challenges","message_template":"Failed to start challenges for order","reason":"This message would likely be logged when there's a failure to initiate the domain validation challenges. This could happen due to configuration issues or problems with the challenge types.","resolution":"Review the server configuration for the specified domain. Ensure that the selected challenge types are properly configured and that the server can respond to or create the required validation resources."},{"function":"md_acme_order_monitor_authzs","message_template":"Authorization monitoring timed out","reason":"This message would likely be logged when the system times out while waiting for domain validations to complete. The certificate authority didn't validate the domain ownership within the expected timeframe.","resolution":"Check if the domain validation challenges are properly configured. Ensure network connectivity and proper server configuration to respond to validation requests from the certificate authority."},{"function":"md_acme_order_await_ready","message_template":"Order failed to reach ready state within timeout","reason":"This message would likely be logged when the ACME order didn't transition to the 'ready' state within the expected timeframe. This indicates issues with domain validation.","resolution":"Review the domain validation challenges and ensure they are configured correctly. Check for any error messages from the certificate authority regarding validation failures."},{"function":"md_acme_order_await_valid","message_template":"Order failed to reach valid state within timeout","reason":"This message would likely be logged when the ACME order didn't transition to the 'valid' state within the expected timeframe. This indicates issues with certificate issuance.","resolution":"Check if the certificate signing request was properly submitted. Verify that the ACME account has no outstanding issues with the certificate authority."},{"function":"md_acme_order_update","message_template":"Failed to update order status","reason":"This message would likely be logged when there's a failure to update the status of an ACME order. This could be due to network issues or problems with the ACME server.","resolution":"Check network connectivity to the ACME server. Verify that the order URL is still valid and that the ACME account has access to the order."},{"function":"md_acme_order_purge","message_template":"Failed to purge order information","reason":"This message would likely be logged when there's a failure to delete or clean up order information. This could happen due to file system issues or permission problems.","resolution":"Check if the process has appropriate permissions to delete files in the storage location. Ensure there are no file locks or other processes accessing the files."}],"project":"apache\/httpd"}