{"module":"mod_md_md_acme_authz.h","summary":"This header file defines structures and functions for ACME (Automated Certificate Management Environment) domain authorization management in Apache's mod_md module. It specifies interfaces for retrieving, updating, responding to, and tearing down ACME authorization challenges for domain validation during certificate issuance.","logs":[{"function":"md_acme_authz_retrieve","message_template":"Failed to retrieve authorization for domain","reason":"The function failed to retrieve authorization information from the ACME server. This could happen due to network issues, server unavailability, or invalid URL.","resolution":"Check network connectivity to the ACME server. Verify the URL is correct and the ACME account has proper permissions."},{"function":"md_acme_authz_update","message_template":"Failed to update authorization status","reason":"The function failed to update the authorization status from the ACME server. This could be due to network issues or the authorization no longer being available.","resolution":"Check network connectivity to the ACME server. Verify the authorization has not expired or been revoked."},{"function":"md_acme_authz_respond","message_template":"Failed to respond to challenge","reason":"The function failed to set up or respond to an ACME challenge. This could be due to file system permissions, network issues, or incorrect configuration.","resolution":"Check that the server has appropriate permissions to create challenge files. Ensure the domain is correctly configured and accessible for validation."},{"function":"md_acme_authz_teardown","message_template":"Failed to teardown challenge resources","reason":"The function failed to clean up resources created for an ACME challenge. This is likely due to file system permissions or file locks.","resolution":"Check file system permissions and ensure no other processes are locking the challenge files. This is generally non-critical as files will be overwritten in subsequent validations."},{"function":"tls_alpn01_fnames","message_template":"Failed to generate filenames for TLS-ALPN-01 challenge","reason":"The function could not generate appropriate filenames for the TLS-ALPN-01 challenge resources, likely due to memory allocation issues.","resolution":"Check system resources and Apache configuration for memory constraints. This is a rare error that typically occurs in resource-constrained environments."}],"project":"apache\/httpd"}