{"module":"md_acme_drive.c","summary":"This module implements the ACME protocol driver for Apache's mod_md module, handling the lifecycle of certificate acquisition through ACME providers like Let's Encrypt. It manages account creation\/selection, domain validation challenges, certificate signing requests (CSRs), and certificate retrieval and storage.","logs":[{"function":"use_staged_acct","message_template":"re-using staged account","reason":"A staged (previously configured but not yet active) ACME account was found and is being reused for the managed domain","resolution":"Informational message, no resolution required"},{"function":"md_acme_drive_set_acct","message_template":"Selecting account to use for %s","reason":"The system is determining which ACME account to use for the specified managed domain","resolution":"Informational message, no resolution required"},{"function":"md_acme_drive_set_acct","message_template":"re-use account '%s'","reason":"The system is reusing an existing account that was specified in the managed domain configuration","resolution":"Informational message, no resolution required"},{"function":"md_acme_drive_set_acct","message_template":"rejected %s","reason":"The specified account was rejected, possibly because it doesn't exist or is invalid","resolution":"Check that the account identifier is correct and that the account exists in the ACME server. You may need to create a new account."},{"function":"md_acme_drive_set_acct","message_template":"%s: looking at existing accounts","reason":"The system is searching for existing ACME accounts that can be used with this managed domain","resolution":"Informational message, no resolution required"},{"function":"md_acme_drive_set_acct","message_template":"%s: using account %s (id=%s)","reason":"The system found and selected an existing ACME account for the managed domain","resolution":"Informational message, no resolution required"},{"function":"md_acme_drive_set_acct","message_template":"Creating new ACME account for %s","reason":"No suitable existing account was found, so a new ACME account is being created for the managed domain","resolution":"Informational message, no resolution required"},{"function":"md_acme_drive_set_acct","message_template":"%s: creating new account","reason":"The system is in the process of creating a new ACME account","resolution":"Informational message, no resolution required"},{"function":"md_acme_drive_set_acct","message_template":"No contact information is available for MD %s. Configure one using the MDContactEmail or ServerAdmin directive.","reason":"Cannot create a new ACME account because contact information is required but missing","resolution":"Add a contact email address using either the MDContactEmail directive or the ServerAdmin directive in your Apache configuration"},{"function":"md_acme_drive_set_acct","message_template":"the CA requires you to accept the terms-of-service as specified in <%s>. Please read the document that you find at that URL and, if you agree to the conditions, configure \"MDCertificateAgreement accepted\" in your Apache. Then (graceful) restart the server to activate.","reason":"Cannot create a new ACME account because the terms of service have not been accepted","resolution":"Review the terms of service at the given URL and, if you agree, add 'MDCertificateAgreement accepted' to your Apache configuration, then restart the server"},{"function":"md_acme_drive_set_acct","message_template":"the CA requires 'External Account Binding' which is not configured. This means you need to obtain a 'Key ID' and a 'HMAC' from the CA and configure that using the MDExternalAccountBinding directive in your config. The creation of a new ACME account will most likely fail, but an attempt is made anyway.","reason":"The ACME CA requires external account binding, which is not configured","resolution":"Contact your CA to obtain a Key ID and HMAC, then configure these using the MDExternalAccountBinding directive in your Apache configuration"},{"function":"get_up_link","message_template":"server reports up link as %s","reason":"The ACME server provided a link to the next certificate in the chain","resolution":"Informational message, no resolution required"},{"function":"add_http_certs","message_template":"parse certs from %s -> %d (%s)","reason":"The system is parsing certificate data received from the ACME server","resolution":"Informational message, no resolution required"},{"function":"add_http_certs","message_template":"cert not in response from %s","reason":"No certificate was found in the response from the ACME server","resolution":"This could be a temporary condition during certificate issuance. If it persists, check the ACME server status or try restarting the certificate request process."},{"function":"on_add_cert","message_template":"%d certs parsed","reason":"Certificate data was successfully parsed from the ACME server response","resolution":"Informational message, no resolution required"},{"function":"get_cert","message_template":"retrieving cert from %s","reason":"The system is attempting to retrieve a certificate from the specified URL","resolution":"Informational message, no resolution required"},{"function":"md_acme_drive_cert_poll","message_template":"poll for cert at %s","reason":"The system is polling for certificate availability at the specified URL","resolution":"Informational message, no resolution required"},{"function":"csr_req","message_template":"cert created with location header (old ACMEv1 style)","reason":"The certificate was created using the older ACMEv1 protocol style","resolution":"Informational message, no resolution required. Consider upgrading to an ACME provider that supports ACMEv2 protocol for better security and features."},{"function":"csr_req","message_template":"%s: saving cert url %s","reason":"Failed to save the certificate URL to the staging area","resolution":"Check permissions on the storage directory and available disk space. Ensure the Apache process has write access to the staging directory."},{"function":"csr_req","message_template":"cert parsed","reason":"A certificate was successfully parsed from the response","resolution":"Informational message, no resolution required"},{"function":"csr_req","message_template":"cert not in response, need to poll %s","reason":"The certificate was not included in the response and needs to be polled for later","resolution":"Informational message, no resolution required. The system will automatically poll for the certificate."},{"function":"md_acme_drive_setup_cred_chain","message_template":"Finalizing order for %s","reason":"The system is finalizing the certificate order for the specified managed domain","resolution":"Informational message, no resolution required"},{"function":"md_acme_drive_setup_cred_chain","message_template":"%s: generate %s privkey","reason":"The system is generating a new private key for the specified managed domain","resolution":"Informational message, no resolution required"},{"function":"md_acme_drive_setup_cred_chain","message_template":"Creating %s CSR","reason":"The system is creating a Certificate Signing Request (CSR) with the specified key type","resolution":"Informational message, no resolution required"},{"function":"md_acme_drive_setup_cred_chain","message_template":"%s: create %s CSR","reason":"The system is creating a Certificate Signing Request for the managed domain","resolution":"Informational message, no resolution required"},{"function":"md_acme_drive_setup_cred_chain","message_template":"Submitting %s CSR to CA","reason":"The system is submitting the Certificate Signing Request to the Certificate Authority","resolution":"Informational message, no resolution required"},{"function":"on_add_chain","message_template":"chain cert parsed","reason":"A certificate chain element was successfully parsed","resolution":"Informational message, no resolution required"},{"function":"get_chain","message_template":"next chain cert at %s","reason":"The system is retrieving the next certificate in the chain from the specified URL","resolution":"Informational message, no resolution required"},{"function":"get_chain","message_template":"error retrieving certificate from %s","reason":"Failed to retrieve a certificate from the specified URL","resolution":"Check network connectivity to the certificate URL. If the issue persists, the ACME server may be experiencing problems or the certificate might have been removed."},{"function":"get_chain","message_template":"no link header 'up' for new certificate, unable to retrieve chain","reason":"Cannot retrieve the certificate chain because the ACME server did not provide the necessary link","resolution":"This may indicate a problem with the ACME server or protocol. Try requesting a new certificate. If the problem persists, consider using a different ACME provider."},{"function":"get_chain","message_template":"got chain with %d certs (%d. attempt)","reason":"Successfully retrieved a certificate chain with the specified number of certificates","resolution":"Informational message, no resolution required"},{"function":"ad_chain_retrieve","message_template":"%s: asked to retrieve chain, but no order in context","reason":"Cannot retrieve certificate chain because the order information is missing","resolution":"This indicates an internal error in the certificate management process. Try restarting the certificate request process."},{"function":"ad_chain_retrieve","message_template":"%s: asked to retrieve chain, but no certificate url part of order","reason":"Cannot retrieve certificate chain because the certificate URL is missing from the order","resolution":"This indicates an internal error in the certificate management process. Try restarting the certificate request process."},{"function":"ad_chain_retrieve","message_template":"chain retrieved","reason":"The certificate chain was successfully retrieved","resolution":"Informational message, no resolution required"},{"function":"acme_driver_preload_init","message_template":"%s: init_base driver","reason":"The ACME driver base initialization is being performed for the specified managed domain","resolution":"Informational message, no resolution required"},{"function":"acme_driver_init","message_template":"the server seems neither reachable via http (port 80) nor https (port 443). Please look at the MDPortMap configuration directive on how to correct this. The ACME protocol needs at least one of those so the CA can talk to the server and verify a domain ownership. Alternatively, you may configure support for the %s challenge directive.","reason":"The server is not reachable on either port 80 or 443, which is required for ACME domain validation","resolution":"Configure port mapping using the MDPortMap directive or ensure that your server is reachable on standard HTTP\/HTTPS ports. Alternatively, configure the DNS-01 challenge method to avoid the need for HTTP validation."},{"function":"acme_driver_init","message_template":"None of the ACME challenge methods configured for this domain are suitable. The http: challenge 'http-01' is disabled because the server seems not reachable on public port 80. The https: challenge 'tls-alpn-01' is disabled because the server seems not reachable on public port 443. The https: challenge 'tls-alpn-01' is disabled because the Protocols configuration does not include the 'acme-tls\/1' protocol. The DNS challenge 'dns-01' is disabled because the directive 'MDChallengeDns01' is not configured.","reason":"None of the configured ACME challenge methods are suitable for domain validation","resolution":"Make sure your server is reachable on port 80 or 443, or configure the DNS-01 challenge method using the MDChallengeDns01 directive. For TLS-ALPN-01 challenge, ensure the 'acme-tls\/1' protocol is included in your Protocols configuration."},{"function":"acme_driver_init","message_template":"MDomain %s initialized with support for ACME challenges %s","reason":"The managed domain has been initialized with support for the specified ACME challenges","resolution":"Informational message, no resolution required"},{"function":"acme_driver_init","message_template":"%s: init driver","reason":"The ACME driver initialization is being performed for the specified managed domain","resolution":"Informational message, no resolution required"},{"function":"load_missing_creds","message_template":"%s: credentials staged for %s certificate","reason":"Credentials have been successfully staged for the specified certificate type","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"The managed domain %s is missing MDCertificateAuthority","reason":"Cannot renew certificate because no Certificate Authority is configured for the managed domain","resolution":"Configure a certificate authority URL using the MDCertificateAuthority directive in your Apache configuration"},{"function":"acme_renew","message_template":"Checking staging area","reason":"The system is checking the staging area for existing certificate data","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"%s: staging started, state=%d, attempt=%d, acme=%s, challenges='%s'","reason":"Certificate staging has started with the specified parameters","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"Resetting staging area","reason":"The staging area is being reset to prepare for a new certificate","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"%s: reset staging area","reason":"The staging area for the specified managed domain has been reset","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"resetting staging area","reason":"An error occurred while resetting the staging area","resolution":"Check permissions on the storage directory and available disk space. Ensure the Apache process has write access to the staging directory."},{"function":"acme_renew","message_template":"Assessing current status","reason":"The system is assessing the current status of the certificate renewal process","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"The managed domain %s is missing required information","reason":"Cannot proceed with certificate renewal because required information is missing for the managed domain","resolution":"Check the managed domain configuration for missing information such as contact email, terms of service agreement, or domain names"},{"function":"acme_renew","message_template":"%s: all credentials staged","reason":"All required credentials have been successfully staged for the managed domain","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"Resetting staging for %s","reason":"The staging area is being reset for the specified managed domain","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"%s: setup staging","reason":"Setting up the staging area for the managed domain","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"Saving MD information in staging area.","reason":"Failed to save managed domain information to the staging area","resolution":"Check permissions on the storage directory and available disk space. Ensure the Apache process has write access to the staging directory."},{"function":"acme_renew","message_template":"Contacting ACME server for %s at %s","reason":"The system is contacting the ACME server for the specified managed domain","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"setup ACME communications","reason":"Failed to set up communications with the ACME server","resolution":"Check network connectivity to the ACME server. Verify that your server can reach the ACME server URL and that any required proxy configuration is correct."},{"function":"acme_renew","message_template":"Driving ACME to renew %s certificate for %s","reason":"The system is initiating the ACME process to renew the certificate for the managed domain","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"ACME server speaks version 1, an obsolete version of the ACME protocol that is no longer supported.","reason":"The ACME server is using version 1 of the protocol, which is no longer supported","resolution":"Switch to an ACME provider that supports ACMEv2 protocol, such as Let's Encrypt or ZeroSSL"},{"function":"acme_renew","message_template":"Retrieving %s certificate chain for %s","reason":"The system is retrieving the certificate chain for the specified managed domain","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"%s: retrieving %s certificate chain","reason":"The system is retrieving the certificate chain for the managed domain","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"Unable to retrieve %s certificate chain.","reason":"Failed to retrieve the certificate chain for the specified certificate type","resolution":"Check network connectivity to the ACME server. If the issue persists, try requesting a new certificate."},{"function":"acme_renew","message_template":"Loading the private key.","reason":"Failed to load the private key from the staging area","resolution":"Check that the private key file exists and is readable by the Apache process. The key may be corrupted or have incorrect permissions."},{"function":"acme_renew","message_template":"Certificate and private key do not match.","reason":"The certificate and private key do not form a valid pair","resolution":"This indicates an error in the certificate issuance process. The system will automatically retry the certificate request."},{"function":"acme_renew","message_template":"Saving new %s certificate chain.","reason":"Failed to save the new certificate chain to the staging area","resolution":"Check permissions on the storage directory and available disk space. Ensure the Apache process has write access to the staging directory."},{"function":"acme_renew","message_template":"%s: certificates ready, activation delay set to %s","reason":"Certificates are ready and will be activated after the specified delay","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"%s: state is COMPLETE, checking existing certificates","reason":"The managed domain is in the COMPLETE state, and the system is checking existing certificates","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"%s: delay ready_at to now+1s","reason":"The certificate activation is being delayed by 1 second for testing purposes","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"The certificate for the managed domain has been renewed successfully and can be used from %s on.","reason":"Certificate renewal was successful, and the new certificate will be active from the specified time","resolution":"Informational message, no resolution required"},{"function":"acme_renew","message_template":"The certificate for the managed domain has been renewed successfully and can be used (valid since %s). A graceful server restart now is recommended.","reason":"Certificate renewal was successful, and the new certificate is already valid. A server restart is recommended to activate it.","resolution":"Perform a graceful restart of the Apache server to activate the new certificate"},{"function":"acme_preload","message_template":"%s: preload start","reason":"The certificate preload process is starting for the specified managed domain","resolution":"Informational message, no resolution required"},{"function":"acme_preload","message_template":"loading staged md.json","reason":"Failed to load the managed domain JSON data from the staging area","resolution":"Check that the md.json file exists in the staging area and is readable by the Apache process"},{"function":"acme_preload","message_template":"effective CA url not set","reason":"Cannot proceed with preload because the effective Certificate Authority URL is not set","resolution":"This indicates an error in the certificate staging process. Try restarting the certificate request process."},{"function":"acme_preload","message_template":"loading staged credentials #%d","reason":"Failed to load the staged credentials for the specified index","resolution":"Check that the credential files exist in the staging area and are readable by the Apache process"},{"function":"acme_preload","message_template":"no certificate in staged credentials #%d","reason":"No certificate was found in the staged credentials for the specified index","resolution":"This indicates an error in the certificate staging process. Try restarting the certificate request process."},{"function":"acme_preload","message_template":"certificate and private key do not match in staged credentials #%d","reason":"The certificate and private key in the staged credentials do not form a valid pair","resolution":"This indicates an error in the certificate staging process. Try restarting the certificate request process."},{"function":"acme_preload","message_template":"loading staged account","reason":"Failed to load the staged ACME account","resolution":"Check that the account files exist in the staging area and are readable by the Apache process"},{"function":"acme_preload","message_template":"purging order information","reason":"The system is purging order information from the staging area","resolution":"Informational message, no resolution required"},{"function":"acme_preload","message_template":"purging store tmp space","reason":"Failed to purge temporary space in the certificate store","resolution":"Check permissions on the storage directory. Ensure the Apache process has write access to the storage directory."},{"function":"acme_preload","message_template":"saving staged account","reason":"The system is saving the staged ACME account","resolution":"Informational message, no resolution required"},{"function":"acme_preload","message_template":"error searching for existing account by url","reason":"Failed to search for an existing account by URL","resolution":"Check the storage access permissions and ensure the Apache process can read from the accounts storage area"},{"function":"acme_preload","message_template":"error setting up acme","reason":"Failed to set up the ACME client","resolution":"Check network connectivity to the ACME server. Verify that your server can reach the ACME server URL and that any required proxy configuration is correct."},{"function":"acme_preload","message_template":"error saving account","reason":"Failed to save the ACME account to the storage","resolution":"Check permissions on the storage directory and available disk space. Ensure the Apache process has write access to the accounts storage area."},{"function":"acme_preload","message_template":"saving staged md\/privkey\/pubcert","reason":"The system is saving the managed domain, private key, and public certificate from staging","resolution":"Informational message, no resolution required"},{"function":"acme_preload","message_template":"writing md.json","reason":"Failed to write the managed domain JSON data","resolution":"Check permissions on the storage directory and available disk space. Ensure the Apache process has write access to the storage directory."},{"function":"acme_preload","message_template":"writing credentials #%d","reason":"Failed to write the credentials for the specified index","resolution":"Check permissions on the storage directory and available disk space. Ensure the Apache process has write access to the storage directory."},{"function":"acme_preload","message_template":"saved staged data successfully","reason":"All staged data was successfully saved to the target storage group","resolution":"Informational message, no resolution required"}],"project":"apache\/httpd"}