{"module":"md_acme_authz.c","summary":"This module implements the ACME authorization challenge process for domain validation. It supports HTTP-01, TLS-ALPN-01, and DNS-01 challenge types, handling the setup, response, and teardown of challenges during certificate issuance.","logs":[{"function":"md_acme_authz_update","message_template":"unable to parse response","reason":"The ACME server response could not be parsed, likely due to an unexpected format or syntax error.","resolution":"Check network connectivity and ACME server status. If the problem persists, the ACME server might be experiencing issues or its API might have changed."},{"function":"md_acme_authz_update","message_template":"challenge 'pending'","reason":"The authorization challenge is in a pending state, waiting for verification by the ACME server.","resolution":"This is an informational log, no resolution required. The challenge is in progress."},{"function":"md_acme_authz_update","message_template":"challenge 'valid'","reason":"The authorization challenge has been successfully validated by the ACME server.","resolution":"This is an informational log, no resolution required. The challenge was completed successfully."},{"function":"md_acme_authz_update","message_template":"challenge 'invalid'","reason":"The authorization challenge was rejected by the ACME server.","resolution":"Check the detailed error information in logs. Common issues include incorrect DNS records, server configuration problems, or network connectivity issues."},{"function":"md_acme_authz_update","message_template":"unable to understand response","reason":"The ACME server response was successfully parsed but contained unexpected data or status.","resolution":"This might indicate a change in the ACME protocol or server behavior. Check if updates are available for the module."},{"function":"md_acme_authz_update","message_template":"ACME server authz: %s for %s at %s. Exact response was: %s","reason":"Detailed log of the ACME server authorization response, including the status, domain, URL, and full response body.","resolution":"Use this detailed information to troubleshoot issues with the authorization process. The exact response can help identify specific problems."},{"function":"authz_http_set","message_template":"updated authz %s","reason":"The authorization has been updated with the ACME server.","resolution":"Informational log, no resolution required. The challenge response was successfully sent to the ACME server."},{"function":"cha_http_01_setup","message_template":"%s: event '%s' failed. aborting challenge setup","reason":"The HTTP-01 challenge setup was aborted due to a failed event, most likely in a clustered environment.","resolution":"Check cluster configuration and event distribution. Ensure all servers in the cluster can properly share challenge data."},{"function":"cha_tls_alpn_01_setup","message_template":"%s: protocol 'acme-tls\/1' seems not enabled for this domain, but is enabled for other associated domains. Continuing with fingers crossed.","reason":"The TLS-ALPN-01 challenge is being attempted even though the domain doesn't appear to support the 'acme-tls\/1' protocol.","resolution":"Verify TLS configuration for this domain. Ensure the acme-tls\/1 ALPN protocol is properly enabled for all domains in the certificate."},{"function":"cha_tls_alpn_01_setup","message_template":"%s: protocol 'acme-tls\/1' seems not enabled for this or any other associated domain. Not attempting challenge type tls-alpn-01.","reason":"The TLS-ALPN-01 challenge cannot be used because the acme-tls\/1 protocol is not enabled for any domain.","resolution":"Configure your web server to support the acme-tls\/1 ALPN protocol if you want to use this challenge type. Otherwise, use an alternative challenge type like HTTP-01 or DNS-01."},{"function":"cha_tls_alpn_01_setup","message_template":"%s: create tls-alpn-01 validation token","reason":"Error occurred while creating the validation token for the TLS-ALPN-01 challenge.","resolution":"Check system resources and permissions. This is typically a cryptographic operation that shouldn't fail under normal circumstances."},{"function":"cha_tls_alpn_01_setup","message_template":"%s: create tls-alpn-01 %s challenge key","reason":"Error occurred while creating the private key for the TLS-ALPN-01 challenge certificate.","resolution":"Check system resources and permissions. Ensure the process has access to sufficient entropy for key generation."},{"function":"cha_tls_alpn_01_setup","message_template":"%s: create tls-alpn-01 %s challenge cert","reason":"Error occurred while creating the certificate for the TLS-ALPN-01 challenge.","resolution":"Check system resources and permissions. Ensure OpenSSL or other cryptographic libraries are properly installed and functioning."},{"function":"cha_tls_alpn_01_setup","message_template":"%s: event '%s' failed. aborting challenge setup","reason":"The TLS-ALPN-01 challenge setup was aborted due to a failed event, most likely in a clustered environment.","resolution":"Check cluster configuration and event distribution. Ensure all servers in the cluster can properly share challenge data."},{"function":"cha_dns_01_setup","message_template":"%s: dns-01 command not set","reason":"The DNS-01 challenge cannot be used because no DNS update command was configured.","resolution":"Configure a DNS-01 command in your Apache configuration using the appropriate directive. This command should be able to add and remove the necessary TXT records."},{"function":"cha_dns_01_setup","message_template":"%s: create dns-01 token for %s","reason":"Error occurred while creating the validation token for the DNS-01 challenge.","resolution":"Check system resources and permissions. This is typically a cryptographic operation that shouldn't fail under normal circumstances."},{"function":"cha_dns_01_setup","message_template":"%s: dns-01 setup command: %s","reason":"Debug log showing the exact command that will be executed to set up the DNS-01 challenge.","resolution":"Informational log, no resolution required. Useful for debugging DNS-01 setup issues."},{"function":"cha_dns_01_setup","message_template":"%s: dns-01 setup command failed to execute for %s","reason":"The command to set up the DNS-01 challenge could not be executed.","resolution":"Verify that the configured DNS-01 command exists and is executable by the web server process. Check file permissions and path."},{"function":"cha_dns_01_setup","message_template":"%s: dns-01 setup command returns %d for %s","reason":"The DNS-01 setup command executed but returned a non-zero exit code, indicating failure.","resolution":"Check the command's error output (it may be in the server error log). Ensure the DNS API credentials are correct and the command has proper permissions to update DNS records."},{"function":"cha_dns_01_setup","message_template":"%s: event '%s' failed. aborting challenge setup","reason":"The DNS-01 challenge setup was aborted due to a failed event, most likely in a clustered environment.","resolution":"Check cluster configuration and event distribution. Ensure all servers in the cluster can properly share challenge data."},{"function":"cha_dns_01_setup","message_template":"%s: dns-01 setup succeeded for %s","reason":"The DNS-01 challenge setup was successful.","resolution":"Informational log, no resolution required. The DNS record has been successfully added."},{"function":"cha_dns_01_teardown","message_template":"%s: dns-01 command not set for %s","reason":"The DNS-01 challenge cannot be cleaned up because no DNS update command was configured.","resolution":"Configure a DNS-01 command in your Apache configuration. Even for cleanup, a command must be specified."},{"function":"cha_dns_01_teardown","message_template":"%s: dns-01 teardown command failed (exit code=%d) for %s","reason":"The command to clean up the DNS-01 challenge failed.","resolution":"Check the command's error output. While cleanup failures don't prevent certificate issuance, you may need to manually remove DNS TXT records."},{"function":"md_acme_authz_respond","message_template":"%s: selecting suitable authorization challenge type, this domain supports %s","reason":"The module is selecting a suitable challenge type from the ones supported by the domain.","resolution":"Informational log, no resolution required. Shows which challenge types are being considered."},{"function":"md_acme_authz_respond","message_template":"%s: challenge type '%s' for %s: %s","reason":"Debug log indicating whether a specific challenge type is applicable for the domain.","resolution":"Informational log, no resolution required. Useful for debugging challenge selection issues."},{"function":"md_acme_authz_respond","message_template":"Setting up challenge '%s' for domain %s","reason":"The module is beginning the setup of the selected challenge type for the domain.","resolution":"Informational log, no resolution required. Indicates which challenge is being attempted."},{"function":"md_acme_authz_respond","message_template":"%s: set up challenge '%s' for %s","reason":"The challenge setup was successful.","resolution":"Informational log, no resolution required. The challenge is ready for verification by the ACME server."},{"function":"md_acme_authz_respond","message_template":"error setting up challenge '%s' for %s, for domain %s, looking for other option","reason":"The challenge setup failed, and the module will try another challenge type if available.","resolution":"Check logs for specific error details about why the challenge setup failed. The module will attempt other challenge types automatically."},{"function":"md_acme_authz_respond","message_template":"None of offered challenge types for domain %s are supported. The server offered '%s' and available are: '%s'.","reason":"There is no overlap between the challenge types offered by the ACME server and those supported by the module configuration.","resolution":"Configure additional challenge types. For wildcard certificates, you need DNS-01 challenges. For standard certificates, ensure HTTP-01 or TLS-ALPN-01 is properly configured."},{"function":"md_acme_authz_respond","message_template":"None of the offered challenge types %s offered for domain %s could be setup successfully. Please check the log for errors.","reason":"The module tried all applicable challenge types but none could be set up successfully.","resolution":"Review earlier error logs for specific failures. Check server configuration, DNS settings, or command availability depending on the challenge types being attempted."}],"project":"apache\/httpd"}