{"module":"md_crypt.c","summary":"This module provides cryptographic functionality for managing TLS certificates, keys, and related operations for the Apache mod_md module. It includes functions for working with private keys, certificates, certificate signing requests, and cryptographic operations like signing and digest calculation.","logs":[{"function":"md_crypt_init","message_template":"initializing RAND","reason":"Indicates that random number generator initialization is in progress","resolution":"Information log, no resolution required"},{"function":"md_pkey_fload","message_template":"error loading pkey %s: %s (pass phrase was %snull)","reason":"Failed to load a private key from the specified file, possibly due to incorrect pass phrase, file permissions, or corrupted key file","resolution":"Verify that the key file exists, has proper permissions, and that the correct passphrase is being used. Check the error string for specific OpenSSL errors."},{"function":"pkey_to_buffer","message_template":"PEM_write key: %ld %s","reason":"Error encountered when writing a private key to PEM format in memory","resolution":"Check the OpenSSL error string for details on the specific error. May indicate memory issues or encryption errors."},{"function":"md_pkey_fsave","message_template":"save pkey %s (%s pass phrase, len=%d)","reason":"Debug information about saving a private key to file, indicating whether a pass phrase was used","resolution":"Information log, no resolution required"},{"function":"md_pkey_read_http","message_template":"error loading pkey from http response: %s","reason":"Failed to load a private key from an HTTP response, likely due to incorrect format or corrupted data","resolution":"Verify that the HTTP response contains a valid private key in PEM format. Check the error string for specific OpenSSL errors."},{"function":"gen_rsa","message_template":"error generate pkey RSA %d","reason":"Failed to generate an RSA private key with the specified bit length","resolution":"Check if sufficient entropy is available for key generation. For very large key sizes, increase system resources or timeout values."},{"function":"check_EC_curve","message_template":"error looking up OpenSSL builtin EC curves","reason":"Failed to retrieve the list of elliptic curves supported by OpenSSL","resolution":"This indicates an OpenSSL library issue. Check your OpenSSL version and consider upgrading."},{"function":"gen_ec","message_template":"ec curve unknown: %s","reason":"The specified elliptic curve name is not recognized by OpenSSL","resolution":"Use a supported elliptic curve name (e.g., 'secp384r1', 'secp256r1', 'X25519'). Check your configuration to ensure the curve name is correctly specified."},{"function":"gen_ec","message_template":"error generate EC key for group: %s","reason":"Failed to generate an EC key using the specified curve","resolution":"Verify that the curve is supported by your OpenSSL version. Check system entropy levels and available resources."},{"function":"md_crypt_sign64","message_template":"signing","reason":"Error occurred during a signing operation","resolution":"Check for sufficient system resources. This generic error might require examining other logs for context. Verify the integrity of the private key being used."},{"function":"cert_chain_read_http","message_template":"chain_read, processing %d response","reason":"Debug information about processing an HTTP response containing certificate chain data","resolution":"Information log, no resolution required"},{"function":"cert_chain_read_http","message_template":"attempting to parse certificates from unrecognized content-type: %s","reason":"The system is trying to parse certificates from a response with an unexpected content-type","resolution":"Verify that the server is returning certificates with the correct content type. Expected types are 'application\/pkix-cert', 'application\/pem-certificate-chain', or 'text\/plain'."},{"function":"cert_chain_read_http","message_template":"certificate chain response did not contain any certificates (suspicious content-type: %s)","reason":"The response was expected to contain certificates but none were found","resolution":"Check the server configuration to ensure it's correctly serving certificates. Verify the request URL is correct. Examine the content-type to ensure it's appropriate for certificate data."},{"function":"cert_chain_read_http","message_template":"parsed certs from content-type=%s, content-length=%ld","reason":"Debug information about successfully parsing certificates from an HTTP response","resolution":"Information log, no resolution required"},{"function":"md_chain_fappend","message_template":"no certificates in non-empty chain %s","reason":"A file that should contain certificate chain data has content but no valid certificates could be parsed","resolution":"Verify the file format is correct PEM format. The file might be corrupted or contain unexpected content that isn't a valid certificate."},{"function":"md_chain_fappend","message_template":"read chain file %s, found %d certs","reason":"Debug information about reading certificates from a chain file","resolution":"Information log, no resolution required"},{"function":"md_cert_read_http","message_template":"parsing cert from content-type=%s, content-length=%ld","reason":"Debug information about parsing a certificate from an HTTP response","resolution":"Information log, no resolution required"},{"function":"md_cert_covers_md","message_template":"cert has %d alt names","reason":"Debug information about the number of alternative names in a certificate","resolution":"Information log, no resolution required"},{"function":"md_cert_covers_md","message_template":"md domain %s not covered by cert","reason":"A domain in the managed domain is not covered by the certificate being checked","resolution":"The certificate is not valid for all required domains. A new certificate may need to be obtained that includes all the domains in the managed domain."},{"function":"md_cert_covers_md","message_template":"cert has NO alt names","reason":"Warning that a certificate has no alternative names, which is unusual for a server certificate","resolution":"The certificate might be invalid or not suitable for server use. A valid server certificate should have at least one DNS name in the Subject Alternative Name extension."},{"function":"add_ext","message_template":"add_ext, create, nid=%d value='%s' (lib=%d, reason=%d)","reason":"Error when creating an X.509 extension during certificate operations","resolution":"This is likely a technical issue with OpenSSL. Check the error details for specific information. May require updating OpenSSL or adjusting certificate parameters."},{"function":"add_ext","message_template":"add_ext, add, nid=%d value='%s' (lib=%d, reason=%d)","reason":"Error when adding an X.509 extension to a certificate during certificate operations","resolution":"This is likely a technical issue with OpenSSL. Check the error details for specific information. May require updating OpenSSL or adjusting certificate parameters."},{"function":"add_must_staple","message_template":"%s: unable to get NID for v3 must-staple TLS feature","reason":"Failed to get the OpenSSL NID (Numerical IDentifier) for the must-staple TLS feature","resolution":"Your OpenSSL version may not support the must-staple extension. Consider upgrading OpenSSL or disabling the must-staple feature in your configuration."},{"function":"add_must_staple","message_template":"%s: unable to create x509 extension for must-staple","reason":"Failed to create the X.509 extension for must-staple","resolution":"Your OpenSSL version may not properly support the must-staple extension. Consider upgrading OpenSSL or disabling the must-staple feature in your configuration."},{"function":"md_cert_req_create","message_template":"%s: openssl alloc X509 things","reason":"Memory allocation error when creating X.509 certificate request structures","resolution":"Check system memory availability. If the problem persists, it may indicate a more serious system resource issue."},{"function":"md_cert_req_create","message_template":"%s: REQ name add entry","reason":"Error when adding a name entry to a certificate request","resolution":"This is likely a technical issue with OpenSSL. Check system resources and OpenSSL version compatibility."},{"function":"md_cert_req_create","message_template":"%s: collecting alt names","reason":"Error when collecting alternative names for a certificate request","resolution":"Verify the format of domain names in your configuration. Ensure they comply with DNS naming rules."},{"function":"md_cert_req_create","message_template":"%s: you requested that a certificate is created with the 'must-staple' extension...","reason":"The SSL library was unable to initialize the must-staple extension when creating a certificate request","resolution":"Configure 'MDMustStaple off' for your domains until this issue is resolved. Consider filing a bug report with details about your platform and SSL library."},{"function":"md_cert_req_create","message_template":"%s: adding exts","reason":"Error when adding extensions to a certificate request","resolution":"This is likely a technical issue with OpenSSL. Check the OpenSSL version and consider updating."},{"function":"md_cert_req_create","message_template":"%s: set pkey in csr","reason":"Error when setting the public key in a certificate signing request","resolution":"Verify the integrity of the private key. This could indicate corruption or incompatibility."},{"function":"md_cert_req_create","message_template":"%s: sign csr","reason":"Error when signing a certificate signing request","resolution":"Verify the integrity and permissions of the private key. Check if the key algorithm is compatible with the signing operation."},{"function":"md_cert_req_create","message_template":"%s: der length","reason":"Error when determining the DER encoding length for a certificate signing request","resolution":"This is a technical issue with the certificate encoding. Check the OpenSSL version and consider updating."},{"function":"md_cert_req_create","message_template":"%s: csr der enc","reason":"Error when DER encoding a certificate signing request","resolution":"This is a technical issue with the certificate encoding. Check the OpenSSL version and consider updating."},{"function":"mk_x509","message_template":"%s: openssl alloc X509 things","reason":"Memory allocation error when creating X.509 certificate structures","resolution":"Check system memory availability. If the problem persists, it may indicate a more serious system resource issue."},{"function":"mk_x509","message_template":"%s: setup random serial","reason":"Error when generating a random serial number for a certificate","resolution":"This could indicate issues with the random number generator. Check system entropy sources."},{"function":"mk_x509","message_template":"%s: set serial number","reason":"Error when setting the serial number in a certificate","resolution":"This is likely a technical issue with OpenSSL. Check the OpenSSL version and consider updating."},{"function":"mk_x509","message_template":"%s: setting x.509v3","reason":"Error when setting the X.509 version to v3","resolution":"This is likely a technical issue with OpenSSL. Check the OpenSSL version and consider updating."},{"function":"mk_x509","message_template":"%s: name add entry","reason":"Error when adding a name entry to a certificate","resolution":"This is likely a technical issue with OpenSSL. Check if the common name is valid and complies with X.509 rules."},{"function":"mk_x509","message_template":"%s: set basic constraints ext","reason":"Error when setting basic constraints extension in a certificate","resolution":"This is likely a technical issue with OpenSSL. Check the OpenSSL version and consider updating."},{"function":"mk_x509","message_template":"%s: set pkey in x509","reason":"Error when setting the public key in a certificate","resolution":"Verify the integrity of the private key. This could indicate corruption or incompatibility."},{"function":"md_cert_self_sign","message_template":"%s: set alt_name ext","reason":"Error when setting the alternative names extension in a self-signed certificate","resolution":"Verify that the domain names are valid and properly formatted. Check for special characters or excessive length."},{"function":"md_cert_self_sign","message_template":"%s: set keyUsage","reason":"Error when setting the key usage extension in a certificate","resolution":"This is likely a technical issue with OpenSSL. Check the OpenSSL version and consider updating."},{"function":"md_cert_self_sign","message_template":"%s: set extKeyUsage","reason":"Error when setting the extended key usage extension in a certificate","resolution":"This is likely a technical issue with OpenSSL. Check the OpenSSL version and consider updating."},{"function":"md_cert_self_sign","message_template":"%s: sign x509","reason":"Error when signing a certificate","resolution":"Verify the integrity and permissions of the private key. Check if the key algorithm is compatible with the signing operation."},{"function":"md_cert_make_tls_alpn_01","message_template":"%s: set pe-acmeIdentifier","reason":"Error when setting the ACME identifier in a TLS-ALPN-01 challenge certificate","resolution":"This is likely a technical issue with OpenSSL. The ACME identifier extension may not be properly supported. Check OpenSSL version compatibility."},{"function":"md_cert_get_ct_scts","message_template":"ct_sct, found %d SCT extensions","reason":"Debug information about the number of CT SCT extensions found in a certificate","resolution":"Information log, no resolution required"},{"function":"md_cert_get_ocsp_responder_url","message_template":"ocsp responder found '%s'","reason":"Debug information about finding an OCSP responder URL in a certificate","resolution":"Information log, no resolution required"}],"project":"apache\/httpd"}