{"module":"md_http.c","summary":"This module implements an HTTP client library for making requests using different HTTP methods (GET, HEAD, POST). It provides functionality to create, configure, and execute HTTP requests with support for timeouts, proxies, and TLS configurations.","logs":[{"function":"md_http_create","message_template":"No HTTP implementation available","reason":"Attempt to create an HTTP client when no implementation has been registered using md_http_use_implementation()","resolution":"Ensure an HTTP implementation is registered using md_http_use_implementation() before creating HTTP clients"},{"function":"md_http_create","message_template":"Failed to initialize HTTP implementation","reason":"The HTTP implementation's initialization function returned an error","resolution":"Check the specific error code returned by the implementation and ensure the system has all necessary resources for the HTTP implementation"},{"function":"md_http_create","message_template":"Failed to create bucket allocator","reason":"Memory allocation failure when creating the APR bucket allocator","resolution":"Check system memory resources and ensure sufficient memory is available for APR operations"},{"function":"req_set_body","message_template":"Failed to determine body length","reason":"Error when calling apr_brigade_length() to detect the length of the request body","resolution":"Ensure the bucket brigade is properly initialized and contains valid data"},{"function":"req_set_body_data","message_template":"Failed to write data to bucket brigade","reason":"Error when calling apr_brigade_write() to add data to the request body","resolution":"Check that the provided data is valid and that system memory resources are adequate"},{"function":"req_create","message_template":"Failed to create memory pool for request","reason":"Memory allocation failure when creating the APR pool for a new HTTP request","resolution":"Check system memory resources and ensure sufficient memory is available for APR operations"},{"function":"md_http_perform","message_template":"HTTP request execution failed","reason":"The implementation's perform function returned an error while executing the HTTP request","resolution":"Check network connectivity, DNS resolution, and server availability. Also verify that request parameters are valid"},{"function":"md_http_multi_perform","message_template":"Multiple HTTP request execution failed","reason":"Error occurred while executing multiple HTTP requests concurrently","resolution":"Check network connectivity, DNS resolution, and server availability. Also ensure system has sufficient resources for concurrent requests"}],"project":"apache\/httpd"}