{"module":"mod_md_md_http.h","summary":"This header file defines HTTP client functionality for Apache's mod_md module, providing functions for making HTTP requests, handling responses, and managing timeouts. It includes structures for requests, responses, callbacks, and timeouts, as well as functions for creating and performing various types of HTTP requests.","logs":[{"function":"md_http_create","message_template":"Failed to create HTTP client instance","reason":"This message would be logged when the HTTP client instance cannot be created, possibly due to memory allocation issues or invalid parameters.","resolution":"Check system resources and verify the parameters passed to md_http_create function. Ensure that the pool, user_agent, and proxy_url are valid."},{"function":"md_http_clone","message_template":"Failed to clone HTTP client instance","reason":"This message would be logged when cloning an HTTP client fails, possibly due to memory allocation issues.","resolution":"Check system resources and ensure the source HTTP client instance is valid."},{"function":"md_http_perform","message_template":"HTTP request failed with status: %d","reason":"This message would be logged when an HTTP request fails with a non-success status code or network error.","resolution":"Check network connectivity, verify the URL is correct, and inspect the specific status code for more detailed troubleshooting. May require checking server logs or network configuration."},{"function":"md_http_perform","message_template":"Connection timed out after %d ms","reason":"This message would be logged when an HTTP request exceeds the overall timeout setting.","resolution":"Consider increasing the timeout value if the resource legitimately needs more time, or investigate network\/server performance issues."},{"function":"md_http_perform","message_template":"Connection establishment timed out after %d ms","reason":"This message would be logged when establishing a connection takes longer than the connect timeout setting.","resolution":"Check network connectivity to the target server. May indicate network congestion, firewall issues, or server unavailability."},{"function":"md_http_perform","message_template":"Connection stalled (below %ld bytes\/sec for %d ms)","reason":"This message would be logged when the data transfer rate falls below the stall detection threshold for the specified duration.","resolution":"Investigate network throughput issues, server load problems, or increase the stall detection threshold if appropriate."},{"function":"md_http_perform","message_template":"Response size exceeded limit of %ld bytes","reason":"This message would be logged when the response body exceeds the configured size limit (resp_limit).","resolution":"Either increase the response limit if larger responses are expected, or check why the server is returning unexpectedly large responses."},{"function":"md_http_perform","message_template":"Certificate verification failed using CA file: %s","reason":"This message would be logged when SSL\/TLS certificate verification fails using the specified CA file.","resolution":"Verify the CA file is valid and contains the necessary root certificates. Check if the server's certificate chain is complete and valid."},{"function":"md_http_perform","message_template":"Failed to connect to unix socket: %s","reason":"This message would be logged when connection to the specified Unix domain socket fails.","resolution":"Check if the Unix socket exists, has correct permissions, and that the service using it is running properly."},{"function":"md_http_multi_perform","message_template":"Multi-request operation failed","reason":"This message would be logged when the parallel execution of multiple HTTP requests encounters an error.","resolution":"Check individual request logs for specific failures. May indicate resource exhaustion when handling multiple concurrent requests."}],"project":"apache\/httpd"}