{"module":"md_json.c","summary":"This module provides JSON handling utilities for Apache's mod_md module, wrapping the Jansson JSON library with convenient functions for creating, manipulating, and persisting JSON data. It supports various data types, array operations, and file\/HTTP operations for JSON content.","logs":[{"function":"md_json_writep","message_template":"md_json_writep failed to dump JSON","reason":"Occurs when the Jansson library's json_dump_callback returns an error during JSON serialization to a string","resolution":"This typically indicates a memory issue or corrupted JSON structure. Verify the JSON object's integrity and ensure sufficient memory is available."},{"function":"md_json_writef","message_template":"md_json_writef: error writing file","reason":"Triggered when the system fails to write the serialized JSON data to a file","resolution":"Check file system permissions, available disk space, and whether the destination directory exists and is writable."},{"function":"md_json_writef","message_template":"md_json_writef: error dumping json (%s)","reason":"Occurs when the JSON cannot be serialized before writing to a file, includes JSON object state information","resolution":"Examine the JSON object state information provided in the log message to identify potential structural issues in the JSON data."},{"function":"write_json","message_template":"freplace json in %s","reason":"Logged when replacing a JSON file atomically fails","resolution":"Check file system permissions, available disk space, and temporary directory access rights. Could also indicate concurrent file access issues."},{"function":"md_json_readb","message_template":"failed to load JSON file: %s (line %d:%d)","reason":"The JSON parser encountered an error when parsing JSON from a bucket brigade","resolution":"Examine the syntax error details provided in the log message. The line and column numbers indicate where in the JSON text the parsing failed, which helps identify malformed JSON."},{"function":"md_json_readf","message_template":"failed to load JSON file %s: %s (line %d:%d)","reason":"Failed to parse a JSON file, providing the filename and parsing error details","resolution":"Verify the JSON file format at the indicated line and column. Check for syntax errors like missing commas, quotes, or brackets. The file might be corrupted or not valid JSON."}],"project":"apache\/httpd"}