{"module":"md_ocsp.c","summary":"This module implements OCSP (Online Certificate Status Protocol) functionality for Apache mod_md, handling certificate revocation checking via OCSP responders. It manages status retrieval, caching, and scheduled renewals of OCSP responses to support certificate validation during TLS connections.","logs":[{"function":"md_ocsp_prime","message_template":"md[%s]: priming OCSP status","reason":"Informational message indicating the initialization of OCSP status checking for the specified managed domain.","resolution":"This is an informational message indicating normal operation. No action required."},{"function":"md_ocsp_prime","message_template":"md[%s]: getting ocsp responder from cert","reason":"The system is attempting to extract the OCSP responder URL from the certificate for the specified managed domain.","resolution":"Informational message; no action required. This is part of normal OCSP setup."},{"function":"md_ocsp_prime","message_template":"md[%s]: certificate with serial %s has no OCSP responder URL","reason":"The certificate doesn't contain an OCSP responder URL, which means OCSP status checking won't be available for this certificate.","resolution":"Acquire a certificate from a CA that provides OCSP responder information if OCSP validation is required. Some CAs might not support OCSP or might use CRL instead."},{"function":"md_ocsp_prime","message_template":"md[%s]: unable to create OCSP certid for certificate with serial %s","reason":"The system failed to create an OCSP certificate identifier, which is required for OCSP validation. This could be due to an incompatible or malformed certificate.","resolution":"Check the certificate format and structure. This might indicate a problem with the certificate or with the OpenSSL library being used."},{"function":"md_ocsp_prime","message_template":"md[%s]: adding ocsp info (responder=%s)","reason":"Successfully configured OCSP checking for the certificate, indicating the URL of the responder that will be used.","resolution":"Informational message; no action required. OCSP status checking is properly set up."},{"function":"md_ocsp_get_status","message_template":"md[%s]: OCSP, get_status","reason":"The server is requesting the OCSP status for a certificate in the specified managed domain.","resolution":"Informational message; no action required. This is part of normal TLS handshake processing."},{"function":"md_ocsp_get_status","message_template":"md[%s]: OCSP, no response available","reason":"The server doesn't have a cached OCSP response for the certificate. This might be temporary during initial setup or could indicate problems contacting the OCSP responder.","resolution":"If persistent, check connectivity to the OCSP responder URL and ensure your network allows the required outbound connections. Initial occurrences are normal."},{"function":"md_ocsp_get_status","message_template":"md[%s]: OCSP, provided %ld bytes of response","reason":"Successfully provided an OCSP response of the specified size for a certificate status request.","resolution":"Informational message; no action required. OCSP status checking is working properly."},{"function":"ostat_on_resp","message_template":"status of certid %s, reading response","reason":"The system is processing an OCSP response for the specified certificate ID.","resolution":"Informational message; no action required. Part of normal OCSP response processing."},{"function":"ostat_on_resp","message_template":"req[%d] response body does not parse as OCSP response, status=%d, body brigade length=%ld","reason":"The OCSP responder returned data that cannot be parsed as a valid OCSP response. This could indicate a misconfigured responder or network interference.","resolution":"Check if the OCSP responder URL is correct and functional. Network issues or proxy configurations might be interfering with the response. Try accessing the responder URL directly to verify it's operational."},{"function":"ostat_on_resp","message_template":"OCSP response status is, unsuccessfully, %d","reason":"The OCSP response indicates a failure status. The numeric code provides details about the specific failure.","resolution":"Check the OCSP error code and address accordingly. Common issues include temporary responder unavailability, malformed requests, or server-side problems at the CA."},{"function":"ostat_on_resp","message_template":"OCSP response has no basicresponse","reason":"The OCSP response is missing the required basic response structure, indicating it's malformed or incomplete.","resolution":"This usually indicates a problem with the OCSP responder. Contact the certificate issuer if the problem persists, as their OCSP service may be misconfigured."},{"function":"ostat_on_resp","message_template":"req[%d]: OCSP response nonce does match","reason":"The nonce in the OCSP response matches the one sent in the request, confirming the response is fresh and specific to this request.","resolution":"Informational message; no action required. This is a security validation success."},{"function":"ostat_on_resp","message_template":"OCSP nonce mismatch in response","reason":"The nonce in the OCSP response doesn't match the one sent in the request. This could indicate a replay attack or a cached response being served incorrectly.","resolution":"If persistent, this might indicate security issues with the OCSP responder. Contact the certificate issuer to report the problem. In some cases, responders are configured not to return nonces for scalability reasons."},{"function":"ostat_on_resp","message_template":"req[%d]: OCSP response did not return the nonce","reason":"The OCSP response does not include a nonce. While not strictly required, this means freshness cannot be cryptographically verified.","resolution":"Informational message; usually no action required. Many large-scale OCSP responders don't include nonces to enable response caching."},{"function":"ostat_on_resp","message_template":"OCSP response, no matching status reported for %s","reason":"The OCSP response doesn't contain status information for the requested certificate. The responder might be misconfigured or not authoritative for this certificate.","resolution":"Verify that the certificate was issued by the CA operating the OCSP responder. If using a third-party OCSP responder, ensure it's authorized to provide status for this certificate."},{"function":"ostat_on_resp","message_template":"%s, status list [%s]","reason":"Provides details about the OCSP response content, listing the certificate statuses included in the response, which don't match the requested certificate.","resolution":"This helps diagnose the previous 'no matching status' error. Compare the listed certificates with the one expected to identify misconfigurations."},{"function":"ostat_on_resp","message_template":"OCSP basicresponse says cert is unknown","reason":"The OCSP responder reports it has no knowledge of the certificate status. This typically means the certificate wasn't issued by the expected CA or has been improperly registered.","resolution":"Verify the certificate chain and ensure the OCSP responder URL matches the issuing CA. If the certificate is new, there might be propagation delays to OCSP services."},{"function":"ostat_on_resp","message_template":"error DER encoding OCSP response","reason":"Failed to re-encode the OCSP response for storage. This is an internal processing error, possibly due to memory constraints or malformed data.","resolution":"Check system resources and OpenSSL library status. This is usually a transient error that might resolve on retry, but could indicate deeper system issues if persistent."},{"function":"ostat_on_resp","message_template":"error saving OCSP status","reason":"The system was unable to save the retrieved OCSP response to storage. This might be due to permissions issues or storage constraints.","resolution":"Check file system permissions and available disk space. The Apache process needs write access to the storage directory configured for mod_md."},{"function":"ostat_on_resp","message_template":"certificate status is %s, status valid %s","reason":"Successfully determined and saved the certificate status (GOOD or REVOKED) and its validity period.","resolution":"Informational message for successful operation. If the status is REVOKED, immediate action is required to replace the certificate."},{"function":"ostat_on_req_status","message_template":"OCSP status update failed (%d. time)","reason":"The attempt to update the OCSP status for a certificate has failed. The count indicates how many consecutive failures have occurred.","resolution":"Check connectivity to the OCSP responder and network configurations. Persistent failures might indicate the responder is down or unreachable. After multiple retries, you may need to contact the certificate issuer."},{"function":"ostat_on_req_status","message_template":"ocsp-error","reason":"An error occurred during OCSP processing. This is typically logged alongside other more specific error messages.","resolution":"Review accompanying log messages for more details. May require checking network connectivity, responder status, or certificate validity."},{"function":"ostat_on_req_status","message_template":"ocsp-errored","reason":"Event notification indicating an error in OCSP processing. This is fired to notify subsystems of the failure.","resolution":"Check previous log entries for specific error details. May require administrator attention depending on the error."},{"function":"ostat_on_req_status","message_template":"ocsp-renewed","reason":"Event notification indicating successful renewal of OCSP status information.","resolution":"Informational message; no action required. OCSP status has been successfully updated."},{"function":"next_todo","message_template":"scheduling OCSP request[%d] for %s, %d request in flight","reason":"The system is scheduling an OCSP status update check for the specified domain, showing the current workload of in-flight requests.","resolution":"Informational message; no action required. Part of normal OCSP renewal processing."},{"function":"md_ocsp_renew","message_template":"OCSP status updates due: %d","reason":"Indicates the number of certificates that need their OCSP status updated in the current renewal cycle.","resolution":"Informational message; no action required. If consistently high numbers are seen, consider adjusting renewal windows or checking for responder delays."},{"function":"md_ocsp_renew","message_template":"ocsp_renew done","reason":"The OCSP renewal process has completed, either successfully or with errors that were logged separately.","resolution":"Informational message; no action required unless accompanied by error messages."}],"project":"apache\/httpd"}