{"module":"md_status.c","summary":"This module handles status tracking and job persistence for Apache's mod_md managed domains, providing tracking of certificate status, renewal operations, and error conditions.","logs":[{"function":"job_result_update","message_template":"%s%s%s","reason":"Logs progress updates for certificate management operations, combining activity, details, and problems into a structured message.","resolution":"Information log only. If problems are reported, check domain configuration and ACME server connectivity."},{"function":"job_result_update","message_template":"%s%sproblem: %s","reason":"Reports a specific problem encountered during certificate operations, usually indicating a failure condition.","resolution":"Check the specific problem details. May require fixing domain validation issues, permissions, or addressing ACME server errors."},{"function":"md_job_start_run","message_template":"starting","reason":"Indicates a certificate management job has begun execution.","resolution":"Information log, no resolution required."},{"function":"md_job_end_run","message_template":"finished","reason":"Indicates a certificate management job has successfully completed.","resolution":"Information log, no resolution required."},{"function":"md_job_notify","message_template":"renewed","reason":"Notification that a certificate has been successfully renewed.","resolution":"Information log, no resolution required. Certificates have been updated successfully."},{"function":"job_result_update","message_template":"progress","reason":"General progress update during certificate operations.","resolution":"Information log, no resolution required."},{"function":"status_get_cert_json","message_template":"%d","reason":"Formatted value used in certificate status output, likely a numeric identifier or status code.","resolution":"Context-dependent. If associated with an error, check specific certificate details."},{"function":"status_get_cert_json_ex","message_template":"","reason":"An empty string that might be used as placeholder or default value in certificate JSON data.","resolution":"No action needed, this is a placeholder value."},{"function":"job_result_update","message_template":"%s","reason":"Single string format used to display activity messages.","resolution":"Information log, context depends on the specific activity being performed."},{"function":"job_result_update","message_template":"%s: %s","reason":"Format for activity messages with additional details.","resolution":"Information log, may contain important context about ongoing operations."},{"function":"job_result_update","message_template":", ","reason":"Separator used when combining multiple message components.","resolution":"Not an actual log message, used for formatting only."},{"function":"job_result_update","message_template":" ","reason":"Space separator used when combining message components.","resolution":"Not an actual log message, used for formatting only."}],"project":"apache\/httpd"}