{"module":"mod_md_md_store.h","summary":"This module defines an interface for a storage system used by mod_md to manage domain-related data including certificates, keys, and ACME configuration. It provides functions for loading, saving, removing, and iterating over data organized by group, domain, and aspect.","logs":[{"function":"md_store_load_json","message_template":"Failed to load JSON data from group\/name\/aspect","reason":"Occurs when trying to load JSON data that doesn't exist or is corrupted. Likely due to missing files or permission issues.","resolution":"Check file permissions and ensure the requested data exists. Verify the storage path is correctly configured and accessible."},{"function":"md_store_save_json","message_template":"Failed to save JSON data to group\/name\/aspect","reason":"Occurs when trying to save JSON data but encountering disk issues, permission problems, or when trying to create a duplicate when create flag is set.","resolution":"Check disk space and file permissions. If create flag is used, ensure the data doesn't already exist."},{"function":"md_store_load","message_template":"Failed to load data of type [vtype] from group\/name\/aspect","reason":"Occurs when attempting to load data of a specific type that either doesn't exist or is in an incompatible format.","resolution":"Verify the data exists and is of the expected type. Check for file corruption or permission issues."},{"function":"md_store_save","message_template":"Failed to save data of type [vtype] to group\/name\/aspect","reason":"Occurs when saving data encounters disk issues, permission problems, or when trying to create a duplicate with create flag set.","resolution":"Check disk space and permissions. If using create flag, ensure the data doesn't already exist."},{"function":"md_store_remove","message_template":"Failed to remove data at group\/name\/aspect","reason":"Occurs when trying to remove data that doesn't exist (if force is not set) or due to permission issues.","resolution":"If force flag is needed, ensure it's set. Check file permissions and existence of the data to be removed."},{"function":"md_store_purge","message_template":"Failed to purge data for group\/name","reason":"Occurs when trying to remove all data for a specific name in a group but encountering permission issues or other filesystem errors.","resolution":"Check permissions for all files in the group\/name directory. Ensure no files are locked by other processes."},{"function":"md_store_move","message_template":"Failed to move data from from\/name to to\/name","reason":"Occurs when moving data between groups encounters filesystem errors, permission issues, or problems with archiving existing data.","resolution":"Verify permissions for both source and destination. If archive flag is set, ensure archive location is writable."},{"function":"md_store_rename","message_template":"Failed to rename group\/name to group\/to","reason":"Occurs when renaming data within a group fails due to filesystem errors, permission issues, or destination already existing.","resolution":"Check permissions and ensure the destination name doesn't already exist. Verify no files are locked by other processes."},{"function":"md_store_lock_global","message_template":"Failed to acquire global lock after waiting [time]","reason":"Occurs when unable to acquire the global lock within the specified maximum wait time, possibly due to contention or a stale lock.","resolution":"Increase the maximum wait time or investigate if a process has crashed while holding the lock, potentially requiring manual lock cleanup."},{"function":"md_pkey_load","message_template":"Failed to load private key for group\/name with spec [spec]","reason":"Occurs when loading a private key fails due to file not existing, permission issues, or key corruption.","resolution":"Check file permissions and existence. Verify the key is in the expected format and not corrupted."},{"function":"md_pkey_save","message_template":"Failed to save private key for group\/name with spec [spec]","reason":"Occurs when saving a private key fails due to disk issues, permission problems, or trying to overwrite an existing key with create flag set.","resolution":"Check disk space and permissions. If using create flag, ensure the key doesn't already exist."},{"function":"md_pubcert_load","message_template":"Failed to load public certificate for group\/name with spec [spec]","reason":"Occurs when loading a public certificate fails due to file not existing, permission issues, or certificate corruption.","resolution":"Check file permissions and existence. Verify the certificate is in the expected format and not corrupted."},{"function":"md_pubcert_save","message_template":"Failed to save public certificate for group\/name with spec [spec]","reason":"Occurs when saving a public certificate fails due to disk issues, permission problems, or trying to overwrite an existing certificate with create flag set.","resolution":"Check disk space and permissions. If using create flag, ensure the certificate doesn't already exist."},{"function":"md_creds_load","message_template":"Failed to load credentials for group\/name with spec [spec]","reason":"Occurs when loading credentials (certificate and private key) fails due to missing files, permission issues, or data corruption.","resolution":"Check that both the certificate and private key files exist and have correct permissions. Verify the data is not corrupted."},{"function":"md_creds_save","message_template":"Failed to save credentials for group\/name","reason":"Occurs when saving credentials (certificate and private key) fails due to disk issues or permission problems.","resolution":"Check disk space and permissions for both certificate and private key files. Ensure parent directories are writable."}],"project":"apache\/httpd"}