{"module":"md_tailscale.c","summary":"This module implements an interface between Apache's mod_md certificate management and Tailscale's certificate API. It allows Apache to retrieve, store, and renew TLS certificates issued by Tailscale, ensuring seamless certificate management for domains served through Tailscale.","logs":[{"function":"ts_init","message_template":"error parsing CA URL `%s`","reason":"Logs an error when the CA URL provided for Tailscale cannot be parsed properly. Likely occurs when configuration has typos or invalid URL syntax.","resolution":"Check the CA URL configuration in your Apache setup. Ensure it's properly formatted and points to a valid Tailscale API endpoint."},{"function":"ts_init","message_template":"non `file` URLs not supported, CA URL is `%s`","reason":"Logs an error when the CA URL scheme is not 'file'. Currently only file scheme URLs are supported for Tailscale integration.","resolution":"Modify the CA URL to use the 'file' scheme, which is required for Tailscale integration. Example: 'file:\/\/\/var\/run\/tailscale\/tailscaled.sock'."},{"function":"ts_init","message_template":"non `localhost` URLs not supported, CA URL is `%s`","reason":"Logs an error when the CA URL hostname is not 'localhost'. Currently only localhost URLs are supported for Tailscale integration.","resolution":"Modify the CA URL to use 'localhost' as the hostname for Tailscale integration."},{"function":"ts_preload","message_template":"%s: preload start","reason":"Informational log indicating the start of the certificate preload process for the specified domain.","resolution":"Information log, no resolution required."},{"function":"ts_preload","message_template":"loading staged md.json","reason":"Error log when there's a failure loading the staged domain metadata JSON file, which contains certificate configuration.","resolution":"Check file permissions and integrity of the staging area. Ensure the Apache process has read access to the staging directory."},{"function":"ts_preload","message_template":"loading staged credentials","reason":"Error log when there's a failure loading staged credentials (certificates and keys) for the domain.","resolution":"Verify that the credential files exist in the staging area and have proper permissions. You may need to renew the certificate first."},{"function":"ts_preload","message_template":"no certificate in staged credentials","reason":"Error log when staged credentials are missing the certificate data. The credentials were found but are incomplete.","resolution":"Reset the staging area and attempt to renew the certificate. There might have been an error during the certificate acquisition process."},{"function":"ts_preload","message_template":"certificate and private key do not match in staged credentials","reason":"Error log when the certificate and private key in staged credentials don't match cryptographically.","resolution":"Reset the staging area and attempt to renew the certificate. This typically indicates a problem with how Tailscale generated the certificate or a mismatch between renewal attempts."},{"function":"ts_preload","message_template":"purging store tmp space","reason":"Informational log indicating the temporary storage area is being purged before saving new certificate data.","resolution":"Information log, no resolution required."},{"function":"ts_preload","message_template":"saving staged md\/privkey\/pubcert","reason":"Informational log indicating the staged metadata, private key, and public certificate are being saved.","resolution":"Information log, no resolution required."},{"function":"ts_preload","message_template":"writing md.json","reason":"Error log when there's a failure writing the domain metadata JSON file during the save operation.","resolution":"Check write permissions on the target directory and ensure sufficient disk space is available."},{"function":"ts_preload","message_template":"writing credentials #%d","reason":"Error log when there's a failure writing credential files (certificate or key) during the save operation.","resolution":"Check write permissions on the target directory and ensure sufficient disk space is available. The number indicates which credential in the sequence failed to write."},{"function":"ts_preload","message_template":"saved staged data successfully","reason":"Success log indicating all staged data was successfully saved to the target location.","resolution":"Information log, no resolution required."},{"function":"ts_renew","message_template":"%s: renewing cert","reason":"Informational log indicating the certificate renewal process has started for the specified domain.","resolution":"Information log, no resolution required."},{"function":"ts_renew","message_template":"Checking staging area","reason":"Informational log indicating the staging area is being checked for existing certificate data.","resolution":"Information log, no resolution required."},{"function":"ts_renew","message_template":"Resetting staging area","reason":"Informational log indicating the staging area is being reset to prepare for a new certificate.","resolution":"Information log, no resolution required."},{"function":"ts_renew","message_template":"%s: reset staging area","reason":"Debug log indicating the staging area for the specified domain has been reset.","resolution":"Information log, no resolution required."},{"function":"ts_renew","message_template":"resetting staging area","reason":"Error log when there's a failure resetting the staging area for certificate renewal.","resolution":"Check directory permissions and ensure the Apache process has write access to the staging directory."},{"function":"ts_renew","message_template":"Resetting staging for %s","reason":"Informational log indicating the staging area is being reset for the specified domain.","resolution":"Information log, no resolution required."},{"function":"ts_renew","message_template":"%s: setup staging","reason":"Debug log indicating the staging area is being set up for the specified domain.","resolution":"Information log, no resolution required."},{"function":"ts_renew","message_template":"Saving MD information in staging area.","reason":"Error log when there's a failure saving domain metadata information to the staging area.","resolution":"Check write permissions on the staging directory and ensure sufficient disk space is available."},{"function":"ts_renew","message_template":"only unix sockets are supported for tailscale connections","reason":"Error log when attempting to use a non-Unix socket connection type with Tailscale. This integration only supports Unix socket connections.","resolution":"Configure the Tailscale integration to use a Unix socket path. Other connection types are not supported."},{"function":"ts_renew","message_template":"tailscale socket not available, may not be up: %s","reason":"Error log when the Tailscale Unix socket is not available or accessible, likely because Tailscale is not running.","resolution":"Ensure Tailscale is running on the server. Check that the Unix socket path is correct and accessible by the Apache process. Verify Tailscale status with 'tailscale status'."},{"function":"ts_renew","message_template":"creating http context","reason":"Error log when there's a failure creating an HTTP context for communication with the Tailscale API.","resolution":"Check system resources and Apache configuration. This is typically a low-level error that may indicate memory issues or API incompatibility."},{"function":"ts_renew","message_template":"no domain names available","reason":"Error log when the MD configuration doesn't contain any domain names to request certificates for.","resolution":"Update your Apache configuration to include at least one domain name in the MDomain directive for this managed domain."},{"function":"ts_renew","message_template":"retrieving certificate from tailscale","reason":"Error log when there's a failure retrieving the certificate from Tailscale's API.","resolution":"Verify Tailscale is running and the domain is properly configured in Tailscale. Check Tailscale logs for errors related to certificate issuance."},{"function":"ts_renew","message_template":"tailscale returned no certificates","reason":"Error log when the Tailscale API request succeeds but no certificates are returned.","resolution":"Verify the domain is correctly configured in Tailscale. The domain may not be eligible for certificates or Tailscale might not have generated them yet."},{"function":"ts_renew","message_template":"tailscale has not renewed the certificate yet","reason":"Informational log indicating that Tailscale has not issued a new certificate since the last check.","resolution":"Normal condition during polling. Tailscale manages its own certificate renewal schedule. The system will check again after the delay period."},{"function":"ts_renew","message_template":"retrieving key from tailscale","reason":"Error log when there's a failure retrieving the private key from Tailscale's API.","resolution":"Verify Tailscale is running properly and the domain is correctly configured. Check Tailscale logs for errors related to key generation."},{"function":"ts_renew","message_template":"saving private key","reason":"Error log when there's a failure saving the private key retrieved from Tailscale to the staging area.","resolution":"Check write permissions on the staging directory and ensure sufficient disk space is available."},{"function":"ts_renew","message_template":"saving new certificate chain.","reason":"Error log when there's a failure saving the certificate chain retrieved from Tailscale to the staging area.","resolution":"Check write permissions on the staging directory and ensure sufficient disk space is available."},{"function":"ts_renew","message_template":"A new tailscale certificate has been retrieved successfully and can be used. A graceful server restart is recommended.","reason":"Success log indicating a new certificate was successfully retrieved from Tailscale and is ready to use.","resolution":"Perform a graceful restart of the Apache server to start using the new certificate. This can typically be done with 'apachectl graceful' or 'systemctl reload apache2'."}],"project":"apache\/httpd"}