{"module":"md_util.c","summary":"A utility module for Apache's mod_md that provides functions for data handling, string operations, file system interaction, DNS validation, URI parsing, and process execution. It contains helper functionality used throughout the Managed Domains module.","logs":[{"function":"match_and_do","message_template":"path=%s depth=%d pattern=%s","reason":"Logs trace information about file pattern matching with the current path, depth level, and pattern being processed.","resolution":"Informational log for debugging, no resolution required."},{"function":"match_and_do","message_template":"candidate=%s","reason":"Logs a potential filename candidate during pattern matching.","resolution":"Informational log for debugging, no resolution required."},{"function":"match_and_do","message_template":"candidate=%s matches pattern","reason":"Logs when a filename candidate successfully matches the specified pattern.","resolution":"Informational log for debugging, no resolution required."},{"function":"match_and_do","message_template":"need to go deeper","reason":"Logs when directory traversal needs to go deeper during pattern matching.","resolution":"Informational log for debugging, no resolution required."},{"function":"match_and_do","message_template":"invoking inspector on name=%s","reason":"Logs when the inspector callback function is being called on a matched file.","resolution":"Informational log for debugging, no resolution required."},{"function":"tree_do","message_template":"dir cb(%s\/%s)","reason":"Logs when a directory callback is being executed during directory tree traversal.","resolution":"Informational log for debugging, no resolution required."},{"function":"tree_do","message_template":"file cb(%s\/%s)","reason":"Logs when a file callback is being executed during directory tree traversal.","resolution":"Informational log for debugging, no resolution required."},{"function":"md_dns_is_name","message_template":"dns name with ..: %s","reason":"Logs when a DNS name contains consecutive dots, which is invalid.","resolution":"Fix the provided DNS name to remove consecutive dots. This may occur in domain configuration or certificate requests and could indicate a misconfiguration."},{"function":"md_dns_is_name","message_template":"dns invalid char %c: %s","reason":"Logs when a DNS name contains an invalid character.","resolution":"Fix the provided DNS name to use only valid characters (letters, numbers, hyphens, dots). This may occur in domain configuration or certificate requests."},{"function":"md_dns_is_name","message_template":"not a FQDN: %s","reason":"Logs when a domain name is not a fully qualified domain name (lacks sufficient dots).","resolution":"Use a fully qualified domain name with at least one dot. This typically occurs when trying to use a TLD or incomplete domain name in configurations."},{"function":"md_util_exec","message_template":"cmd(%s) stderr: %s","reason":"Logs the stderr output from an executed command for diagnostic purposes.","resolution":"Review the stderr output for any error messages from the executed command. This could indicate issues with external tools used by mod_md."},{"function":"uri_check","message_template":"not an uri","reason":"Logs when a string fails URI parsing and is not a valid URI.","resolution":"Provide a valid URI format. This may occur in configuration settings or when processing API endpoints."},{"function":"uri_check","message_template":"missing uri identifier","reason":"Logs when a URI is missing necessary identifying parts after the scheme.","resolution":"Ensure the URI contains all required components after the scheme (e.g., 'http:\/\/' followed by hostname)."},{"function":"uri_check","message_template":"missing hostname","reason":"Logs when an HTTP URI is missing the required hostname component.","resolution":"Provide a hostname in the HTTP URI (e.g., 'http:\/\/example.com' instead of just 'http:\/\/')."},{"function":"uri_check","message_template":"invalid hostname","reason":"Logs when an HTTP URI contains an invalid hostname that doesn't conform to DNS naming rules.","resolution":"Ensure the hostname in the URI follows DNS naming standards. Check for invalid characters or formats."},{"function":"uri_check","message_template":"invalid port","reason":"Logs when an HTTP URI contains an invalid port number (not a number or out of range).","resolution":"Use a valid port number between 1 and 65353. This might occur in custom endpoint configurations."},{"function":"uri_check","message_template":"missing @","reason":"Logs when a mailto URI is missing the required @ symbol.","resolution":"Ensure mailto URIs contain an @ symbol (e.g., 'mailto:user@example.com')."},{"function":"uri_check","message_template":"duplicate @","reason":"Logs when a mailto URI contains more than one @ symbol.","resolution":"Fix the mailto URI to contain exactly one @ symbol."},{"function":"uri_check","message_template":"missing local part","reason":"Logs when a mailto URI is missing the local part before the @ symbol.","resolution":"Include a username\/local part before the @ in mailto URIs (e.g., 'mailto:user@example.com')."},{"function":"uri_check","message_template":"missing hostname","reason":"Logs when a mailto URI is missing the domain name after the @ symbol.","resolution":"Include a domain after the @ in mailto URIs (e.g., 'mailto:user@example.com')."},{"function":"uri_check","message_template":"double period","reason":"Logs when a mailto URI contains double periods, which is invalid.","resolution":"Remove consecutive periods from the mailto URI."},{"function":"uri_check","message_template":"whitespace in uri","reason":"Logs when a URI contains whitespace characters, which are not allowed.","resolution":"Remove all spaces, tabs, and other whitespace from URIs."},{"function":"md_util_abs_uri_check","message_template":"missing uri scheme","reason":"Logs when a URI is missing its scheme (e.g., 'http:\/\/', 'https:\/\/', etc.).","resolution":"Add the appropriate scheme prefix to the URI."},{"function":"md_util_abs_http_uri_check","message_template":"uri scheme must be http or https","reason":"Logs when an HTTP URI validation requires http or https scheme but another scheme was provided.","resolution":"Use only http:\/\/ or https:\/\/ schemes for HTTP URIs."}],"project":"apache\/httpd"}