{"module":"mod_md_ocsp.c","summary":"This module handles OCSP (Online Certificate Status Protocol) stapling in Apache HTTPD, providing certificate revocation status during TLS handshakes. It maintains a watchdog process that periodically refreshes OCSP responses and handles housekeeping tasks like removing old responses.","logs":[{"function":"md_ocsp_prime_status","message_template":"init stapling for: %s, unable to parse PEM data","reason":"Logs an error when the system fails to parse the certificate data in PEM format. This likely happens when certificate files are corrupt or in an unexpected format.","resolution":"Verify that certificate files are valid PEM format and not corrupted. Try re-exporting the certificates from their source."},{"function":"md_ocsp_prime_status","message_template":"init stapling for: %s, need at least 2 certificates in PEM data","reason":"Logs an error when the certificate chain is incomplete. OCSP stapling requires both a server certificate and at least one issuer certificate.","resolution":"Ensure the certificate chain includes both the server certificate and at least one issuer certificate. Check that the certificate files contain the complete chain."},{"function":"md_ocsp_prime_status","message_template":"init stapling for: %s","reason":"Logs a trace message when OCSP stapling initialization begins for a domain. This is informational.","resolution":"No resolution required, this is an informational message indicating normal operation."},{"function":"md_ocsp_provide_status","message_template":"get stapling for: %s","reason":"Logs a trace message when the server tries to retrieve OCSP status for a certificate during a TLS connection.","resolution":"No resolution required, this is an informational message indicating normal operation."},{"function":"run_watchdog","message_template":"md ocsp watchdog start, ocsp stapling %d certificates","reason":"Logs a debug message when the OCSP watchdog process starts, indicating how many certificates it will monitor.","resolution":"No resolution required, this is an informational message. If the number of certificates seems incorrect, verify your server configuration."},{"function":"run_watchdog","message_template":"md ocsp watchdog run, ocsp stapling %d certificates","reason":"Logs a debug message each time the watchdog runs to renew OCSP responses, showing the count of monitored certificates.","resolution":"No resolution required, this is an informational message. If the count is unexpected, check your server certificate configuration."},{"function":"run_watchdog","message_template":"md ocsp watchdog next run in %s","reason":"Logs a debug message indicating when the OCSP watchdog will run next, helping to track the refresh schedule.","resolution":"No resolution required, this is an informational message. If the timing seems off, check the server's time synchronization."},{"function":"run_watchdog","message_template":"md ocsp watchdog stopping","reason":"Logs a debug message when the OCSP watchdog process is shutting down, typically during server shutdown.","resolution":"No resolution required, this is an informational message indicating normal server shutdown."},{"function":"md_ocsp_start_watching","message_template":"mod_watchdog is required for OCSP stapling","reason":"Logs a critical error when the mod_watchdog module is not available, which is required for OCSP stapling to function.","resolution":"Ensure mod_watchdog is loaded in the Apache configuration. Add 'LoadModule watchdog_module modules\/mod_watchdog.so' to your Apache configuration if missing."},{"function":"md_ocsp_start_watching","message_template":"md_ocsp_watchdog: create pool","reason":"Logs an error if creating a memory pool for the OCSP watchdog fails, indicating a resource issue.","resolution":"Check server memory resources and Apache configuration. The server might be running out of memory or hitting resource limits."},{"function":"md_ocsp_start_watching","message_template":"create md ocsp watchdog(%s)","reason":"Logs an error or debug message (depending on status) when creating the OCSP watchdog instance, with the watchdog name as parameter.","resolution":"If an error is logged, check if mod_watchdog is properly configured. Ensure Apache has sufficient permissions to create watchdog processes."},{"function":"md_ocsp_start_watching","message_template":"register md ocsp watchdog(%s)","reason":"Logs a message when registering a callback with the OCSP watchdog, indicating whether registration succeeded or failed.","resolution":"If registration fails, check for resource constraints or configuration issues with mod_watchdog. Restart Apache to see if the issue persists."}],"project":"apache\/httpd"}