{"module":"mod_md_drive.c","summary":"This module is part of Apache's certificate management system (mod_md) responsible for automatic renewal of SSL\/TLS certificates through a watchdog mechanism. It periodically checks managed domains, processes renewal jobs, and handles certificate expiration warnings.","logs":[{"function":"process_drive_job","message_template":"md(%s): state=%d, driving","reason":"Logs the current state of a managed domain when a drive job begins processing. Provides visibility into the certificate management process.","resolution":"Informational log, no resolution required. The state ID can be used for tracking the domain's progress through the certificate renewal workflow."},{"function":"process_drive_job","message_template":"md(%s): has revoked certificates","reason":"Indicates that certificates for the managed domain have been revoked, which is a critical security issue requiring immediate attention.","resolution":"Investigate why certificates were revoked (potential compromise, CA policy violation) and ensure new certificates are obtained. Check OCSP status and address the underlying cause of revocation."},{"function":"process_drive_job","message_template":"md(%s): no need to renew","reason":"Indicates that certificate renewal is not currently needed for this domain, likely because the current certificate is still valid for a sufficient period.","resolution":"Informational log, no resolution required. Normal part of certificate lifecycle management."},{"function":"process_drive_job","message_template":"%s: event-handler for 'renewing' returned %d, preventing renewal to proceed.","reason":"The configured event handler vetoed the certificate renewal process, which might be expected in cluster installations to prevent multiple nodes from attempting renewal simultaneously.","resolution":"Check if this is expected behavior for your cluster configuration. If renewal is needed but being blocked, review the event handler configuration and verify cluster coordination settings."},{"function":"process_drive_job","message_template":"processing %s: %s","reason":"Reports an error encountered during the certificate renewal process for a specific domain, providing details about what went wrong.","resolution":"Investigate the specific error message. Common issues include network connectivity to the CA, domain validation problems, or configuration errors. Check error logs for additional context."},{"function":"process_drive_job","message_template":"renewal-error","reason":"Logs a renewal error to the job log. This is used for internal tracking of errors during the renewal process.","resolution":"Check the associated problem and detail fields for specific error information. Address the underlying issue preventing certificate renewal."},{"function":"process_drive_job","message_template":"%s: encountered error for the %d. time, next run in %s","reason":"Indicates repeated failures in the certificate renewal process, showing how many times it has failed and when it will retry.","resolution":"If errors persist, investigate the specific error messages in logs. Check connectivity to the CA, domain ownership validation, and certificate configuration. Persistent errors may require manual intervention."},{"function":"process_drive_job","message_template":"md(%s): warn about expiration","reason":"The system is generating a warning that certificates for this domain are approaching expiration date.","resolution":"Check why automatic renewal isn't working if this is an auto-renewed domain. May require manual certificate renewal if the expiration date is near. Verify CA connection and domain validation settings."},{"function":"process_drive_job","message_template":"%s: saving job props","reason":"Logs that job properties are being saved to persistent storage, which happens when job state changes.","resolution":"Informational log, no resolution required. If there's an error code associated with this message, check file system permissions or disk space issues."},{"function":"run_watchdog","message_template":"md watchdog start, auto drive %d mds","reason":"Logs that the watchdog process for managed domains is starting up, indicating how many domains it will manage.","resolution":"Informational log, no resolution required. Confirms the certificate management system is active."},{"function":"run_watchdog","message_template":"md watchdog run, auto drive %d mds","reason":"Indicates that the watchdog process is performing a scheduled check of managed domains.","resolution":"Informational log, no resolution required. Regular part of the certificate management lifecycle."},{"function":"run_watchdog","message_template":"next run in %s","reason":"Reports when the next certificate check will occur, helping administrators understand the renewal check schedule.","resolution":"Informational log, no resolution required. If checks are too frequent or infrequent, consider adjusting the check_interval configuration."},{"function":"run_watchdog","message_template":"md watchdog stopping","reason":"Indicates that the watchdog process for managed domains is shutting down, which typically happens during server shutdown.","resolution":"Informational log, no resolution required. Normal part of server shutdown sequence."},{"function":"md_renew_start_watching","message_template":"mod_watchdog is required","reason":"Critical error indicating that mod_watchdog module, which is required for certificate renewal functionality, is not available.","resolution":"Ensure mod_watchdog is loaded in your Apache configuration. Add 'LoadModule watchdog_module modules\/mod_watchdog.so' to your configuration and restart Apache."},{"function":"md_renew_start_watching","message_template":"md_renew_watchdog: create pool","reason":"Logs an error during creation of the memory pool needed for watchdog operations, which is critical for certificate renewal functions.","resolution":"Check server resources - this typically indicates memory allocation problems. Ensure Apache has sufficient memory available and isn't running out of system resources."},{"function":"md_renew_start_watching","message_template":"md(%s): state=%d, created drive job","reason":"Logs the creation of a certificate drive job for a managed domain, showing its initial state.","resolution":"Informational log, no resolution required. Part of normal certificate management startup."},{"function":"md_renew_start_watching","message_template":"md(%s): previous drive job showed %d errors, purging STAGING area to reset.","reason":"Indicates that previous certificate renewal attempts failed, and the system is cleaning up failed staging data to start fresh.","resolution":"Informational log about automatic recovery. If the same domain repeatedly shows this message across restarts, investigate the specific errors that are causing renewal failures."},{"function":"md_renew_start_watching","message_template":"no managed domain to drive, no watchdog needed.","reason":"Indicates that there are no managed domains configured for automatic renewal, so the watchdog process isn't needed.","resolution":"Informational log, no resolution required. If you expected domains to be automatically managed, verify your VirtualHost configurations to ensure domains are properly set up for management."},{"function":"md_renew_start_watching","message_template":"create md renew watchdog(%s)","reason":"Logs an error or success when creating the certificate renewal watchdog process, which is essential for automated certificate management.","resolution":"If an error is reported, check that mod_watchdog is properly loaded and functional. May indicate resource constraints or configuration issues with the watchdog subsystem."},{"function":"md_renew_start_watching","message_template":"register md renew watchdog(%s)","reason":"Logs success or failure when registering the certificate renewal callback with the watchdog system.","resolution":"If this reports an error, check Apache error logs for more details. May indicate issues with the watchdog module, memory constraints, or server configuration problems."}],"project":"apache\/httpd"}