{"module":"sed_module.c","summary":"This module provides Apache HTTP server with the ability to filter HTTP requests and responses using sed (stream editor) expressions. It allows for text transformation of content both coming into and going out of the server, with operations similar to the command-line sed utility.","logs":[{"function":"log_sed_errf","message_template":"%s","reason":"Logs errors reported by the libsed library during sed script execution. This is a callback function that receives error messages from libsed.","resolution":"Review the specific error message and correct the sed expression. The error is likely related to malformed sed scripts or runtime issues in processing content."},{"function":"sed_response_filter","message_template":"error evaluating sed on output","reason":"Logs an error when there is a failure evaluating sed expressions on the output\/response content. This could occur due to malformed content or issues with the sed script execution.","resolution":"Check the sed expressions configured for output filtering and ensure they're valid. Examine the response content being processed for any unusual patterns that might be causing the sed evaluation to fail."},{"function":"sed_request_filter","message_template":"error evaluating sed on input","reason":"Logs an error when there is a failure evaluating sed expressions on the input\/request content. This could occur due to malformed input or issues with the sed script execution.","resolution":"Check the sed expressions configured for input filtering and ensure they're valid. Examine the request content being processed for any unusual patterns that might be causing the sed evaluation to fail."},{"function":"sed_add_expr","message_template":"Failed to compile sed expression. %s","reason":"Returned as an error when a sed expression fails to compile. This happens during configuration processing, not during request\/response handling.","resolution":"Check the syntax of the sed expression specified in the OutputSed or InputSed directive. The error message will contain specific details about what part of the expression is invalid."}],"project":"apache\/httpd"}