{"module":"mod_brotli.c","summary":"An Apache module that implements Brotli compression for HTTP responses. It compresses outgoing content when clients indicate Brotli support via the Accept-Encoding header, leading to reduced bandwidth usage while maintaining content integrity.","logs":[{"function":"set_filter_note","message_template":"Unknown BrotliFilterNote type '%s'","reason":"Logs an error when an administrator configures the BrotliFilterNote directive with an unrecognized type parameter. Only 'Ratio', 'Input', and 'Output' are valid types.","resolution":"Check the BrotliFilterNote directive in the Apache configuration. Ensure that the first parameter is one of: 'Ratio', 'Input', or 'Output'."},{"function":"set_compression_quality","message_template":"BrotliCompressionQuality must be between 0 and 11","reason":"Logs an error when the BrotliCompressionQuality directive is configured with a value outside the allowed range. Higher quality values provide better compression but slower performance.","resolution":"Modify the BrotliCompressionQuality directive in the Apache configuration to use a value between 0 (fastest, worst compression) and 11 (slowest, best compression). The default value is 5."},{"function":"set_compression_lgwin","message_template":"BrotliCompressionWindow must be between 10 and 24","reason":"Logs an error when the BrotliCompressionWindow directive is configured with a window size outside the allowed range. Larger window sizes can improve compression but require more memory.","resolution":"Modify the BrotliCompressionWindow directive in the Apache configuration to use a value between 10 (smallest window) and 24 (largest window). The default value is 18."},{"function":"set_compression_lgblock","message_template":"BrotliCompressionMaxInputBlock must be between 16 and 24","reason":"Logs an error when the BrotliCompressionMaxInputBlock directive is configured with a block size outside the allowed range. Larger block sizes can improve compression but require more memory.","resolution":"Modify the BrotliCompressionMaxInputBlock directive in the Apache configuration to use a value between 16 (smallest blocks) and 24 (largest blocks). The default value is 0, which lets Brotli automatically select the optimal size."},{"function":"set_etag_mode","message_template":"BrotliAlterETag accepts only 'AddSuffix', 'NoChange' and 'Remove'","reason":"Logs an error when the BrotliAlterETag directive is configured with an invalid mode for handling ETags. This affects how caching works with compressed content.","resolution":"Modify the BrotliAlterETag directive in the Apache configuration to use one of the allowed values: 'AddSuffix' (default, adds -br to ETags), 'NoChange' (leaves ETags unchanged), or 'Remove' (removes ETags from compressed responses)."},{"function":"process_chunk","message_template":"Error while compressing data","reason":"Logs an error when the Brotli compression library fails during the data compression process. This could happen due to memory issues or problems with the input data.","resolution":"Check the server's memory resources and review other Apache logs for related errors. Consider reducing BrotliCompressionQuality, BrotliCompressionWindow, or BrotliCompressionMaxInputBlock values to reduce memory usage. If the issue persists, consider disabling Brotli compression for problematic content."},{"function":"flush","message_template":"Error while compressing data","reason":"Logs an error when the Brotli compression library fails during a flush operation. This typically happens when finalizing compression or preparing for a new chunk.","resolution":"Check the server's memory resources and review other Apache logs for related errors. Consider reducing BrotliCompressionQuality, BrotliCompressionWindow, or BrotliCompressionMaxInputBlock values to reduce memory usage. If the issue persists, consider disabling Brotli compression for problematic content."},{"function":"compress_filter","message_template":"token: '%s' - q: '%s'","reason":"Logs debug information about Accept-Encoding token parsing at TRACE1 level, showing the token (e.g., 'br') and quality value found in the client request.","resolution":"This is an informational debug message that doesn't indicate an error. It can be useful for debugging client Accept-Encoding header issues. To see these messages, increase Apache's LogLevel to trace1 for the brotli module."}],"project":"apache\/httpd"}