{"module":"mod_data.c","summary":"This Apache module (mod_data) transforms HTTP responses into RFC2397 data URLs by encoding the response body in base64. It allows embedding binary data directly in HTML documents as inline content, prepending the content with the appropriate data URL format.","logs":[{"function":"data_out_filter","message_template":"data:%s%s;base64,","reason":"Creates a data URL with the response's mime-type and optional charset before the base64-encoded payload. This is not an error but an informational format that structures the output.","resolution":"No resolution required as this is informational. If unexpected format appears in output, check that Content-Type headers are correctly set in the original response."},{"function":"data_out_filter","message_template":"Content-Length","reason":"The module adjusts or removes the Content-Length header based on the size increase from base64 encoding. If the header value is too large (exceeds APR_INT32_MAX), it is removed entirely.","resolution":"If content length issues occur, check that the original response isn't extremely large. Consider using chunked transfer encoding for very large responses instead of relying on Content-Length."},{"function":"data_out_filter","message_template":"text\/plain","reason":"Sets the Content-Type of the response to text\/plain, as data URLs are plaintext representations of the original content.","resolution":"This is expected behavior. If clients are not handling the response correctly, ensure they properly interpret data URLs with the text\/plain content type."},{"function":"register_hooks","message_template":"DATA","reason":"Registers an output filter named 'DATA' that converts responses to data URLs. This identifier appears in Apache configurations when enabling the filter.","resolution":"If the DATA filter is not working as expected, verify it's properly enabled in the Apache configuration and that it's applied to the correct content types."}],"project":"apache\/httpd"}