{"module":"mod_proxy_html.c","summary":"Apache module that filters HTML content in a proxy setup to rewrite URLs and transform HTML. It parses HTML using libxml2, applies URL mapping rules, fixes HTML according to doctype specifications, and supports character set transformations via mod_xml2enc.","logs":[{"function":"pstartElement","message_template":"Bogus HTML element %s dropped","reason":"The HTML element is not valid according to HTML specifications and is being ignored by the filter. This happens when enforcing strict HTML standards with certain doctypes.","resolution":"Update the HTML content to use valid HTML elements according to the specified doctype. If this is needed, consider changing ProxyHTMLDoctype to a more lenient setting."},{"function":"pstartElement","message_template":"Deprecated HTML element %s dropped","reason":"The HTML element is deprecated according to HTML specifications and is being removed by the filter. This occurs when enforcing strict HTML compliance.","resolution":"Update the HTML content to use modern HTML elements rather than deprecated ones. If these elements are required, consider using a legacy doctype setting."},{"function":"pstartElement","message_template":"Bogus HTML attribute %s of %s dropped","reason":"An invalid attribute was found on an HTML element and is being removed. This happens when enforcing strict HTML attribute validation.","resolution":"Update the HTML to use valid attributes for the specified elements. If these attributes are needed, consider using a less strict doctype configuration."},{"function":"pstartElement","message_template":"Deprecated HTML attribute %s of %s dropped","reason":"A deprecated attribute was found on an HTML element and is being removed. This occurs when enforcing HTML standards compliance.","resolution":"Replace deprecated attributes with their modern equivalents. If these attributes are required, consider using a legacy doctype setting."},{"function":"pstartElement","message_template":"HTML element %s is missing %d required attributes","reason":"An HTML element does not have all the required attributes according to the HTML specification. The element is kept but might not function as expected.","resolution":"Add the required attributes to the HTML element to ensure proper functionality. Review the HTML specification for the element in question to identify which attributes are required."},{"function":"pstartElement","message_template":"Adding header [%s: %s] from HTML META","reason":"A META http-equiv tag in the HTML is being converted to an HTTP header. This is an informational message showing header transformations.","resolution":"This is informational and requires no action unless the headers are causing issues. If problematic, consider disabling ProxyHTMLMeta."},{"function":"pstartElement","message_template":"Interpolating %s  =>  %s","reason":"A variable in a URL mapping pattern is being replaced with its value. This logs the variable substitution process when interpolation is enabled.","resolution":"This is informational and requires no action. If the substitutions are incorrect, check environment variables and URL mapping patterns."},{"function":"fixup_rules","message_template":"Error evaluating expr: %s","reason":"Failed to evaluate a conditional expression in a URL mapping rule. This can happen due to syntax errors or undefined variables in expressions.","resolution":"Check the syntax of the condition expressions in ProxyHTMLURLMap directives. Ensure all referenced variables exist and the expressions are correctly formed."},{"function":"check_filter_init","message_template":"Non-proxy request; not inserting proxy-html filter","reason":"The proxy-html filter is being skipped because the current request is not a proxy request. This is normal for direct requests to the server.","resolution":"If proxy-html processing is needed for non-proxy requests, set the PROXY_HTML_FORCE environment variable. Otherwise, this is normal behavior."},{"function":"check_filter_init","message_template":"No content-type; bailing out of proxy-html filter","reason":"The proxy-html filter is not being applied because the response doesn't have a Content-Type header. The filter needs this to determine if the content is HTML.","resolution":"Ensure the backend server is setting Content-Type headers properly. You can force the filter to run by setting the PROXY_HTML_FORCE environment variable."},{"function":"check_filter_init","message_template":"Non-HTML content; not inserting proxy-html filter","reason":"The proxy-html filter is being skipped because the Content-Type indicates non-HTML content. The filter only processes HTML and XHTML content.","resolution":"If the content is actually HTML but has an incorrect Content-Type, fix the Content-Type header. Or you can force the filter with the PROXY_HTML_FORCE environment variable."},{"function":"check_filter_init","message_template":"No links configured: nothing for proxy-html filter to do","reason":"The proxy-html filter is being skipped because no URL mappings have been configured with ProxyHTMLLinks. The filter has no transformations to apply.","resolution":"Configure URL mappings using ProxyHTMLLinks and ProxyHTMLURLMap directives if you want the proxy-html filter to transform content."},{"function":"proxy_html_filter","message_template":"Error in bucket read","reason":"Failed to read data from an input bucket in the filter chain. This indicates a problem with the HTTP request or response processing.","resolution":"This could indicate network problems, memory issues, or bugs in the Apache HTTP server. Check server logs for related errors and consider increasing your LogLevel temporarily."},{"function":"proxy_html_filter","message_template":"No i18n support found. Install mod_xml2enc if required","reason":"The module detected that mod_xml2enc is not available. This means character set conversions won't work properly, potentially causing issues with non-ASCII characters.","resolution":"Install and enable mod_xml2enc if you need to handle non-ASCII characters correctly. If your content is all ASCII, this warning can be ignored."},{"function":"proxy_html_filter","message_template":"Unsupported parser opts %x","reason":"Some XML parser options requested by the code are not supported by the installed libxml2 library. This may affect HTML parsing behavior.","resolution":"Update your libxml2 library to a newer version that supports these options. If that's not possible, be aware that some HTML parsing features may not work as expected."},{"function":"pcharacters","message_template":"C\/RX: match at %s, substituting %s","reason":"A regex pattern match was found in character data and is being substituted. This debug message shows URL replacements in text content.","resolution":"This is a debug message and requires no action unless the substitutions are incorrect. Check your ProxyHTMLURLMap directives if substitutions aren't working as expected."},{"function":"pcharacters","message_template":"C: matched %s, substituting %s","reason":"A string pattern match was found in character data and is being substituted. This debug message shows URL replacements in text content.","resolution":"This is a debug message and requires no action unless the substitutions are incorrect. Check your ProxyHTMLURLMap directives if substitutions aren't working as expected."},{"function":"pstartElement","message_template":"H\/RX: match at %s, substituting %s","reason":"A regex pattern match was found in an HTML attribute and is being substituted. This debug message shows URL replacements in attributes.","resolution":"This is a debug message and requires no action unless the substitutions are incorrect. Check your ProxyHTMLURLMap directives if attribute substitutions aren't working as expected."},{"function":"pstartElement","message_template":"H: matched %s, substituting %s","reason":"A string pattern match was found in an HTML attribute and is being substituted. This debug message shows URL replacements in attributes.","resolution":"This is a debug message and requires no action unless the substitutions are incorrect. Check your ProxyHTMLURLMap directives if attribute substitutions aren't working as expected."},{"function":"pstartElement","message_template":"E\/RX: match at %s, substituting %s","reason":"A regex pattern match was found in an event attribute (like onclick) and is being substituted. This debug message shows URL replacements in JavaScript events.","resolution":"This is a debug message and requires no action unless the event handler substitutions are incorrect. Check your ProxyHTMLURLMap directives with the 'e' flag."},{"function":"pstartElement","message_template":"E: matched %s, substituting %s","reason":"A string pattern match was found in an event attribute (like onclick) and is being substituted. This debug message shows URL replacements in JavaScript events.","resolution":"This is a debug message and requires no action unless the event handler substitutions are incorrect. Check your ProxyHTMLURLMap directives with the 'e' flag."},{"function":"mod_proxy_html","message_template":"I18n support in mod_proxy_html requires mod_xml2enc. Without it, non-ASCII characters in proxied pages are likely to display incorrectly.","reason":"The module is starting up without finding mod_xml2enc, which is needed for proper character set handling. Non-ASCII characters may not display correctly.","resolution":"Install and enable mod_xml2enc if you need to handle non-ASCII characters correctly. If your content is all ASCII, this warning can be ignored."}],"project":"apache\/httpd"}