{"module":"charset_lite_module.c","summary":"The charset_lite_module provides character set translation for HTTP requests and responses. It offers filters that can translate between different character encodings, supporting both single-byte and multi-byte character sets, and can be configured to selectively apply to specific MIME types.","logs":[{"function":"add_charset_options","message_template":"Invalid CharsetOptions option: %s","reason":"An unrecognized option was specified in the CharsetOptions directive.","resolution":"Check the configuration and ensure only valid options (ImplicitAdd, NoImplicitAdd, TranslateAllMimeTypes, NoTranslateAllMimeTypes) are specified."},{"function":"find_code_page","message_template":"uri: %s file: %s method: %d imt: %s flags: %s%s%s %s->%s","reason":"Debug log showing the current request details and translation configuration.","resolution":"Informational log, no resolution required."},{"function":"find_code_page","message_template":"incomplete configuration: src %s, dst %s","reason":"The charset translation configuration is incomplete, missing either source or destination charset.","resolution":"Ensure both CharsetSourceEnc and CharsetDefault directives are properly configured in your server configuration."},{"function":"apr_xlate_open","message_template":"can't open translation %s->%s","reason":"Failed to create a translation handle between the specified character sets.","resolution":"Verify that both character sets are supported by your system. Check that the APR library was compiled with charset support for the specified encodings."},{"function":"xlate_insert_filter","message_template":"xlate output filter not added implicitly because CharsetOptions included 'NoImplicitAdd'","reason":"The character set translation filter wasn't automatically added because NoImplicitAdd was specified.","resolution":"Informational log. If translation is desired, either remove NoImplicitAdd from CharsetOptions or explicitly add the filter."},{"function":"xlate_insert_filter","message_template":"xlate output filter not added implicitly because %s","reason":"The output translation filter wasn't automatically added for the given reason.","resolution":"If translation is required, check the reason and either fix the configuration issue or explicitly add the filter."},{"function":"xlate_insert_filter","message_template":"xlate input filter not added implicitly because %s","reason":"The input translation filter wasn't automatically added for the given reason.","resolution":"If translation is required, check the reason and either fix the configuration issue or explicitly add the filter."},{"function":"log_xlate_error","message_template":"xlate filter - a built-in restriction was encountered","reason":"The translation filter hit a built-in limitation, likely related to character size or buffer limitations.","resolution":"This usually occurs with extremely large multi-byte characters. Check your character encoding configuration and consider using a more compatible encoding."},{"function":"log_xlate_error","message_template":"xlate filter - an input character was invalid","reason":"The input data contained an invalid character according to the source character set.","resolution":"Check the source data for corruption or mismatched character encoding. Ensure the CharsetSourceEnc matches the actual encoding of your content."},{"function":"log_xlate_error","message_template":"xlate filter - bucket read routine failed","reason":"An error occurred while reading from an input bucket during translation.","resolution":"This likely indicates an issue with the connection or a problem in a filter earlier in the chain. Check server and network status."},{"function":"log_xlate_error","message_template":"xlate filter - incomplete char at end of input - %s","reason":"A multi-byte character was incomplete at the end of the input data.","resolution":"This could indicate truncated input data. Check if the client prematurely terminated the connection or if another filter modified the data inappropriately."},{"function":"log_xlate_error","message_template":"xlate filter - an error occurred in a lower filter","reason":"A filter downstream of the translation filter reported an error.","resolution":"Examine logs for errors from other filters. The problem originates elsewhere in the filter chain, not in the charset_lite module."},{"function":"log_xlate_error","message_template":"xlate filter - returning error","reason":"The translation filter encountered an unspecified error and is returning an error status.","resolution":"Check for other related error messages to determine the specific cause and appropriate resolution."},{"function":"chk_filter_chain","message_template":"%s %s - disabling translation %s%s%s; existing translation %s%s%s","reason":"A translation filter is being disabled because it conflicts with another translation already in the filter chain.","resolution":"Multiple incompatible charset translations were configured. Revise your configuration to ensure compatible translations or explicitly manage the filter chain."},{"function":"chk_filter_chain","message_template":"chk_filter_chain() - can't disable translation %s%s%s; existing translation %s%s%s","reason":"The system detected incompatible charset translations but can't automatically fix the issue.","resolution":"There's a conflict in the filter chain that the module can't resolve. Review your configuration and ensure translations are compatible across your main requests and subrequests."},{"function":"xlate_out_filter","message_template":"mime type is %s; no translation selected","reason":"No translation was performed because the MIME type doesn't match criteria for translation.","resolution":"Informational log. If translation is desired for this MIME type, use the 'TranslateAllMimeTypes' option in CharsetOptions or adjust your content type."},{"function":"xlate_out_filter","message_template":"xlate_out_filter() - charset_source: %s charset_default: %s","reason":"Debug information showing the character sets used for output translation.","resolution":"Informational log, no resolution required."},{"function":"xlate_in_filter","message_template":"xlate_in_filter() - charset_source: %s charset_default: %s","reason":"Debug information showing the character sets used for input translation.","resolution":"Informational log, no resolution required."},{"function":"xlate_in_filter","message_template":"Request body length may change, resulting in misprocessing by some modules or scripts","reason":"Warning that the Content-Length header may become invalid after character set translation.","resolution":"This is expected when translating between different-sized character encodings. If this causes issues with scripts or modules, consider using compatible single-byte encodings or modifying the application to handle varying content lengths."}],"project":"apache\/httpd"}