{"module":"reqtimeout_module.c","summary":"This module enforces timeout limits for reading HTTP requests to prevent Denial of Service attacks. It applies configurable timeouts to the TLS handshake, header reading, and body reading phases, with the ability to set initial timeouts, maximum timeouts, and minimum data rates for each phase.","logs":[{"function":"reqtimeout_filter","message_template":"Request %s read timeout","reason":"This message is logged when a client fails to send data at the required rate during the handshake, header reading, or body reading phase. The timeout value is determined by the module's configuration for each phase.","resolution":"Check if the client is experiencing network issues or if the timeout values need to be adjusted. For slow clients with legitimate reasons, consider increasing the timeout values or the minimum data rate in the module's configuration. Persistent timeouts from specific clients might indicate a DoS attempt."},{"function":"parse_int","message_template":"Value '%s' not numerical","reason":"This error occurs during configuration parsing when a non-numerical value is provided for a timeout or rate parameter.","resolution":"Review the RequestReadTimeout directive in your Apache configuration and ensure all timeout and rate values are valid numbers."},{"function":"parse_int","message_template":"Cannot parse '%s'","reason":"This error occurs during configuration parsing when a value contains non-numerical characters after the number.","resolution":"Check the RequestReadTimeout directive and ensure that all parameters contain only numerical values without any additional characters."},{"function":"parse_int","message_template":"Value must be non-negative","reason":"This error occurs when a negative value is provided for a timeout or rate parameter.","resolution":"Ensure all timeout and rate values in the RequestReadTimeout directive are non-negative numbers."},{"function":"set_reqtimeout_param","message_template":"Unknown RequestReadTimeout parameter","reason":"This error occurs when an unknown parameter type is specified in the RequestReadTimeout directive.","resolution":"Check the RequestReadTimeout directive and ensure only valid parameter types (handshake, header, body) are used."},{"function":"set_reqtimeout_param","message_template":"Minimum data rate must be larger than 0","reason":"This error occurs when the minrate parameter is set to 0, which would effectively disable the timeout functionality.","resolution":"Configure the minrate parameter in the RequestReadTimeout directive with a value greater than 0."},{"function":"set_reqtimeout_param","message_template":"Must set MinRate option if using timeout range","reason":"This error occurs when a timeout range (using the dash notation) is specified without setting a minimum data rate.","resolution":"When using a timeout range in the RequestReadTimeout directive, you must also specify a minrate parameter."},{"function":"set_reqtimeout_param","message_template":"Maximum timeout must be larger than initial timeout","reason":"This error occurs when the maximum timeout in a range is not greater than the initial timeout.","resolution":"In the RequestReadTimeout directive, make sure the maximum timeout value (after the dash) is larger than the initial timeout value."},{"function":"set_reqtimeouts","message_template":"Invalid RequestReadTimeout parameter. Parameter must be in the form 'key=value'","reason":"This error occurs when a parameter in the RequestReadTimeout directive does not follow the key=value format.","resolution":"Check the RequestReadTimeout directive and ensure all parameters are in the format 'key=value', such as 'header=10' or 'body=30,minrate=500'."},{"function":"set_reqtimeouts","message_template":"RequestReadTimeout: %s=%s: %s","reason":"This error occurs when there's a problem with a specific parameter in the RequestReadTimeout directive. The specific issue is provided in the third parameter of the message.","resolution":"Review the RequestReadTimeout directive and address the specific issue mentioned in the error message for the indicated parameter."}],"project":"apache\/httpd"}