{"module":"mod_ext_filter.c","summary":"This module provides external filtering capabilities for Apache HTTP Server, allowing HTTP content to be processed by external programs before being delivered to the client. It registers input and output filters and handles the spawning and management of child processes for content processing.","logs":[{"function":"add_options","message_template":"Invalid ExtFilterOptions option: %s","reason":"An invalid option was specified for the ExtFilterOptions directive. The module only accepts LogStderr, NoLogStderr, Onfail=remove, and Onfail=abort options.","resolution":"Check the ExtFilterOptions directive in your configuration and ensure it only uses valid options."},{"function":"parse_cmd","message_template":"Expected cmd= delimiter","reason":"The filter command was not properly delimited with quotes. This happens when parsing filter commands with embedded spaces or special characters.","resolution":"Ensure that filter commands containing spaces are properly quoted in the ExtFilterDefine directive."},{"function":"parse_cmd","message_template":"cmd= parse error","reason":"The system failed to parse the command string provided for the external filter. This can happen due to malformed command arguments.","resolution":"Check the syntax of the cmd= parameter in your ExtFilterDefine directive and ensure it follows the proper format."},{"function":"parse_cmd","message_template":"Invalid cmd= parameter","reason":"The command parameter specified for the filter is invalid or empty. This occurs when no actual command is provided.","resolution":"Ensure the cmd= parameter in your ExtFilterDefine directive contains a valid program path or command."},{"function":"define_filter","message_template":"Filter name not found","reason":"No filter name was provided in the ExtFilterDefine directive. A filter name is required to identify and register the filter.","resolution":"Provide a filter name as the first parameter to the ExtFilterDefine directive."},{"function":"define_filter","message_template":"ExtFilter %s is already defined","reason":"An attempt was made to define a filter with a name that already exists. Filter names must be unique within a server configuration.","resolution":"Choose a different name for your filter or remove the duplicate ExtFilterDefine directive."},{"function":"define_filter","message_template":"mangled argument `%s'","reason":"The configuration contains a malformed preservescontentlength parameter. This occurs when the parameter is misspelled or incorrectly formatted.","resolution":"Check your ExtFilterDefine directive and ensure the preservescontentlength parameter is correctly spelled and formatted."},{"function":"define_filter","message_template":"Invalid mode: `%s'","reason":"An invalid mode was specified for the filter. Valid modes are 'input' and 'output'.","resolution":"Change the mode= parameter in your ExtFilterDefine directive to either 'input' or 'output'."},{"function":"define_filter","message_template":"Unexpected parameter: `%s'","reason":"An unrecognized parameter was encountered in the ExtFilterDefine directive. The module doesn't understand the provided configuration option.","resolution":"Remove or correct the unrecognized parameter in your ExtFilterDefine directive, checking the documentation for valid parameters."},{"function":"init_filter_instance","message_template":"couldn't find definition of filter '%s'","reason":"The filter that was referenced in a FilterProvider directive doesn't exist. This occurs when a filter is used before being defined.","resolution":"Ensure you have a ExtFilterDefine directive for this filter name before using it in a FilterProvider directive."},{"function":"init_ext_filter_process","message_template":"couldn't create child process to run `%s'","reason":"The system failed to create a child process to run the external filter command. This can happen due to resource limitations or permission problems.","resolution":"Verify the filter command exists and is executable by the web server user. Check system resources like process limits and available memory."},{"function":"drain_available_output","message_template":"apr_file_read(child output), len %","reason":"Debug log message showing the result of reading output from the child filter process. This is not an error but informational for troubleshooting.","resolution":"No resolution needed as this is an informational log. If you see it frequently, you can adjust log levels to reduce verbosity."},{"function":"pass_data_to_filter","message_template":"apr_file_write(child input), len %","reason":"Failed to write input data to the child filter process. This can happen if the child process has stopped or if there's a pipe buffer issue.","resolution":"Check if the external filter program is operating correctly and not crashing. You may need to increase system pipe buffer sizes for large data transfers."},{"function":"pass_data_to_filter","message_template":"apr_pollset_poll()","reason":"Warning about a polling operation failure. This occurs when there's an issue waiting for I\/O readiness on the pipes to the filter process.","resolution":"This may indicate a timeout or interrupt. If it happens frequently, consider increasing timeout values or checking for system interrupts."},{"function":"pass_data_to_filter","message_template":"apr_sleep()","reason":"Debug log message indicating the filter is sleeping before retrying an I\/O operation. This happens when pipes are temporarily not ready for I\/O.","resolution":"Information log, no resolution required. Frequent occurrences might indicate performance issues with the filter program."},{"function":"check_filter_process_on_eos","message_template":"apr_proc_wait() failed, uri=%s","reason":"Failed to get the exit status of the filter process. This can happen if the process was terminated abnormally or if system resources are constrained.","resolution":"Check if the filter program is being terminated by external means. May require monitoring system resource usage during request processing."},{"function":"check_filter_process_on_eos","message_template":"child process %s killed by signal %d, uri=%s","reason":"The external filter process was terminated by a signal rather than exiting normally. This often indicates a crash or forced termination of the filter program.","resolution":"Debug the external filter program to determine why it's receiving signals. Common causes include segmentation faults, out of memory conditions, or administrator intervention."},{"function":"check_filter_process_on_eos","message_template":"child process %s exited with non-zero status %d, uri=%s","reason":"The external filter process exited with an error status code. This indicates the filter program encountered an error during processing.","resolution":"Check the filter program's documentation for the meaning of specific exit codes. You may need to run the filter manually with similar inputs to debug the issue."},{"function":"ef_unified_filter","message_template":"apr_bucket_read()","reason":"Failed to read data from a bucket in the input brigade. This can happen due to network errors or client disconnection.","resolution":"This may be due to a client disconnecting during the request. If it happens frequently with specific content, check for content corruption or size issues."},{"function":"ef_unified_filter","message_template":"apr_file_close(child input)","reason":"Failed to close the input pipe to the child filter process. This is a system resource issue rather than a filter problem.","resolution":"Check system file descriptor limits and monitor for resource leaks if this occurs frequently."},{"function":"ef_unified_filter","message_template":"apr_file_pipe_timeout_set(child output)","reason":"Failed to set a timeout on the output pipe from the child process. This affects how long the server will wait for filter output.","resolution":"This is likely a system resource or permission issue. Check Apache's user permissions and system configuration for pipe operations."},{"function":"ef_unified_filter","message_template":"apr_file_read(child output), len %","reason":"Error or debug log when reading output from the child filter process. The verbosity level depends on whether an error occurred.","resolution":"If this is an error (not EAGAIN or EOF), check if the filter program is still running and producing output correctly."},{"function":"ef_output_filter","message_template":"can't initialise output filter %s: %s","reason":"Failed to initialize the output filter. The second parameter indicates the action taken (removing or aborting) based on configuration.","resolution":"Check previous log messages for the specific initialization failure. Depending on the onfail setting, the server will either remove the filter or abort the request."},{"function":"ef_output_filter","message_template":"ef_unified_filter() failed","reason":"The unified filter operation failed during output filtering. This is a general error that indicates a problem during filter execution.","resolution":"Check previous log entries for more specific errors about what part of the filtering process failed."},{"function":"ef_output_filter","message_template":"ap_pass_brigade() failed","reason":"Failed to pass the filtered data to the next filter in the chain. This can happen due to network errors or issues with the next filter.","resolution":"This might indicate a problem with another filter in the chain or with network connectivity to the client. Check the full error log for related messages."},{"function":"ef_input_filter","message_template":"can't initialise input filter %s: %s","reason":"Failed to initialize the input filter. The second parameter indicates the action taken (removing or aborting) based on configuration.","resolution":"Check previous log messages for the specific initialization failure. Depending on the onfail setting, the server will either remove the filter or abort the request."},{"function":"ef_input_filter","message_template":"ef_unified_filter() failed","reason":"The unified filter operation failed during input filtering. This indicates a problem during the execution of the input filter.","resolution":"Check previous log entries for more specific errors about what part of the filtering process failed."},{"function":"child_errfn","message_template":"[%s] [client %s] mod_ext_filter (%d)%pm: %s","reason":"Error message from the child process error function. This is a formatted log entry that captures errors from the filter child process.","resolution":"The specific resolution depends on the error message content. This log format includes timestamp, client IP, error code, and description to help diagnose the issue."},{"function":"init_filter_instance","message_template":"%sfiltering `%s' of type `%s' through `%s', cfg %s","reason":"Informational trace log showing filter activity. This logs whether filtering is happening, which URI is being filtered, what content type, and which command is doing the filtering.","resolution":"Information log, no resolution required. Useful for debugging filter behavior and configuration."}],"project":"apache\/httpd"}