{"module":"mod_ratelimit.c","summary":"Apache HTTP server module that controls the speed at which content is served to clients by throttling data transfer rates. It implements a filter that can be configured with specific rate limits and optional initial burst sizes via environment variables.","logs":[{"function":"brigade_dump","message_template":"brigade: [%d] %s","reason":"Debug message showing the index and type of a bucket in a brigade. Only enabled when RLFDEBUG is defined.","resolution":"This is a debug message for developers troubleshooting the module. No resolution required unless investigating specific bucket handling issues."},{"function":"rate_limit_filter","message_template":"rl: disabling: rate-limit = %s (too high?)","reason":"The rate-limit environment variable contains an invalid (non-positive) value, causing the rate limiting filter to be disabled. Likely due to misconfiguration or typo in the rate-limit value.","resolution":"Check the 'rate-limit' environment variable setting in your Apache configuration. Ensure it contains a positive integer representing the desired rate limit in kilobytes per second."},{"function":"rate_limit_filter","message_template":"rl: disabling burst: rate-initial-burst = %s (too high?)","reason":"The rate-initial-burst environment variable contains an invalid (non-positive) value, causing the burst feature to be disabled. The rate limiting will still function, but without an initial burst allowance.","resolution":"Check the 'rate-initial-burst' environment variable in your Apache configuration. Ensure it contains a positive integer representing the desired initial burst size in kilobytes."},{"function":"rate_limit_filter","message_template":"rl: burst %d; len %","reason":"Debug message showing the current burst amount remaining and the length of data being processed. Used for tracking burst consumption during rate limiting.","resolution":"This is an informational debug message. No resolution required unless you're investigating burst behavior issues."},{"function":"rate_limit_filter","message_template":"rl: full speed brigade pass failed.","reason":"Failed to pass a brigade in full-speed mode (when processing content between RL_START and RL_END markers). Likely due to a network issue or client disconnection.","resolution":"Check client connection stability and network conditions. If this occurs frequently, consider increasing server timeout settings or investigating the specific content being served."},{"function":"rate_limit_filter","message_template":"rl: partition failed.","reason":"The attempt to partition a bucket brigade failed with an error other than APR_INCOMPLETE. This is a serious error in the internal data handling of the rate limiting module.","resolution":"Check server resources (memory) and review any recent changes to the rate limiting configuration. This could indicate a bug in the module if it occurs consistently."},{"function":"rate_limit_filter","message_template":"rl: brigade pass failed.","reason":"Failed to pass a rate-limited brigade to the next filter. Most commonly occurs when a user disconnects from a stream while rate limiting is in effect.","resolution":"Usually not a server problem, but rather a client-side disconnection. No specific resolution required unless it happens consistently with specific content, which might indicate content-specific issues."}],"project":"apache\/httpd"}