{"module":"regexp.c","summary":"This module implements a regular expression compiler and matcher for the sed editor, providing functions to parse and execute regular expressions with comprehensive error handling for malformed patterns.","logs":[{"function":"regerr","message_template":"Range endpoint too large: %s","reason":"Logs an error when a range endpoint in a regular expression exceeds the maximum allowed value (255). Likely to occur when a user specifies a large number in a range like \\{300\\}.","resolution":"Modify the regular expression to use a smaller range value (below 255)."},{"function":"regerr","message_template":"Bad number: %s","reason":"Logs an error when a non-numeric character is found where a number is expected in a regex quantifier. Occurs when using constructs like \\{a,b\\} instead of \\{1,2\\}.","resolution":"Check and correct the numeric values in quantifiers like \\{n,m\\} to ensure they contain only digits."},{"function":"regerr","message_template":"``\\digit'' out of range: %s","reason":"Logs an error when a backreference (\\1, \\2, etc.) refers to a capture group that doesn't exist. Happens when using \\n where n is greater than the number of defined groups.","resolution":"Ensure backreferences only refer to previously defined capture groups in the regular expression."},{"function":"regerr","message_template":"Illegal or missing delimiter: %s","reason":"Logs an error when the delimiter for a regular expression is invalid or missing. Typically occurs when the closing delimiter is omitted or newlines are used incorrectly.","resolution":"Check that the regular expression has matching delimiters and doesn't contain unescaped newlines."},{"function":"regerr","message_template":"No remembered search string: %s","reason":"Logs an error when trying to reference a previous search pattern that doesn't exist. Occurs when using constructs that depend on previous patterns.","resolution":"Ensure a search pattern has been defined before attempting to reference it."},{"function":"regerr","message_template":"\\( \\) imbalance: %s","reason":"Logs an error when parentheses in a regular expression are not properly balanced. Occurs with unmatched \\( or \\) in the pattern.","resolution":"Fix the regular expression to ensure all opening \\( have matching closing \\)."},{"function":"regerr","message_template":"Too many \\(: %s","reason":"Logs an error when the number of capture groups exceeds the maximum allowed (NBRA). Happens when a complex regex has too many parenthesized expressions.","resolution":"Simplify the regular expression by reducing the number of capture groups or combining some together."},{"function":"regerr","message_template":"More than 2 numbers given in \\{ \\}: %s","reason":"Logs an error when more than two numbers are specified in a quantifier range. Occurs with malformed expressions like \\{1,2,3\\}.","resolution":"Correct the quantifier to use either a single number \\{n\\} or a range with two numbers \\{n,m\\}."},{"function":"regerr","message_template":"} expected after \\: %s","reason":"Logs an error when a closing brace is missing after a range specification. Occurs when using incomplete constructs like \\{1,2.","resolution":"Add the missing closing brace to complete the range specification."},{"function":"regerr","message_template":"First number exceeds second in \\{ \\}: %s","reason":"Logs an error when the minimum count exceeds the maximum in a range quantifier. Occurs with invalid ranges like \\{5,3\\}.","resolution":"Correct the range values to ensure the first number (minimum) is less than or equal to the second number (maximum)."},{"function":"regerr","message_template":"[ ] imbalance: %s","reason":"Logs an error when square brackets in a character class are not properly balanced. Occurs with unmatched [ or ] in patterns.","resolution":"Fix the regular expression to ensure all opening [ have matching closing ]."},{"function":"regerr","message_template":"Unknown regexp error code %s\n","reason":"Logs an error when an undefined error code is encountered in the regex engine. Indicates an internal error or unexpected condition.","resolution":"This is likely an internal error. Report the issue to the developers with the specific regular expression that triggered it."}],"project":"apache\/httpd"}