{"module":"sed_eval.c","summary":"This module implements the evaluation engine for the Apache sed utility, processing text streams according to sed commands. It handles operations like substitution, appending, and other text transformations while providing error reporting functionality.","logs":[{"function":"sed_reset_eval","message_template":"SEDERR_COMES","reason":"Reports an error when a file cannot be opened for writing. This typically occurs when file permissions are incorrect or the file path is invalid.","resolution":"Check file permissions and ensure the path exists and is writable by the Apache process."},{"function":"command","message_template":"SEDERR_TMAMES","reason":"Reports an error when there are too many append operations in the current buffer. This occurs when the append buffer (abuf) exceeds its maximum capacity.","resolution":"Modify the sed script to use fewer append operations or consider increasing the SED_ABUFSIZE constant if possible."},{"function":"command","message_template":"SEDERR_TMRMES","reason":"Reports an error when there are too many read operations in the current buffer. This occurs when the append buffer (abuf) exceeds its maximum capacity during read operations.","resolution":"Modify the sed script to use fewer read operations or consider increasing the SED_ABUFSIZE constant if possible."},{"function":"eval_errf","message_template":"%s","reason":"Generic error formatting function that formats an error message and passes it to the user-provided error handler. This is the main error reporting mechanism in the sed module.","resolution":"Check the specific error message passed to this function and address the underlying issue accordingly."},{"function":"sed_eval_file","message_template":"File read error","reason":"Implied error when file reading operations fail. This can occur due to file permission issues or if the file was deleted during processing.","resolution":"Verify file permissions and ensure the file exists throughout the duration of the processing."},{"function":"grow_buffer","message_template":"APR_ENOMEM","reason":"Reports an out-of-memory condition when buffer expansion exceeds the maximum allowed size (MAX_BUF_SIZE).","resolution":"Reduce the size of input being processed at once or increase the MAX_BUF_SIZE constant if memory resources allow."},{"function":"sed_finalize_eval","message_template":"Buffer processing error","reason":"Implied error when finalizing buffer processing fails. This can occur due to memory allocation issues or invalid text data.","resolution":"Check for memory issues and verify the input text data is valid and properly formatted."}],"project":"apache\/httpd"}