{"module":"mod_dav_fs","summary":"This module provides WebDAV property database functionality for the Apache HTTP Server using DBM-style databases. It enables storage and retrieval of WebDAV properties for resources by maintaining database files in a .DAV directory.","logs":[{"function":"dav_fs_dbm_error","message_template":"The DBM driver could not be loaded","reason":"This critical error occurs when Apache cannot load the DBM driver needed for WebDAV property databases. This usually indicates a system configuration problem or missing dependencies.","resolution":"Ensure the required DBM libraries are installed on the system. Check Apache's configuration and make sure the necessary modules are enabled. Look for related messages in the server logs for more specific details about why the driver couldn't be loaded."},{"function":"dav_dbm_open_direct","message_template":"mod_dav_fs: The DBM library '%s' for '%s' could not be loaded: %s","reason":"This error occurs when a specific DBM library needed for WebDAV property storage cannot be loaded. The error includes the library name, database type, and the specific error message.","resolution":"Install the missing DBM library mentioned in the error message. Check if the library is in the system's library path. Verify that the version of the library is compatible with your version of Apache."},{"function":"dav_fs_dbm_error","message_template":"Could not open database.","reason":"Failed to open the DBM database for a WebDAV resource. This may be due to permission issues, corruption, or the database not existing when opened in read-only mode.","resolution":"Check file permissions on the .DAV directory and its contents. Ensure the Apache process has read\/write access to these files. If the database is corrupted, you may need to delete it and let it be recreated (this will lose all WebDAV properties for the affected resources)."},{"function":"dav_dbm_open_direct","message_template":"Could not load library for database.","reason":"Apache failed to load a required library for database operations. This is similar to the DBM driver error but occurs at a different level in the code.","resolution":"Verify that all required database libraries are installed on your system. Check Apache's configuration to ensure the correct database backend is specified. Look for additional error messages that might provide more specific information about what library is missing."},{"function":"dav_propdb_open","message_template":"Prop database has the wrong major version number and cannot be used.","reason":"The property database format version doesn't match what the current version of mod_dav_fs expects. This typically happens after upgrading Apache when the database format has changed between versions.","resolution":"The property databases will need to be rebuilt. This usually means deleting the .DAV directories and letting them be recreated automatically. Note that this will cause all WebDAV properties to be lost, so consider backing up this data if it's important."},{"function":"dav_propdb_close","message_template":"Error writing propdb: %s","reason":"An error occurred while trying to write to the property database. This could be due to disk space issues, permission problems, or database corruption.","resolution":"Check disk space and file permissions. Ensure the Apache process has write access to the .DAV directory and its files. If problems persist, you may need to delete the corrupted database files and let them be recreated (this will lose the WebDAV properties for the affected resources)."}],"project":"apache\/httpd"}