{"module":"mod_dav_fs.c","summary":"This module implements the WebDAV locking functionality for files stored in a filesystem. It manages lock tokens, direct and indirect locks, lock-null resources, and provides the infrastructure to enforce WebDAV locks for file operations.","logs":[{"function":"dav_fs_parse_locktoken","message_template":"The lock token uses an unknown State-token format and could not be parsed.","reason":"A client provided a lock token that doesn't use the 'opaquelocktoken:' format as required by the WebDAV specification.","resolution":"This is a client error. The client needs to provide a properly formatted lock token as per the WebDAV specification."},{"function":"dav_fs_parse_locktoken","message_template":"The opaquelocktoken has an incorrect format and could not be parsed.","reason":"A client provided an opaquelocktoken that doesn't comply with the UUID format requirements.","resolution":"This is a client error. The client application needs to be fixed to generate proper UUIDs in the lock token."},{"function":"dav_fs_really_open_lockdb","message_template":"Could not lock mutex for lock database.","reason":"The server failed to acquire a mutex lock for the lock database, likely due to permission issues or system resource limitations.","resolution":"Check file permissions, system resource limits, and ensure the Apache process has appropriate access rights to the mutex. May also indicate high contention or a stalled process holding the mutex."},{"function":"dav_fs_really_open_lockdb","message_template":"Could not open the lock database.","reason":"The server failed to open the lock database file specified by DAVLockDB directive, possibly due to permissions or file system issues.","resolution":"Verify that the lock database path is valid, accessible, and has appropriate permissions for the Apache process. Ensure the parent directory exists and is writable."},{"function":"dav_fs_open_lockdb","message_template":"A lock database was not specified with the DAVLockDB directive. One must be specified to use the locking functionality.","reason":"DAVLockDB directive is missing from the Apache configuration but locking functionality is being requested.","resolution":"Add a 'DAVLockDB \/path\/to\/lockdb' directive to your Apache configuration to specify where lock information should be stored."},{"function":"dav_fs_save_lock_record","message_template":"INTERNAL DESIGN ERROR: the lockdb was opened readonly, but an attempt to save locks was performed.","reason":"Code attempted to write to a lock database that was opened read-only, indicating a bug in the module.","resolution":"This is an internal bug in the module. Report the issue to Apache maintainers with steps to reproduce the problem."},{"function":"dav_fs_save_lock_record","message_template":"Could not save lock information.","reason":"Failed to store lock information in the database, possibly due to permissions or disk space issues.","resolution":"Check that the lock database file is writable, sufficient disk space is available, and file system isn't corrupted or mounted read-only."},{"function":"dav_fs_load_lock_record","message_template":"The lock database was found to be corrupt. offset %APR_SIZE_T_FMT, c=%02x","reason":"The lock database file contains invalid data at the specified offset, likely due to disk corruption or incomplete writes.","resolution":"Delete the lock database file (this will remove all locks), and restart Apache. Consider checking the file system for errors if corruption happens repeatedly."},{"function":"dav_fs_resolve","message_template":"The lock database was found to be corrupt. An indirect lock's direct lock could not be found.","reason":"An indirect lock references a direct lock that doesn't exist in the database, indicating corruption of the lock database.","resolution":"Delete the lock database file (this will remove all locks), and restart Apache. Consider checking the file system for errors if corruption happens repeatedly."},{"function":"dav_fs_load_locknull_list","message_template":"Opened but could not stat file %s","reason":"The server could open a lock-null file but failed to get its size information, indicating possible file system issues.","resolution":"Check file system permissions and integrity. Ensure that the Apache process has full access to the .DAV directory and its contents."},{"function":"dav_fs_load_locknull_list","message_template":"Opened but rejected huge file %s","reason":"The lock-null file is too large to be processed safely, possibly indicating corruption or attack.","resolution":"Delete the specified lock-null file, which may cause some lock-null resources to be lost. Investigate why the file grew so large."},{"function":"dav_fs_load_locknull_list","message_template":"Failure reading locknull file for %s","reason":"The server couldn't read the contents of the lock-null file, possibly due to I\/O errors or corruption.","resolution":"Check file system for errors, ensure Apache has read permissions. You may need to delete the lock-null file which will reset lock-null resource tracking."},{"function":"dav_fs_save_locknull_list","message_template":"Error removing %s","reason":"Failed to delete an empty lock-null file, likely due to permission issues.","resolution":"Verify that Apache has write permissions to the .DAV directory and the lock-null file. Check for file system errors or permission problems."},{"function":"dav_fs_save_locknull_list","message_template":"Error opening %s for writing","reason":"Failed to open the lock-null file for writing, likely due to permissions or file system issues.","resolution":"Ensure Apache has write access to the .DAV directory. Check directory permissions and that the file system isn't mounted read-only."},{"function":"dav_fs_save_locknull_list","message_template":"Error writing %APR_SIZE_T_FMT bytes to %s","reason":"Failed to write data to the lock-null file, possibly due to disk full conditions or I\/O errors.","resolution":"Verify disk space availability and file system health. Check that the file system isn't mounted read-only and Apache has write permissions."},{"function":"dav_fs_add_locknull_state","message_template":"Could not load .locknull file.","reason":"Failed to load the list of lock-null resources, preventing the server from tracking a new lock-null resource.","resolution":"Check permissions on the .DAV directory and its contents. May need to recreate the .DAV directory if it's corrupted."},{"function":"dav_fs_add_locknull_state","message_template":"Could not save .locknull file.","reason":"Failed to save updates to the lock-null file after adding a new lock-null resource.","resolution":"Verify that Apache has write permissions to the .DAV directory and check for disk space issues or file system errors."},{"function":"dav_fs_get_locks","message_template":"INTERNAL DESIGN ERROR: DAV_GETLOCKS_COMPLETE is not yet supported","reason":"Code attempted to use an unimplemented feature, indicating a bug in the module.","resolution":"This is an internal bug in the module. Report the issue to Apache maintainers with steps to reproduce the problem."}],"project":"apache\/httpd"}