{"module":"repos.c","summary":"This module implements filesystem-based quota management for Apache WebDAV, calculating used and available disk space to enforce quota limits on operations like PUT, COPY, and MOVE. It handles both filesystem-level quotas and user-defined quotas for WebDAV repositories.","logs":[{"function":"get_dir_used_bytes_walk","message_template":"failed to open \"%s\"","reason":"Logs an error when the function fails to open a directory for scanning. This typically occurs due to permission issues or the directory not existing.","resolution":"Check filesystem permissions and ensure the directory path exists. Verify the Apache process has sufficient permissions to access the directory."},{"function":"get_dir_used_bytes_walk","message_template":"Cannot get entry name in \"%s\"","reason":"Logs an error when the function cannot retrieve the name of a directory entry. This could happen due to filesystem corruption or compatibility issues.","resolution":"Check the filesystem for errors using appropriate tools (e.g., fsck). Ensure the filesystem type is fully supported by the operating system."},{"function":"get_dir_used_bytes_walk","message_template":"Cannot get entry type in \"%s\"","reason":"Logs an error when the function cannot determine if an entry is a file, directory, or other type. May indicate filesystem issues or permission problems.","resolution":"Verify filesystem health and permissions. If the issue persists, consider running a filesystem check or repair operation."},{"function":"get_dir_used_bytes_walk","message_template":"Cannot get entry size in \"%s\"","reason":"Logs an error when the function fails to retrieve the size of a file. This could be due to permission issues or filesystem problems.","resolution":"Check file permissions and ensure the Apache process has read access to all files in the WebDAV repository. Verify the filesystem is not corrupted."},{"function":"get_dir_used_bytes_walk","message_template":"apr_filepath_merge \"%s\" \"%s\" failed","reason":"Logs an error when the APR filepath merge operation fails. This typically occurs when trying to combine two path components that would result in an invalid path.","resolution":"Check for invalid characters in directory or file names. Ensure paths don't exceed maximum length limits for the operating system."},{"function":"get_dir_used_bytes_walk","message_template":"apr_dir_read failed on \"%s\"","reason":"Logs an error when the function fails to read directory entries. This could be due to permission issues, filesystem errors, or resource constraints.","resolution":"Check for sufficient system resources (file descriptors, memory). Verify directory permissions and filesystem health."},{"function":"dav_fs_quota_precondition","message_template":"Quota enabled, but failed to compute available space.","reason":"Reports an error when quota is enabled but the system cannot calculate the available space. This may happen due to unsupported filesystem types or system call failures.","resolution":"Ensure the filesystem supports statvfs or equivalent calls. Check if the quota system is properly configured for the filesystem type being used."},{"function":"dav_fs_quota_precondition","message_template":"Insufficient disk space","reason":"Reports an error when a WebDAV operation would exceed available physical disk space. This prevents operations that would fill the disk completely.","resolution":"Free up disk space on the server. If possible, increase the available disk space by adding storage or cleaning up unnecessary files."},{"function":"dav_fs_quota_precondition","message_template":"Quota exceeded","reason":"Reports an error when a WebDAV operation would exceed the configured quota limit. This enforces user quotas regardless of actual disk space.","resolution":"Either increase the quota limit for the affected user\/repository or have the user delete files to reduce their current usage below the quota limit."},{"function":"dav_fs_quota_precondition","message_template":"client sent invalid Content-Length","reason":"Reports an error when a client includes a Content-Length header that cannot be parsed as a valid number. This prevents invalid requests from being processed.","resolution":"Check client software for compliance with HTTP specifications. If the issue persists with specific clients, they may need to be updated or fixed."}],"project":"apache\/httpd"}