{"module":"mod_dav_fs.c","summary":"Implements a filesystem-based WebDAV repository provider for Apache. Handles WebDAV operations like GET, PUT, MOVE, COPY, and property management with filesystem storage, including handling of locks, collections and resource management.","logs":[{"function":"dav_fs_walker","message_template":"could not access file (%s) during directory walk","reason":"Logs an error when a file cannot be accessed during a directory traversal operation, often during PROPFIND or COPY\/MOVE commands. Likely due to permission problems or the file being deleted between listing the directory and trying to access it.","resolution":"Check file permissions, ensure no concurrent processes are modifying the directory structure during WebDAV operations, and verify the integrity of the filesystem."},{"function":"dav_fs_dir_file_name","message_template":"An incomplete\/bad path was found in dav_fs_dir_file_name.","reason":"Error when the module couldn't properly parse a file path into directory and filename components. Often occurs when paths contain unusual characters or are malformed.","resolution":"Check the URLs being requested and ensure they follow standard WebDAV path conventions. May require URL encoding of special characters."},{"function":"dav_fs_copymove_file","message_template":"Could not set permissions on destination","reason":"Error when attempting to set file permissions on a destination file during copy or move operations. Often due to permission issues or filesystem restrictions.","resolution":"Check that the web server has sufficient permissions to modify file attributes in the destination directory. May require changing ownership or permissions of the parent directory."},{"function":"dav_fs_copymove_file","message_template":"Could not open file for reading","reason":"Error when source file cannot be opened for reading during a copy or move operation. Likely due to permission issues or the file no longer existing.","resolution":"Verify file permissions on the source file and ensure the web server has read access. Check that the file still exists and isn't locked by another process."},{"function":"dav_fs_copymove_file","message_template":"Could not open file for writing","reason":"Error when destination file cannot be opened for writing during a copy or move operation. Typically due to permission issues in the destination directory.","resolution":"Check write permissions in the destination directory and ensure the web server has write access. Verify that any existing file at the destination can be overwritten."},{"function":"dav_fs_copymove_file","message_template":"Could not delete output after read failure. Server is now in an inconsistent state.","reason":"Error when a file copy operation fails during reading, and the partial destination file cannot be deleted, leaving the server in an inconsistent state.","resolution":"Manually check and remove partial files in the destination. Investigate why deletion failed - likely permissions or filesystem issues. Server restart may be needed if WebDAV operations continue to fail."},{"function":"dav_fs_copymove_file","message_template":"Could not read input file","reason":"Error when reading from the source file during a copy or move operation. May be due to I\/O errors or permission changes during the operation.","resolution":"Check the health of the filesystem, ensure the source file is not being modified during the operation, and verify read permissions remain consistent throughout the operation."},{"function":"dav_fs_copymove_file","message_template":"Could not delete output after write failure. Server is now in an inconsistent state.","reason":"Error when a file copy operation fails during writing, and the partial destination file cannot be deleted, leaving the server in an inconsistent state.","resolution":"Manually delete corrupt destination files, check disk space and permissions. May require server restart if WebDAV operations continue to fail due to the inconsistent state."},{"function":"dav_fs_copymove_file","message_template":"Could not write output file","reason":"Error when writing to the destination file during a copy operation. Often due to disk space issues or permissions changing during the operation.","resolution":"Check available disk space, verify write permissions remain consistent, and ensure no other processes are modifying permissions during the operation."},{"function":"dav_fs_copymove_file","message_template":"Could not remove source file %s after move to %s. The server may be in an inconsistent state.","reason":"Error when the source file couldn't be deleted after being successfully copied during a move operation. Results in both source and destination having the file, violating the move semantics.","resolution":"Manually delete the source file if appropriate. Check permissions on the source directory and investigate why deletion failed. Consider filesystem-level issues if this happens frequently."},{"function":"dav_fs_copymove_file","message_template":"Could not remove source or destination file. Server is now in an inconsistent state.","reason":"Critical error during move operation when neither source nor destination could be properly managed, leaving the server in an undefined state.","resolution":"Manual intervention required - check both source and destination files for corruption, verify permissions, and potentially restart the server if WebDAV operations continue to fail."},{"function":"dav_fs_copymove_file","message_template":"Could not remove source file after move. Destination was removed to ensure consistency.","reason":"Error during move operation where source couldn't be deleted but destination was successfully removed to maintain consistency. The operation effectively failed completely.","resolution":"Check permissions on the source file and directory. The operation failed but the system remained consistent, so no immediate action required beyond addressing the permission issue."},{"function":"dav_fs_copymove_state","message_template":"Could not create internal state directory","reason":"Error when trying to create the .DAV state directory to store WebDAV properties. Usually due to permission issues in the parent directory.","resolution":"Check that the web server has write permissions in all WebDAV-accessible directories. The .DAV directory is essential for WebDAV property storage."},{"function":"dav_fs_copymove_state","message_template":"State directory disappeared","reason":"Error when the .DAV state directory vanished during an operation, possibly due to concurrent deletion by another process.","resolution":"Prevent external processes from modifying the .DAV directories. These directories are managed by the WebDAV module and should not be manually altered."},{"function":"dav_fs_copymove_state","message_template":"State directory is actually a file","reason":"Error when the .DAV state directory path exists but is a file instead of a directory, preventing property storage.","resolution":"Remove the file named .DAV and allow the WebDAV module to create it as a directory. Investigate how a file with this name was created instead of a directory."},{"function":"dav_fs_copymove_state","message_template":"Could not move state file.","reason":"Error when trying to move WebDAV property state files during a resource move operation, resulting in properties not being moved with the resource.","resolution":"Check permissions on both source and destination .DAV directories. May need to manually copy properties or reset properties on the moved resource."},{"function":"dav_fs_copymoveset","message_template":"DESIGN ERROR: dav_dbm_get_statefiles() returned inconsistent results.","reason":"Internal error in the WebDAV property system where the property database provided inconsistent information. This is a code or design issue rather than a runtime problem.","resolution":"Report the issue to Apache developers. This typically indicates a bug in the WebDAV implementation that needs to be fixed in the code."},{"function":"dav_fs_copymoveset","message_template":"Could not fully copy\/move the properties. The server is now in an inconsistent state.","reason":"Error when WebDAV properties could only be partially copied\/moved, leaving the server with resources that have incomplete or inconsistent properties.","resolution":"Consider resetting properties on the affected resources. May require manual intervention to fix the property database or in extreme cases, restoring from backup."},{"function":"dav_fs_deleteset","message_template":"Could not remove properties.","reason":"Error when trying to delete WebDAV properties associated with a deleted resource. The resource was deleted but its properties remain orphaned.","resolution":"Check permissions on the .DAV directory. May need to manually clean up orphaned property files if this happens frequently."},{"function":"dav_fs_deleteset","message_template":"Could not fully remove properties. The server is now in an inconsistent state.","reason":"Error when only some property files for a resource could be deleted, leaving orphaned and inconsistent property data in the system.","resolution":"Manual cleanup of the .DAV directory may be needed. In persistent cases, consider temporarily disabling WebDAV property functionality until the underlying issue is resolved."},{"function":"dav_fs_get_resource","message_template":"The URL contains extraneous path components. The resource could not be identified.","reason":"Error when a URL contains additional path components beyond a file resource name, making it impossible to identify what resource is actually being targeted.","resolution":"Check client WebDAV requests for malformed URLs. Correct the requesting application to use proper WebDAV URL formatting without extraneous path components after non-collection resources."},{"function":"dav_fs_open_stream","message_template":"Could not open an existing resource for writing: %s.","reason":"Error when attempting to open an existing file for writing during PUT or other operations that modify resources. Typically due to permission issues.","resolution":"Check write permissions on the file and its parent directory. Ensure the web server has proper access to modify the file."},{"function":"dav_fs_open_stream","message_template":"Could not open an existing resource for reading: %s.","reason":"Error when attempting to open a file for reading during GET or copy operations. Usually a permission issue or the file was removed after resource identification.","resolution":"Verify file permissions allow the web server to read the file. Check that the file still exists and isn't being concurrently deleted."},{"function":"dav_fs_open_stream","message_template":"An error occurred while opening a resource for writing: %s.","reason":"Generic error during file open operations for writing, capturing various underlying issues with file access or creation.","resolution":"Check permissions, disk space, and inode availability. Verify the filesystem is healthy and not in a read-only state."},{"function":"dav_fs_close_stream","message_template":"There was a problem removing (rolling back) the resource when it was being closed.","reason":"Error when trying to delete a resource after an error occurred during writing, preventing proper cleanup of failed operations.","resolution":"Manual cleanup may be needed for partially written files. Check permissions and filesystem health if this occurs frequently."},{"function":"dav_fs_close_stream","message_template":"There was a problem writing the file atomically after writes.","reason":"Error when renaming a temporary file to its final destination after successfully writing all content, often due to permission issues or disk failure.","resolution":"Check permissions on the destination directory and verify filesystem health. Temporary files may need manual cleanup in the WebDAV directories."},{"function":"dav_fs_write_stream","message_template":"There is not enough storage to write to this resource.","reason":"Error due to insufficient disk space when writing file content during PUT or copy operations.","resolution":"Free up disk space or extend the filesystem. Consider implementing quota systems to prevent WebDAV operations from filling disk space."},{"function":"dav_fs_write_stream","message_template":"An error occurred while writing to a resource.","reason":"Generic error during file write operations, capturing various I\/O errors, permission changes, or disk issues during writing.","resolution":"Check disk health, permissions, and available space. May indicate underlying filesystem problems if seen frequently."},{"function":"dav_fs_seek_stream","message_template":"Could not seek to specified position in the resource.","reason":"Error when trying to position the file pointer during read\/write operations. May indicate file corruption or concurrent modification.","resolution":"Check file integrity and ensure no concurrent modifications are happening to the same file. May require recreating the file if it's corrupted."},{"function":"dav_fs_deliver","message_template":"Cannot GET this type of resource.","reason":"Error when client tries to GET a resource that doesn't support GET operations, such as certain special WebDAV resources.","resolution":"This is typically a client error. Educate client application developers about proper WebDAV resource types and operations."},{"function":"dav_fs_deliver","message_template":"There is no default response to GET for a collection.","reason":"Error when client tries to GET a collection resource without specifying how the collection should be represented.","resolution":"Client should use PROPFIND instead of GET for collections, or the server configuration should be updated to provide index pages for collections."},{"function":"dav_fs_deliver","message_template":"File permissions deny server access.","reason":"Error when the web server process doesn't have permission to read a file during GET operations.","resolution":"Check file permissions and ownership. Ensure the web server user has read access to the file."},{"function":"dav_fs_deliver","message_template":"Could not write contents to filter.","reason":"Error when the content delivery system couldn't write to the output filters, usually due to a client disconnection or internal server error.","resolution":"This is often a transient issue with client connections. If persistent, check for issues with Apache's filter chain configuration."},{"function":"dav_fs_create_collection","message_template":"There is not enough storage to create this collection.","reason":"Error due to insufficient disk space when trying to create a new collection (directory).","resolution":"Free up disk space or extend the filesystem. Creating directories requires minimal space, so this error may indicate a severely full filesystem."},{"function":"dav_fs_create_collection","message_template":"Cannot create collection; intermediate collection does not exist.","reason":"Error when trying to create a nested collection when the parent collection doesn't exist. WebDAV requires parents to exist before creating children.","resolution":"Client should create parent collections first, or use a WebDAV client that properly creates parent collections (recursive creation)."},{"function":"dav_fs_create_collection","message_template":"Unable to create collection.","reason":"Generic error when creating a collection fails for reasons other than storage or missing parents. Often permission-related.","resolution":"Check directory permissions and ensure the web server has write access to the parent directory."},{"function":"dav_fs_copymove_walker","message_template":"Error(s) occurred on some resources during the COPY\/MOVE process.","reason":"Some errors occurred during a multi-resource COPY or MOVE operation, but the operation continued with other resources.","resolution":"Check individual resource errors in the WebDAV multistatus response. May require manual cleanup or verification of partially completed operations."},{"function":"dav_fs_copy_resource","message_template":"DESIGN ERROR: a mix of repositories was passed to copy_resource.","reason":"Internal error where a copy operation was attempted between different types of repositories, which is not supported by the implementation.","resolution":"This is a client or server code issue. Ensure WebDAV clients don't attempt cross-repository operations, or modify server code if developing custom modules."},{"function":"dav_fs_move_resource","message_template":"DESIGN ERROR: a mix of repositories was passed to move_resource.","reason":"Internal error where a move operation was attempted between different types of repositories, which is not supported by the implementation.","resolution":"This is a client or server code issue. Ensure WebDAV clients don't attempt cross-repository operations, or modify server code if developing custom modules."},{"function":"dav_fs_move_resource","message_template":"Could not rename resource.","reason":"Error when attempting to rename a file during MOVE operations, typically due to permission issues or filesystem restrictions.","resolution":"Check permissions on both source and destination directories. Verify the filesystem supports rename operations between the specific locations."},{"function":"dav_fs_move_resource","message_template":"The resource was moved, but a failure occurred during the move of its properties. The resource could not be restored to its original location. The server is now in an inconsistent state.","reason":"Critical error where a file was moved but its properties couldn't be moved, and attempts to roll back the file move also failed, leaving the system inconsistent.","resolution":"Manual intervention required. Check file locations and potentially restore from backup if properties are critical. May require fixing permissions in both source and destination directories."},{"function":"dav_fs_move_resource","message_template":"The resource was moved, but a failure occurred during the move of its properties. The resource was moved back to its original location, but its properties may have been partially moved. The server may be in an inconsistent state.","reason":"Error where a file was moved, property movement failed, and the file was moved back, but properties may be partially moved or corrupted.","resolution":"Check and potentially reset properties on the affected resource. The file location is consistent, but properties may need manual intervention."},{"function":"dav_fs_internal_walk","message_template":"DESIGN ERROR: walker called to walk locknull resources, but a lockdb was not provided.","reason":"Internal error in the WebDAV implementation where code is trying to process lock-null resources without having a lock database available.","resolution":"This is a server code issue. Report to Apache developers as it indicates a bug in the WebDAV implementation."},{"function":"dav_fs_patch_validate","message_template":"The 'executable' property cannot be removed.","reason":"Error when a client attempts to delete the 'executable' property, which is a protected property that can only be set, not removed.","resolution":"Client applications should be updated to not attempt deletion of the executable property. It can only be set to 'T' or 'F'."},{"function":"dav_fs_patch_validate","message_template":"The 'executable' property expects a single character, valued 'T' or 'F'. There was no value submitted.","reason":"Error when attempting to set the executable property without providing a value.","resolution":"Client should provide either 'T' or 'F' as the value when setting this property. Update client applications to properly set this property."},{"function":"dav_fs_patch_validate","message_template":"The 'executable' property expects a single character, valued 'T' or 'F'. The value submitted is invalid.","reason":"Error when setting the executable property with a value other than 'T' or 'F'.","resolution":"Update client applications to only use 'T' or 'F' when setting this property. Any other value is invalid."},{"function":"dav_fs_patch_validate","message_template":"The 'executable' property expects a single character, valued 'T' or 'F'. The value submitted has too many characters.","reason":"Error when setting the executable property with a multi-character value instead of the required single character.","resolution":"Update client applications to only use a single 'T' or 'F' character when setting this property."},{"function":"dav_fs_patch_exec","message_template":"Could not set the executable flag of the target resource.","reason":"Error when the system call to change file permissions failed, preventing the executable flag from being set as requested.","resolution":"Check file permissions and ownership. Ensure the web server has permission to change the executable bit on the file."},{"function":"dav_fs_patch_rollback","message_template":"After a failure occurred, the resource's executable flag could not be restored.","reason":"Critical error where after a failed property operation, the system couldn't restore the original executable flag state, leaving the file with incorrect permissions.","resolution":"Manual intervention required to set correct file permissions. Check file ownership and permissions on the containing directory."}],"project":"apache\/httpd"}