{"project":"sendmail","module":"mail.local.c","summary":"This module implements mail.local, a program for delivering mail to local user mailboxes. It handles both direct message delivery and LMTP protocol interactions, with support for mailbox locking, user database lookups, and secure delivery handling.","logs":[{"function":"main","message_template":"421 Configuration error: _PATH_MAILDIR too large","reason":"The PATH_MAILDIR configuration value exceeds the maximum path length. This prevents the program from operating correctly.","resolution":"Modify the configuration to use a shorter path for the mail directory."},{"function":"main","message_template":"Multiple -f options","reason":"User specified the -f (from) option multiple times which is invalid.","resolution":"Use only one -f option in the command line."},{"function":"main","message_template":"-h: missing filename","reason":"The -h option was provided without a required filename parameter.","resolution":"Provide a valid filename parameter with the -h option."},{"function":"main","message_template":"-H: missing hashinfo","reason":"The -H option was provided without the required hash info parameter.","resolution":"Provide hash type and depth information with the -H option."},{"function":"main","message_template":"-H: unknown hash type","reason":"An invalid hash type was specified with the -H option.","resolution":"Use a supported hash type (u for user-based, m for MD5 if compiled with support)."},{"function":"main","message_template":"-H: invalid hash depth","reason":"The hash depth specified with -H is invalid (either too small, too large, or not a number).","resolution":"Specify a numeric hash depth that is greater than 0 and small enough not to exceed path limitations."},{"function":"main","message_template":"-p: missing spool path","reason":"The -p option was provided without a required spool path parameter.","resolution":"Provide a valid spool path with the -p option."},{"function":"main","message_template":"-p: invalid spool path","reason":"The spool path specified with -p is too long to fit in the internal buffer.","resolution":"Use a shorter spool path that fits within system limits."},{"function":"main","message_template":"Can not open mailbox database %s: %s","reason":"Unable to initialize the mailbox database. System might be unable to locate user information.","resolution":"Check that the mailbox database exists and has correct permissions. Verify that the system has sufficient resources."},{"function":"main","message_template":"Users should not be specified in command line if LMTP required","reason":"Both LMTP mode (-l) and user arguments were specified, which is invalid.","resolution":"In LMTP mode, users should be specified via the RCPT TO command, not on the command line."},{"function":"process_recipient","message_template":"550 5.1.1 User unknown","reason":"The specified recipient user does not exist in the system database.","resolution":"Check the spelling of the username or create the user account if needed."},{"function":"process_recipient","message_template":"451 4.3.0 User database failure; retry later","reason":"A temporary problem accessing the user database occurred.","resolution":"Check system load and resources. The issue may resolve itself when the system load decreases."},{"function":"process_recipient","message_template":"550 5.3.0 User database failure","reason":"A permanent failure accessing the user database occurred.","resolution":"Check that the user database is not corrupted. May require administrator intervention to fix database issues."},{"function":"dolmtp","message_template":"503 5.5.1 No recipients","reason":"The DATA command was issued in LMTP mode without specifying any recipients.","resolution":"Issue at least one valid RCPT TO command before the DATA command."},{"function":"dolmtp","message_template":"503 %s Duplicate LHLO","reason":"The client issued multiple LHLO commands in the same LMTP session.","resolution":"Modify the client to only send LHLO once per session."},{"function":"dolmtp","message_template":"503 5.5.1 Nested MAIL command","reason":"The client issued a MAIL command when one was already active in the session.","resolution":"Use RSET before sending a new MAIL command in the same session."},{"function":"dolmtp","message_template":"501 5.5.4 Syntax error in parameters","reason":"The parameters for a MAIL FROM or RCPT TO command were malformed.","resolution":"Check the syntax of the command parameters to ensure they follow SMTP\/LMTP specifications."},{"function":"dolmtp","message_template":"503 5.5.1 Need MAIL command","reason":"A RCPT command was issued before a valid MAIL command.","resolution":"Always send a MAIL FROM command before any RCPT TO commands."},{"function":"dolmtp","message_template":"421 4.3.0 Memory exhausted","reason":"The system ran out of memory while processing the request.","resolution":"Check system memory resources. May require increasing system memory or reducing load."},{"function":"dolmtp","message_template":"500 5.5.2 Syntax error","reason":"An unrecognized or malformed command was received.","resolution":"Check that client is sending valid LMTP commands with proper syntax."},{"function":"store","message_template":"451 4.3.0 Unable to open temporary file","reason":"Could not open a temporary file for storing the message, possibly due to permissions or disk space issues.","resolution":"Check available disk space and permissions in the mail spool directory."},{"function":"store","message_template":"451 4.3.0 Temporary file write error","reason":"Error writing to the temporary message file.","resolution":"Check for disk errors, full disk conditions, or I\/O issues on the mail spool filesystem."},{"function":"store","message_template":"451 4.3.0 Temporary file flush error","reason":"Error flushing the temporary message file to disk.","resolution":"Check for disk errors or I\/O issues on the mail spool filesystem."},{"function":"deliver","message_template":"550 5.1.1 %s: Invalid mailbox path","reason":"The constructed mailbox path is invalid, possibly due to path length or illegal characters.","resolution":"Check username for invalid characters, or configure the system to use shorter paths for mailboxes."},{"function":"deliver","message_template":"550 5.1.1 %s: User missing home directory","reason":"The user exists but has no home directory defined.","resolution":"Set a valid home directory for the user in the system user database."},{"function":"deliver","message_template":"lockmailbox %s failed; error code %d %s","reason":"Failed to acquire a lock on the user's mailbox, preventing secure delivery.","resolution":"Check for stale lock files or hung processes that might be holding mailbox locks."},{"function":"deliver","message_template":"550 5.2.0 %s: lstat: file changed after open","reason":"The mailbox file was modified by another process while mail.local was attempting to deliver to it.","resolution":"This is typically a transient issue. If persistent, check for other processes writing to the mailbox file."},{"function":"deliver","message_template":"450 4.2.0 Create %s: %s","reason":"Failed to create a new mailbox file.","resolution":"Check directory permissions and disk space. Ensure the mail spool directory exists and is writable."},{"function":"deliver","message_template":"451 4.3.0 chown %u.%u: %s","reason":"Failed to change ownership of a newly created mailbox file.","resolution":"Check that the mail.local program has sufficient privileges to change file ownership."},{"function":"deliver","message_template":"550 5.2.0 %s: too many links","reason":"The mailbox file has multiple hard links, which is a security risk.","resolution":"Check for and remove additional hard links to the mailbox file. Each mailbox should have exactly one link."},{"function":"deliver","message_template":"550 5.2.0 %s: irregular file","reason":"The mailbox is not a regular file (could be a directory, symlink, or special file).","resolution":"Remove the irregular file and let mail.local create a proper mailbox file."},{"function":"deliver","message_template":"550 5.2.0 %s: wrong ownership (%d)","reason":"The mailbox file is owned by a different user than the intended recipient.","resolution":"Check and correct the ownership of the mailbox file to match the recipient user."},{"function":"deliver","message_template":"450 4.2.0 setreuid(0, %d): %s (r=%d, e=%d)","reason":"Failed to change the effective user ID for delivery, which is needed for quota enforcement.","resolution":"Ensure mail.local has the appropriate setuid permissions and is owned by root."},{"function":"deliver","message_template":"450 4.2.0 Append %s: %s","reason":"Failed to open the mailbox file for appending the message.","resolution":"Check file permissions and ensure the file is a regular file readable by the mail.local process."},{"function":"deliver","message_template":"551 5.2.2 %s: Mailbox full or quota exceeded","reason":"The user's mailbox quota has been exceeded.","resolution":"The user needs to delete some mail or request a quota increase. If BounceQuota is set, mail will be permanently rejected."},{"function":"deliver","message_template":"450 4.2.0 Lock %s: %s","reason":"Failed to lock the mailbox file with flock.","resolution":"Check for processes holding locks on the file. May be a system resource limitation or NFS issue."},{"function":"deliver","message_template":"450 4.2.0 Temporary file seek error: %s","reason":"Failed to seek to the beginning of the temporary message file.","resolution":"Check for file system errors or corruption. May be a transient I\/O issue."},{"function":"deliver","message_template":"450 4.2.0 Write %s: %s","reason":"Failed to write the message to the mailbox.","resolution":"Check for disk space issues, quota problems, or file system errors."},{"function":"deliver","message_template":"450 4.2.0 Temporary file read error: %s","reason":"Failed to read from the temporary message file.","resolution":"Check for file system errors or corruption. May be an I\/O issue."},{"function":"deliver","message_template":"450 4.2.0 Sync %s: %s","reason":"Failed to synchronize (fsync) the mailbox file to disk.","resolution":"Check for disk I\/O issues or file system problems."},{"function":"deliver","message_template":"450 4.2.0 Close %s: %s","reason":"Failed to close the mailbox file after writing.","resolution":"Check for file system errors. This could indicate data was not properly saved."},{"function":"deliver","message_template":"450 4.2.0 setreuid(0, 0): %s","reason":"Failed to reset the effective user ID back to root after delivery.","resolution":"This is a potentially serious security issue. Check system integrity and permissions."},{"function":"usage","message_template":"usage: mail.local [-7] [-b] [-d] [-l] [-f from|-r from] [-h filename] [-p path] user ...","reason":"The program was invoked with incorrect command-line parameters.","resolution":"Check the command syntax and provide the required parameters according to the usage message."}]}