{"module":"mod_heartmonitor.c","summary":"This module monitors the health of backend servers by receiving and processing heartbeat messages. It stores server status information either in shared memory or in a file, and provides this information to other modules like mod_proxy_balancer for load balancing decisions.","logs":[{"function":"hm_listen","message_template":"Failed to create listening socket.","reason":"The module was unable to create a UDP socket for receiving heartbeat messages. This could be due to system resource limitations or insufficient permissions.","resolution":"Check system resource limits, ensure the Apache process has sufficient permissions, and verify network configuration."},{"function":"hm_listen","message_template":"Failed to set APR_SO_REUSEADDR to 1 on socket.","reason":"Could not set the socket option to allow reuse of local addresses. This may prevent the server from binding to the required address if it was recently used.","resolution":"Check system network configuration and permissions. Restart Apache to release any lingering socket bindings."},{"function":"hm_listen","message_template":"Failed to set APR_SO_NONBLOCK to 1 on socket.","reason":"Could not set the socket to non-blocking mode, which is required for proper operation of the heartbeat monitor.","resolution":"Check system networking configuration and consider restarting Apache."},{"function":"hm_listen","message_template":"Failed to bind on socket.","reason":"The module could not bind the socket to the configured address and port. This might be due to the port being in use or insufficient permissions.","resolution":"Verify that no other process is using the configured port. Check system permissions and firewall settings."},{"function":"hm_listen","message_template":"Failed to join multicast group","reason":"The module could not join the specified multicast group. This might be due to network configuration issues or firewall settings.","resolution":"Check network multicast configuration, ensure multicast routing is enabled, and verify firewall rules allow multicast traffic."},{"function":"hm_listen","message_template":"Failed to accept localhost mulitcast on socket.","reason":"The module could not configure the socket to accept multicast packets sent from the local host.","resolution":"Check system network configuration and loopback interface settings."},{"function":"hm_file_update_stat","message_template":"Unable to open tmp file: %s","reason":"The module failed to create a temporary file for storing heartbeat data. This might be due to file system permissions or disk space issues.","resolution":"Check permissions on the specified path, ensure adequate disk space, and verify that Apache can write to the directory."},{"function":"hm_file_update_stat","message_template":"Unable to read file: %s","reason":"The module could not read the existing heartbeat storage file. This might be due to file permissions or file corruption.","resolution":"Check file permissions, verify file integrity, and ensure the file exists."},{"function":"hm_file_update_stat","message_template":"Unable to read from file: %s","reason":"The module encountered an error while reading data from the heartbeat storage file. This might indicate file corruption or I\/O issues.","resolution":"Check file system health, verify that the file is not corrupted, and ensure no other process is modifying the file."},{"function":"hm_file_update_stat","message_template":"Unable to flush file: %s","reason":"The module failed to flush data to the temporary heartbeat storage file. This might be due to disk space issues or I\/O errors.","resolution":"Check available disk space, file system health, and I\/O subsystem status."},{"function":"hm_file_update_stat","message_template":"Unable to close file: %s","reason":"The module failed to properly close the temporary heartbeat storage file. This might indicate file system issues.","resolution":"Check file system health and for any stuck file handles. A system reboot might be necessary if the issue persists."},{"function":"hm_file_update_stat","message_template":"Unable to set file permissions on %s","reason":"The module could not set the appropriate permissions on the temporary heartbeat storage file. This might affect file accessibility.","resolution":"Check file system permissions and Apache process permissions. Ensure the file system supports the requested permission operations."},{"function":"hm_file_update_stat","message_template":"Unable to move file: %s -> %s","reason":"The module failed to rename the temporary heartbeat storage file to its final name. This might be due to file system permissions or existing file issues.","resolution":"Check file permissions, ensure that the destination file is not locked by another process, and verify file system operations."},{"function":"hm_processmsg","message_template":"malformed message from %pI","reason":"The module received a heartbeat message that did not contain the expected fields. This might indicate compatibility issues or malformed packets.","resolution":"Check that all backend servers are using compatible versions of the heartbeat protocol. Verify network integrity and check for packet corruption."},{"function":"hm_recv","message_template":"would block","reason":"A non-blocking socket operation would block, which is expected behavior and logged for debugging purposes.","resolution":"This is informational and usually requires no action. If it appears frequently, check network performance and load."},{"function":"hm_recv","message_template":"recvfrom failed","reason":"The module encountered an error while receiving data from the socket. This might indicate network issues or socket configuration problems.","resolution":"Check network connectivity, verify socket configuration, and ensure no firewall is blocking the traffic."},{"function":"hm_watchdog_callback","message_template":"Unable to listen for connections!","reason":"The watchdog could not set up the listening socket for heartbeat messages. This prevents the module from functioning properly.","resolution":"Check network configuration, verify that the configured multicast address and port are valid, and ensure no other process is using the port."},{"function":"hm_watchdog_callback","message_template":"%s listener started.","reason":"Informational message indicating that the heartbeat monitor has successfully started its listener.","resolution":"Information log, no resolution required."},{"function":"hm_watchdog_callback","message_template":"stopping %s listener.","reason":"Informational message indicating that the heartbeat monitor is stopping its listener, typically during server shutdown.","resolution":"Information log, no resolution required."},{"function":"hm_post_config","message_template":"mod_watchdog is required","reason":"The module requires mod_watchdog to function, but it could not be found or is not loaded.","resolution":"Ensure that mod_watchdog is loaded in the Apache configuration before mod_heartmonitor."},{"function":"hm_post_config","message_template":"failed to lookup provider 'shm' for '%s', maybe you need to load mod_slotmem_shm?","reason":"The module is configured to use shared memory for storage but could not find the required provider module.","resolution":"Ensure mod_slotmem_shm is loaded in the Apache configuration before mod_heartmonitor if using shared memory storage."},{"function":"hm_post_config","message_template":"slotmem_create for status failed","reason":"The module failed to create the shared memory segment for storing heartbeat data. This might be due to system resource limitations.","resolution":"Check system shared memory limits, ensure adequate memory is available, and verify Apache configuration."},{"function":"hm_post_config","message_template":"Failed to create watchdog instance (%s)","reason":"The module could not create a watchdog instance for monitoring heartbeat messages. This prevents proper operation of the module.","resolution":"Check that mod_watchdog is properly loaded and configured. Review Apache error logs for related issues."},{"function":"hm_post_config","message_template":"Failed to register watchdog callback (%s)","reason":"The module could not register its callback function with the watchdog. This prevents proper operation of the module.","resolution":"Check that mod_watchdog is properly loaded and functioning. Review Apache error logs for related issues."},{"function":"hm_post_config","message_template":"wd callback %s","reason":"Informational message indicating successful registration of the watchdog callback.","resolution":"Information log, no resolution required."},{"function":"hm_processmsg","message_template":"%pI busy=%s ready=%s","reason":"Debug message showing the status information received from a backend server.","resolution":"Information log, no resolution required."}],"project":"apache\/httpd"}