{"module":"mod_heartbeat.c","summary":"This Apache module implements a heartbeat mechanism that broadcasts server status information via UDP multicast. It periodically sends information about the number of ready and busy worker threads, allowing external load balancers or monitoring systems to track server health.","logs":[{"function":"hb_monitor","message_template":"Heartbeat: apr_socket_create failed","reason":"Logs a warning when the module fails to create a UDP socket for sending heartbeat messages. Likely due to system resource limitations or networking configuration issues.","resolution":"Check system resources, verify network configuration, and ensure the process has appropriate permissions to create sockets. May require increasing system file descriptor limits or resolving network stack issues."},{"function":"hb_monitor","message_template":"Heartbeat: apr_mcast_loopback failed","reason":"Logs a warning when the module fails to configure multicast loopback for the heartbeat socket. This affects whether multicast packets are received by processes on the same host.","resolution":"Check multicast network configuration on the host. May require adjusting firewall rules or network interface settings to properly support multicast traffic."},{"function":"hb_monitor","message_template":"Heartbeat: apr_socket_sendto failed","reason":"Logs a warning when the module fails to send the heartbeat packet to the configured multicast address. Could be due to network connectivity issues or incorrect multicast configuration.","resolution":"Verify network connectivity, check multicast routing configuration, and ensure the target address is reachable. May require adjusting network settings or firewall rules to allow outbound UDP multicast traffic."},{"function":"cmd_hb_address","message_template":"HeartbeatAddress: May only be specified once.","reason":"Returns an error during server configuration when the HeartbeatAddress directive is specified multiple times. The module only supports a single heartbeat destination.","resolution":"Review server configuration and ensure HeartbeatAddress is only specified once in the configuration files. Remove duplicate directives."},{"function":"cmd_hb_address","message_template":"HeartbeatAddress: Unable to parse address.","reason":"Returns an error during server configuration when the address provided to HeartbeatAddress directive cannot be parsed. The format is likely incorrect.","resolution":"Check the format of the HeartbeatAddress directive. It should be in the form 'host:port' with a valid hostname or IP address and port number."},{"function":"cmd_hb_address","message_template":"HeartbeatAddress: No host provided in address","reason":"Returns an error during server configuration when the HeartbeatAddress directive doesn't include a host portion. The directive requires both host and port.","resolution":"Modify the HeartbeatAddress directive to include a valid hostname or IP address along with the port number."},{"function":"cmd_hb_address","message_template":"HeartbeatAddress: No port provided in address","reason":"Returns an error during server configuration when the HeartbeatAddress directive doesn't include a port number. The directive requires both host and port.","resolution":"Modify the HeartbeatAddress directive to include a port number along with the hostname or IP address."},{"function":"cmd_hb_address","message_template":"HeartbeatAddress: apr_sockaddr_info_get failed.","reason":"Returns an error during server configuration when the system fails to resolve or process the provided address. This could be due to DNS resolution issues or an invalid address format.","resolution":"Verify the hostname can be resolved by DNS or is a valid IP address. Check that the address format is correct and the system's network configuration allows for proper name resolution."}],"project":"apache\/httpd"}