{"module":"mod_journald.c","summary":"This module provides an Apache error log provider that forwards log messages to systemd's journald logging service. It transforms Apache's internal log format into a structured journald format with metadata about the server and request.","logs":[{"function":"journald_log","message_template":"MESSAGE=%s","reason":"Forwards the error message string to journald as the main message content. This occurs when normal logging fails due to inability to create a memory pool.","resolution":"This is a fallback logging path and indicates memory allocation issues. Check system resources and Apache memory configuration."},{"function":"journald_log","message_template":"LOG=%s","reason":"Specifies the log name field for journald entries, providing context about which Apache log stream generated the message.","resolution":"This is informational and no resolution is required unless the log name is unexpected."},{"function":"journald_log","message_template":"PRIORITY=%i","reason":"Sets the syslog priority level for the journald entry, based on the Apache log level.","resolution":"Check if the priority level is appropriate for the type of message. High priority messages may indicate serious issues."},{"function":"journald_log","message_template":"SERVER_HOSTNAME=%s","reason":"Adds the server hostname to the journald entry for server identification in multi-server environments.","resolution":"This is informational and no resolution is required."},{"function":"journald_log","message_template":"REQUEST_HOSTNAME=%s","reason":"Adds the client hostname to the journald entry to identify the client that triggered the log event.","resolution":"This is informational and can be useful for troubleshooting client-specific issues."},{"function":"journald_log","message_template":"REQUEST_USER=%s","reason":"Adds the authenticated username to the journald entry for user-specific tracking and auditing.","resolution":"This is informational and can be useful for auditing user activity or troubleshooting user-specific issues."},{"function":"journald_log","message_template":"REQUEST_URI=%s","reason":"Adds the requested URI to the journald entry to identify which resource was being accessed.","resolution":"This is informational and can help identify problematic URLs or resources that generate errors."},{"function":"journald_log","message_template":"REQUEST_USERAGENT_IP=%s","reason":"Adds the client IP address to the journald entry for request tracking and security auditing.","resolution":"This is informational and can be useful for security monitoring and troubleshooting client-specific issues."},{"function":"journald_error_log","message_template":"MESSAGE=%s","reason":"Forwards the error message to journald when no memory pool is available (severe resource constraint).","resolution":"This fallback logging path indicates serious memory allocation issues. Check system resources, restart Apache, and review memory configuration."},{"function":"journald_error_log","message_template":"LOG=%s","reason":"Sets a hardcoded log name ('log_name') when the server's error_fname is unavailable due to resource constraints.","resolution":"This fallback logging path indicates server structure issues. Check Apache configuration and restart the server."},{"function":"journald_error_log","message_template":"PRIORITY=%i","reason":"Sets the syslog priority level for journald entry in the fallback path when no memory pool is available.","resolution":"This indicates severe resource constraints. Check system memory, Apache configuration, and consider server restart."}],"project":"apache\/httpd"}