{"module":"mod_log_forensic.c","summary":"This Apache module creates detailed forensic logs of HTTP requests for security analysis and debugging. It logs request headers before processing and marks request completion, creating a unique forensic ID that can be referenced in other logs.","logs":[{"function":"open_log","message_template":"couldn't spawn forensic log pipe %s","reason":"Logs an error when the module fails to spawn a pipe for the forensic log output. Likely due to permission issues or the specified command not being executable.","resolution":"Check that the path specified in ForensicLog directive is correct, executable, and the Apache process has permission to execute it. Check system logs for more details about the specific failure."},{"function":"open_log","message_template":"could not open forensic log file %s.","reason":"Logs an error when the module fails to open or create the forensic log file. Likely due to permission issues, disk space issues, or incorrect path.","resolution":"Verify that the directory exists and Apache has write permissions to it. Check available disk space and ensure the path specified in ForensicLog directive is correct and accessible."},{"function":"log_before","message_template":"+%s|%s[headers]","reason":"Logs the beginning of a request with a unique ID and all request headers. This is the pre-request forensic log entry.","resolution":"This is an informational log entry used for forensic analysis and doesn't require resolution. If these entries appear without corresponding '-' entries, it may indicate requests that never completed properly."},{"function":"log_after","message_template":"-%s","reason":"Logs the completion of a request using the same unique ID from the pre-request log. Marks the end of a request's forensic record.","resolution":"This is an informational log entry. If these entries appear without corresponding '+' entries, it may indicate an issue with the logging mechanism or request handling."},{"function":"log_before","message_template":"%{forensic-id}n","reason":"Not a direct log message but a placeholder that can be used in other log formats to include the forensic ID, linking forensic logs with other logs.","resolution":"This is not an error but a feature to use in custom log formats. Use this placeholder in CustomLog directives to correlate entries with forensic log records."}],"project":"apache\/httpd"}