{"module":"mod_logio.c","summary":"The logio module for Apache HTTP Server tracks and logs input\/output byte counts for HTTP requests. It provides metrics for total bytes transferred and performance measurements like time to finish upload (TTFU) and time to first byte (TTFB).","logs":[{"function":"log_bytes_in","message_template":"[numeric value representing bytes in]","reason":"Formats and outputs the number of bytes received in the current request. Used with the 'I' log format specifier.","resolution":"This is an informational metric. Unusually large values might indicate potential DoS attacks or inefficient data transfer that may require investigation."},{"function":"log_bytes_out","message_template":"[numeric value representing bytes out]","reason":"Formats and outputs the number of bytes sent in the current request. Used with the 'O' log format specifier.","resolution":"This is an informational metric. Consistently large values might indicate inefficient data compression or unnecessarily large responses that could benefit from optimization."},{"function":"log_bytes_combined","message_template":"[numeric value representing total bytes]","reason":"Formats and outputs the total number of bytes transferred (in and out) for the current request. Used with the 'S' log format specifier.","resolution":"This is an informational metric. High values may indicate resource-intensive requests that could benefit from caching or optimization."},{"function":"log_ttfu","message_template":"-","reason":"Placeholder returned when time to finish upload tracking is enabled but the metric is not available for the current request.","resolution":"If TTFU metrics are expected but not appearing, verify that LogIOTrackTTFU is set to 'ON' in the Apache configuration."},{"function":"log_ttfu","message_template":"[numeric value representing time in microseconds]","reason":"Formats and outputs the time taken to finish receiving the request payload. Used with the '^FU' log format specifier.","resolution":"This is an informational performance metric. Consistently high values may indicate client network issues or inefficient request processing that could benefit from optimization."},{"function":"log_ttfb","message_template":"-","reason":"Placeholder returned when time to first byte tracking is enabled but the metric is not available for the current request.","resolution":"If TTFB metrics are expected but not appearing, verify that LogIOTrackTTFB is set to 'ON' in the Apache configuration."},{"function":"log_ttfb","message_template":"[numeric value representing time in microseconds]","reason":"Formats and outputs the time taken to send the first byte of the response. Used with the '^FB' log format specifier.","resolution":"This is an informational performance metric. High values may indicate server processing bottlenecks that could benefit from optimization."},{"function":"logio_track_ttfu","message_template":"Set to 'ON' to enable tracking time to finish upload","reason":"Configuration help text for the LogIOTrackTTFU directive which enables\/disables tracking of time to finish upload.","resolution":"This is a configuration description. To enable TTFU tracking, set 'LogIOTrackTTFU ON' in your Apache configuration."},{"function":"logio_track_ttfb","message_template":"Set to 'ON' to enable tracking time to first byte","reason":"Configuration help text for the LogIOTrackTTFB directive which enables\/disables tracking of time to first byte.","resolution":"This is a configuration description. To enable TTFB tracking, set 'LogIOTrackTTFB ON' in your Apache configuration."}],"project":"apache\/httpd"}