{"module":"syslog.c","summary":"This Apache module provides a syslog-based error logging provider for the Apache HTTP Server. It allows Apache to send its error logs to the system's syslog facility with configurable parameters for facility, tag, and log level.","logs":[{"function":"syslog_error_log_init","message_template":"Default syslog configuration","reason":"Initializes syslog connection with default configuration (LOG_LOCAL7) when no specific facility is provided","resolution":"This is an informational action. If you need a different syslog facility, specify it in the ErrorLog directive using the 'syslog:facility:tag' format."},{"function":"syslog_error_log_init","message_template":"Custom tag syslog configuration","reason":"Initializes syslog connection with a custom tag but default facility (LOG_LOCAL7)","resolution":"This is an informational action. If default LOG_LOCAL7 facility is not appropriate, specify a different facility in the ErrorLog directive."},{"function":"syslog_error_log_init","message_template":"Custom facility syslog configuration","reason":"Initializes syslog connection with a custom facility and tag as specified in the configuration","resolution":"This is an informational action. No resolution required unless the system's syslog configuration doesn't allow the specified facility."},{"function":"syslog_error_log_init","message_template":"Invalid facility name","reason":"Returns NULL (failure) when an invalid syslog facility name is provided in the configuration","resolution":"Check your ErrorLog directive and ensure you've specified a valid syslog facility name. Valid facilities include: auth, authpriv, cron, daemon, ftp, kern, lpr, mail, news, syslog, user, uucp, and local0-7."},{"function":"syslog_error_log","message_template":"%.*s","reason":"Logs an error message to syslog with the appropriate level","resolution":"This is the core logging functionality. The actual error message and its resolution will depend on the specific error being logged by Apache."},{"function":"syslog_error_log_parse","message_template":"When using syslog error log provider, ","reason":"Returns an error when the syslog directive is used outside of global context","resolution":"Move your syslog ErrorLog directive to the global server configuration context. Syslog logging cannot be configured at directory or location level."}],"project":"apache\/httpd"}