{"module":"mod_log_config.c","summary":"This module implements logging functionality for Apache HTTP Server. It handles configuration directives for logging, parses log format strings, and writes log entries to files or pipes based on the configured format, with support for conditional logging.","logs":[{"function":"config_log_transaction","message_template":"Error evaluating log condition: %s","reason":"An error occurred while evaluating a conditional expression that determines whether to log a request. This often happens when the condition syntax is incorrect or contains references to undefined variables.","resolution":"Check the syntax of your conditional expression in the CustomLog directive. Make sure all variables referenced in the expression are properly defined."},{"function":"config_log_transaction","message_template":"log writer isn't correctly setup","reason":"The log writer function is not properly initialized. This is an internal error that indicates the logging system is not properly configured.","resolution":"Check your Apache configuration for any issues with logging directives. Restart Apache and check if the error persists. This may require consulting the Apache error logs for additional information."},{"function":"config_log_transaction","message_template":"Error writing to %s","reason":"Failed to write to the specified log file. This could be due to permission issues, disk full conditions, or other I\/O problems.","resolution":"Check file permissions, available disk space, and ensure Apache has write access to the log file and its directory. Also verify that no other process has locked the file."},{"function":"init_child","message_template":"could not initialize buffered log mutex, transfer log may become corrupted","reason":"Failed to create a mutex for synchronizing access to buffered logs in a multi-threaded environment. This can lead to corrupted log files when multiple threads write simultaneously.","resolution":"This is usually due to system resource limitations. Consider disabling buffered logging by setting 'BufferedLogs off', or investigate system-level mutex limitations and increase available resources."},{"function":"parse_log_item","message_template":"Unrecognized LogFormat directive %","reason":"The LogFormat string contains an unrecognized directive. This often happens when using a percent sign followed by an unknown character.","resolution":"Check your LogFormat directives for invalid format specifiers. Refer to the Apache documentation for a list of valid format specifiers."},{"function":"parse_log_item","message_template":"Ran off end of LogFormat parsing args to some directive","reason":"The LogFormat string ended unexpectedly while parsing a directive. This could happen if a format specifier like %{...} is not properly closed.","resolution":"Check your LogFormat directives for syntax errors, particularly ensuring that all opening braces '{' have matching closing braces '}'."},{"function":"ap_default_log_writer_init","message_template":"invalid transfer log path %s.","reason":"The specified path for a log file is invalid. This could be due to incorrect path syntax or using a path that is not relative to the server root.","resolution":"Ensure the log file path is valid and either absolute or correctly specified relative to the ServerRoot directive. Check for spelling errors or illegal characters in the path."},{"function":"ap_default_log_writer_init","message_template":"could not open transfer log file %s.","reason":"Failed to open the specified log file for writing. This is commonly due to permission issues or non-existent directories in the path.","resolution":"Verify that the directories in the log file path exist and that Apache has permission to write to the file. Create any missing directories and adjust permissions as needed."},{"function":"check_log_dir","message_template":"Cannot access directory '%s' for log file '%s' defined at %s:%d","reason":"The directory specified for a log file either doesn't exist or Apache doesn't have permission to access it. This check occurs during server startup.","resolution":"Ensure the directory exists and has appropriate permissions for the Apache process. If the directory doesn't exist, create it. If it exists, check ownership and permissions."}],"project":"apache\/httpd"}