{"module":"mod_macro.c","summary":"Implements Apache's mod_macro module, which provides macro capabilities for Apache configuration files. It allows users to define reusable configuration snippets with parameterized values, supporting macro definition, usage, and undefining operations.","logs":[{"function":"warn_if_non_blank","message_template":"%s on line %d of %s: %s","reason":"Warns about non-blank characters appearing in places where they should not be, such as after directive closings","resolution":"Remove any non-blank characters after directive closings. Comments beginning with # are allowed."},{"function":"get_lines_till_end_token","message_template":"bad (negative) nesting on line %d of %s","reason":"Warns when closing tags appear without matching opening tags, resulting in negative nesting level","resolution":"Ensure that each closing tag has a corresponding opening tag. Check configuration file structure for proper nesting."},{"function":"get_lines_till_end_token","message_template":"end directive missing closing '>'","reason":"Error when an end directive is missing its closing bracket","resolution":"Add the missing '>' character to properly close the directive."},{"function":"get_lines_till_end_token","message_template":"non blank chars found after directive closing","reason":"Warns when non-blank characters are found after a directive's closing bracket","resolution":"Remove any characters after the closing bracket or convert them to a comment by prefixing with #."},{"function":"get_lines_till_end_token","message_template":"bad cumulated nesting (%+d) in %s","reason":"Warns when the overall nesting count is non-zero at the end of processing, indicating mismatched opening\/closing tags","resolution":"Check the configuration file for proper nesting of directives. Ensure each opening tag has a matching closing tag."},{"function":"get_lines_till_end_token","message_template":"expected token not found: %s","reason":"Error when a required end token is not found in the configuration","resolution":"Add the missing end token. This often occurs when a closing tag like <\/Macro> is missing."},{"function":"check_macro_arguments","message_template":"macro '%s' (%s): empty argument #%d name","reason":"Error when a macro argument name is empty","resolution":"Provide a non-empty name for each macro argument."},{"function":"check_macro_arguments","message_template":"macro '%s' (%s) argument name '%s' (#%d) without expected prefix, better prefix argument names with one of '%s'.","reason":"Warning when a macro argument name doesn't start with one of the expected prefixes ($, %, @)","resolution":"Prefix argument names with one of the suggested characters ($, %, @) to clearly indicate they are arguments."},{"function":"check_macro_arguments","message_template":"macro '%s' (%s) argument name '%s' (#%d) clashes with 'Define' syntax '${...}', better use '$(...)'.","reason":"Warning when a macro argument uses ${...} syntax which could clash with Apache's Define syntax","resolution":"Use $(...) syntax instead of ${...} for macro arguments to avoid conflicts with Apache's Define directive."},{"function":"check_macro_arguments","message_template":"argument name conflict in macro '%s' (%s): argument '%s': #%d and #%d, change argument names!","reason":"Error when a macro has two arguments with the same name","resolution":"Ensure each argument has a unique name within the macro definition."},{"function":"check_macro_arguments","message_template":"macro '%s' (%s): argument name prefix conflict (%s #%d and %s #%d), be careful about your macro definition!","reason":"Warning when two macro arguments have the same prefix, which could lead to substitution issues","resolution":"Use more distinctive argument names to avoid potential substitution conflicts."},{"function":"check_macro_use_arguments","message_template":"%s: empty argument #%d","reason":"Warning when a macro is used with an empty argument","resolution":"Provide non-empty values for all arguments or consider enabling MacroIgnoreEmptyArgs if empty arguments are intentional."},{"function":"substitute","message_template":"cannot substitute, buffer size too small","reason":"Error when substitution buffer is too small to hold the result","resolution":"This is an internal error. Try simplifying the macro or reducing the size of argument values."},{"function":"process_content","message_template":"while processing line %d of macro '%s' (%s) %s","reason":"Error occurring during macro content processing, with additional details provided in the message","resolution":"Check the specific error details and fix the corresponding issue in the macro definition."},{"function":"process_content","message_template":"macro too long","reason":"Error when a macro exceeds the maximum allowed length","resolution":"Reduce the size of the macro by breaking it into smaller macros or simplifying its contents."},{"function":"check_macro_contents","message_template":"macro '%s' (%s): empty contents!","reason":"Warning when a macro definition has no content","resolution":"Add content to the macro or remove the empty macro definition if not needed."},{"function":"check_macro_contents","message_template":"macro '%s' (%s): argument '%s' (#%d) never used","reason":"Warning when a defined macro argument is never used in the macro body","resolution":"Either use the argument in the macro body or remove it from the argument list."},{"function":"macro_section","message_template":"BEGIN_MACRO > directive missing closing '>'","reason":"Error when a <Macro> directive is missing its closing bracket","resolution":"Add the missing '>' character to properly close the <Macro> directive."},{"function":"macro_section","message_template":"BEGIN_MACRO macro definition: empty name","reason":"Error when a macro definition has an empty name","resolution":"Provide a non-empty name for the macro."},{"function":"macro_section","message_template":"non blank chars found after BEGIN_MACRO closing '>'","reason":"Warning when there are non-blank characters after the closing of a <Macro> tag","resolution":"Remove any characters after the closing bracket or convert them to a comment by prefixing with #."},{"function":"macro_section","message_template":"BEGIN_MACRO macro definition: name not found","reason":"Error when a macro definition doesn't specify a name","resolution":"Add a name to the macro definition, e.g., <Macro name ...>."},{"function":"macro_section","message_template":"macro '%s' multiply defined: %s, redefined on line %d of \"%s\"","reason":"Warning when a macro is defined more than once, with the new definition overriding the previous one","resolution":"Ensure each macro has a unique name or remove\/rename duplicate definitions."},{"function":"macro_section","message_template":"%s better prefix a macro name with any of '%s'","reason":"Warning when a macro name appears to be an argument (starts with $, %, or @)","resolution":"Choose a different macro name that doesn't start with argument prefix characters."},{"function":"macro_section","message_template":"%s: unknown flag '%s'","reason":"Warning when an unknown flag is specified in a macro definition","resolution":"Remove or correct the unknown flag. Valid flags are \/IgnoreEmptyArgs and \/IgnoreBadNesting."},{"function":"macro_section","message_template":"%s\n\tcontents error: %s","reason":"Error in macro contents, with specific details provided","resolution":"Check the error details and fix the corresponding issue in the macro definition."},{"function":"macro_section","message_template":"%s\n\tcontents checking error: %s","reason":"Error when checking macro contents, with specific details provided","resolution":"Check the error details and fix the corresponding issue in the macro definition."},{"function":"use_macro","message_template":"no macro defined before USE_MACRO","reason":"Error when trying to use a macro before any macros have been defined","resolution":"Define at least one macro using <Macro> before using the Use directive."},{"function":"use_macro","message_template":"no macro name specified with USE_MACRO","reason":"Error when the Use directive doesn't specify which macro to use","resolution":"Specify a macro name with the Use directive, e.g., 'Use macro_name'."},{"function":"use_macro","message_template":"macro '%s' undefined","reason":"Error when trying to use a macro that hasn't been defined","resolution":"Define the macro using <Macro> before using it, or check for typos in the macro name."},{"function":"use_macro","message_template":"recursive use of macro '%s' is invalid","reason":"Error when a macro attempts to use itself, either directly or indirectly","resolution":"Restructure your macros to avoid recursion, which is not supported."},{"function":"use_macro","message_template":"macro '%s' (%s) used with %d arguments instead of %d","reason":"Error when a macro is used with the wrong number of arguments","resolution":"Provide exactly the number of arguments expected by the macro."},{"function":"use_macro","message_template":"%s error while substituting: %s","reason":"Error during macro substitution, with specific details provided","resolution":"Check the error details and fix the corresponding issue in the macro usage."},{"function":"undef_macro","message_template":"no macro defined before UNDEF_MACRO","reason":"Error when trying to undefine a macro before any macros have been defined","resolution":"Define at least one macro using <Macro> before using the UndefMacro directive."},{"function":"undef_macro","message_template":"no macro name specified with UNDEF_MACRO","reason":"Error when the UndefMacro directive doesn't specify which macro to undefine","resolution":"Specify a macro name with the UndefMacro directive, e.g., 'UndefMacro macro_name'."},{"function":"undef_macro","message_template":"cannot remove undefined macro '%s'","reason":"Error when trying to undefine a macro that hasn't been defined","resolution":"Check for typos in the macro name or verify that the macro was defined earlier in the configuration."}],"project":"apache\/httpd"}