{"module":"mod_watchdog.c","summary":"The watchdog module implements a service that runs background threads to monitor the health and activity of the Apache server. It provides a framework for creating both parent process and child process watchdog threads that can execute callbacks at specified intervals or run hooks to perform regular maintenance tasks.","logs":[{"function":"wd_worker","message_template":"%sWatchdog (%s) running","reason":"Logs when a watchdog thread has successfully started and is now running. The first parameter indicates if it's a singleton watchdog, and the second parameter is the watchdog name.","resolution":"Informational log, no resolution required. This confirms normal operation of a watchdog thread."},{"function":"wd_worker","message_template":"%sWatchdog (%s) stopping","reason":"Logs when a watchdog thread is in the process of shutting down gracefully. The first parameter indicates if it's a singleton watchdog, and the second parameter is the watchdog name.","resolution":"Informational log, no resolution required. This indicates normal shutdown of a watchdog thread."},{"function":"wd_post_config_hook","message_template":"Watchdog: Running with WatchdogInterval %APR_TIME_T_FMT ms","reason":"Logs the configured watchdog interval in milliseconds during server initialization.","resolution":"Informational log, no resolution required. If the interval seems inappropriate for your needs, adjust the WatchdogInterval directive in your configuration."},{"function":"wd_post_config_hook","message_template":"Watchdog: found parent providers.","reason":"Logs that the watchdog module found registered parent process providers during initialization.","resolution":"Informational log, no resolution required. This indicates that parent watchdog providers are available."},{"function":"wd_post_config_hook","message_template":"Watchdog: Looking for parent (%s).","reason":"Logs that the watchdog module is looking for a specific parent provider by name.","resolution":"Informational log, no resolution required. This is part of the normal initialization process."},{"function":"wd_post_config_hook","message_template":"Watchdog: Failed to create parent worker thread.","reason":"Logs an error when the watchdog module fails to create a thread for a parent watchdog. This could indicate resource issues or configuration problems.","resolution":"Check system resources (memory, thread limits) and server configuration. This error prevents the parent watchdog from functioning properly. Look at the error code for more specific information about why thread creation failed."},{"function":"wd_post_config_hook","message_template":"Watchdog: Created parent worker thread (%s).","reason":"Logs successful creation of a parent watchdog thread with the given name.","resolution":"Informational log, no resolution required. This confirms successful creation of a parent watchdog thread."},{"function":"wd_post_config_hook","message_template":"Spawned %d parent worker threads.","reason":"Logs the total number of parent watchdog worker threads that were successfully created during initialization.","resolution":"Informational log, no resolution required. This summarizes the parent watchdog thread creation."},{"function":"wd_post_config_hook","message_template":"Watchdog: found child providers.","reason":"Logs that the watchdog module found registered child process providers during initialization.","resolution":"Informational log, no resolution required. This indicates that child watchdog providers are available."},{"function":"wd_post_config_hook","message_template":"Watchdog: Looking for child (%s).","reason":"Logs that the watchdog module is looking for a specific child provider by name.","resolution":"Informational log, no resolution required. This is part of the normal initialization process."},{"function":"wd_post_config_hook","message_template":"Watchdog: Failed to create singleton mutex.","reason":"Logs an error when the watchdog module fails to create a mutex for a singleton watchdog. This prevents proper synchronization between child processes.","resolution":"Check system resources and permissions. This error could indicate issues with system limits, file permissions for mutex files, or other system-level problems. The singleton watchdog will not function correctly without this mutex."},{"function":"wd_post_config_hook","message_template":"Watchdog: Created singleton mutex (%s).","reason":"Logs successful creation of a mutex for a singleton watchdog with the given name.","resolution":"Informational log, no resolution required. This confirms successful creation of a singleton mutex."},{"function":"wd_child_init_hook","message_template":"Watchdog: nothing configured?","reason":"Logs a warning that no watchdog workers are configured, which means the watchdog module is loaded but not actively doing anything.","resolution":"If watchdog functionality is needed, check your configuration to ensure the appropriate modules that use watchdog are enabled and properly configured. Otherwise, this can be ignored."},{"function":"wd_child_init_hook","message_template":"Watchdog: Failed to create child worker thread.","reason":"Logs an error when the watchdog module fails to create a thread for a child watchdog. This could indicate resource issues or configuration problems.","resolution":"Check system resources (memory, thread limits) and server configuration. This error prevents the child watchdog from functioning properly. Look at the error code for more specific information about why thread creation failed."},{"function":"wd_child_init_hook","message_template":"Watchdog: Created child worker thread (%s).","reason":"Logs successful creation of a child watchdog thread with the given name.","resolution":"Informational log, no resolution required. This confirms successful creation of a child watchdog thread."},{"function":"wd_child_stopping","message_template":"child stopping graceful=%d","reason":"Logs that a child process is stopping, with a flag indicating whether the shutdown is graceful or immediate.","resolution":"Informational log, no resolution required. This is part of the normal shutdown process."},{"function":"wd_child_stopped","message_template":"child stopped, joining watchdog threads","reason":"Logs that a child process has stopped and is now waiting for watchdog threads to terminate.","resolution":"Informational log, no resolution required. This is part of the normal shutdown process."},{"function":"wd_child_stopped","message_template":"%sWatchdog (%s) stopping now","reason":"Logs that a specific watchdog is being stopped as part of child process shutdown.","resolution":"Informational log, no resolution required. This is part of the normal shutdown process."},{"function":"wd_child_stopped","message_template":"child stopped, watchdogs stopped","reason":"Logs that all watchdog threads in a child process have been successfully stopped.","resolution":"Informational log, no resolution required. This confirms successful shutdown of watchdog threads."},{"function":"wd_cmd_watchdog_int","message_template":"Unparse-able WatchdogInterval setting","reason":"Logs an error when the WatchdogInterval directive contains a value that cannot be parsed as a valid time interval.","resolution":"Check the WatchdogInterval directive in your configuration. It should be a number followed by a time unit (e.g., '10s' for 10 seconds). Fix the directive to use a valid time specification."},{"function":"wd_cmd_watchdog_int","message_template":"Invalid WatchdogInterval: minimal value %APR_TIME_T_FMT ms","reason":"Logs an error when the WatchdogInterval directive contains a value that is smaller than the minimum allowed interval.","resolution":"The WatchdogInterval directive in your configuration is too small. Increase it to at least the minimum value shown in the error message (typically a few milliseconds)."}],"project":"apache\/httpd"}