{"module":"http_request.c","summary":"This module handles the processing of HTTP requests, including error handling, internal redirects, and request lifecycle management. It provides mechanisms for handling response status, custom error pages, and filter chain management.","logs":[{"function":"ap_die_r","message_template":"Invalid response status %i","reason":"Logs when an invalid HTTP response status code is passed to ap_die_r. This typically happens when a module returns an undefined status code.","resolution":"Check module code that sets status codes to ensure they conform to standard HTTP status codes or are properly defined custom codes."},{"function":"ap_die_r","message_template":"Response from AP_FILTER_ERROR","reason":"Indicates a filter chain returned AP_FILTER_ERROR status, signaling a problem in the filter processing chain.","resolution":"Check filter configurations and any custom filters. Look for log messages from individual filters for more specific error information."},{"function":"ap_die_r","message_template":"Invalid error redirection directive: %s","reason":"A custom ErrorDocument directive was specified with an invalid URL or path format.","resolution":"Check ErrorDocument directives in configuration files. Ensure they point to valid absolute URLs, valid local paths (starting with \/), or quoted text messages."},{"function":"ap_check_pipeline","message_template":"Can't consume pipelined empty lines","reason":"An unexpected error occurred while consuming empty lines in pipelined HTTP requests. This may indicate a client disconnection or network issue.","resolution":"Check client connectivity and network stability. May require no action as Apache will close the connection and recover."},{"function":"ap_check_pipeline","message_template":"Can't check pipelined data","reason":"Apache failed to properly check data in a pipelined request, potentially due to a malformed request or connection issue.","resolution":"This could indicate client issues or network problems. Check network connectivity and client behavior. Apache will handle this by closing the connection in serious cases."},{"function":"ap_process_async_request","message_template":"Headers received from client:","reason":"Debug-level log entry showing the beginning of a headers dump for debugging purposes.","resolution":"Information log only, no resolution required. Useful for debugging request issues."},{"function":"ap_process_async_request","message_template":"  %s: %s","reason":"Debug-level log showing individual header name and value pairs received from the client.","resolution":"Information log only, no resolution required. Used for debugging request headers."},{"function":"ap_process_request","message_template":"flushing data to the client","reason":"Indicates a timeout occurred while trying to flush buffered data to the client. This may indicate slow client connections or network issues.","resolution":"Check network latency and client connection speeds. Consider adjusting timeout settings if this occurs frequently with legitimate clients."},{"function":"ap_internal_fast_redirect","message_template":"dropping filter '%s' in internal redirect from %s to %s","reason":"During an internal redirect, Apache is removing a filter that is specific to the original request and shouldn't be applied to the new request.","resolution":"Information log only, no resolution required. If filter problems occur with redirects, this log can help identify which filters are being dropped."}],"project":"apache\/httpd"}