{"module":"http_filter.c","summary":"This module implements HTTP\/1.x protocol filtering in Apache, handling request and response processing including chunked transfer encoding, header validation, body processing, and error handling. It serves as a critical component in the HTTP request-response pipeline.","logs":[{"function":"read_chunked_trailers","message_template":"Error while reading HTTP trailer: %i%s%s","reason":"Logs when there's an error processing the trailers section of a chunked-encoded HTTP request or response","resolution":"Check for malformed trailers in the request. May require changes to the client application sending improperly formatted chunked encoding trailers."},{"function":"ap_http_filter","message_template":"ap_http_in_filter: status != OK, not sending 100-continue","reason":"Indicates that the server won't send a 100-continue response because the request's status is not OK","resolution":"This is informational. The server is correctly handling the protocol and denying 100-continue for non-successful requests."},{"function":"ap_http_filter","message_template":"ap_http_in_filter: sending 100-continue","reason":"The server is sending a 100-continue response to a client that expects it","resolution":"This is informational. Server is correctly handling the HTTP\/1.1 Expect: 100-continue header."},{"function":"ap_http_filter","message_template":"request body already\/partly received while 100-continue is expected, omit sending interim response","reason":"The server has already received request body data while an Expect: 100-continue header was present, so it will not send the interim response","resolution":"This is informational. The client started sending the body before receiving 100-continue, which is allowed by the HTTP spec."},{"function":"ap_h1_body_in_filter","message_template":"Unknown Transfer-Encoding: %s; using read-until-close","reason":"The server received a response with an unsupported Transfer-Encoding header and will fall back to reading until connection close","resolution":"This typically occurs in proxy scenarios. Check the upstream server's configuration to ensure it's using standard transfer encodings like 'chunked'."},{"function":"ap_h1_body_in_filter","message_template":"Unknown Transfer-Encoding: %s","reason":"The server received a request with an unsupported Transfer-Encoding header","resolution":"Client is using a non-standard transfer encoding. Update the client to use standard transfer encodings as defined in HTTP\/1.1."},{"function":"ap_h1_body_in_filter","message_template":"Invalid Content-Length","reason":"The Content-Length header contains an invalid value that cannot be parsed","resolution":"The client sent a malformed Content-Length header. Check and fix the client code to send a valid numeric value."},{"function":"ap_h1_body_in_filter","message_template":"Requested content-length of %\" APR_OFF_T_FMT\" is larger than the configured limit of %\" APR_OFF_T_FMT","reason":"The request's Content-Length exceeds the server's configured maximum request body size limit","resolution":"Either increase the LimitRequestBody directive in the server configuration or reduce the size of the request body being sent."},{"function":"ap_h1_body_in_filter","message_template":"Error reading\/parsing chunk %s (overflow)","reason":"Error occurred while reading or parsing a chunk in chunked transfer encoding, possibly due to chunk size being too large","resolution":"This could indicate a malformed chunked encoding from the client or possibly an attempted attack. Check the client implementation for compliance with HTTP chunked encoding format."},{"function":"ap_h1_body_in_filter","message_template":"Read content length of %\" APR_OFF_T_FMT\" is larger than the configured limit of %\" APR_OFF_T_FMT","reason":"While reading the request body, the server detected that the actual size exceeds the configured limit","resolution":"Either increase the LimitRequestBody directive in the server configuration or reduce the size of the request body being sent."},{"function":"ap_h1_body_in_filter","message_template":"Unexpected body state (%i)","reason":"The HTTP body processing reached an unexpected state, indicating a possible internal error","resolution":"This suggests a potential bug in the server or an edge case in processing. If reproducible, file a bug report with the Apache HTTP Server project."},{"function":"check_header","message_template":"Empty response header name, aborting request","reason":"The server attempted to send a response with an empty header name","resolution":"This indicates a bug in the server or a module. Check custom modules that might be manipulating response headers incorrectly."},{"function":"check_header","message_template":"Response header name '%s' contains invalid characters, aborting request","reason":"A response header name contains characters not allowed by the HTTP specification","resolution":"Check for modules that might be setting improper header names. Header names must contain only valid HTTP token characters."},{"function":"check_header","message_template":"Response header '%s' value of '%s' contains invalid characters, aborting request","reason":"A response header value contains characters not allowed by the HTTP specification","resolution":"Inspect modules that are setting response headers to ensure they're properly validating header values according to HTTP syntax rules."},{"function":"ap_send_http_trace","message_template":"TRACE denied by server configuration","reason":"The HTTP TRACE method was requested but is disabled in the server configuration","resolution":"This is a security measure. TRACE is often disabled to prevent cross-site tracing attacks. If you need TRACE for debugging, you can enable it by setting 'TraceEnable On' in the server configuration."},{"function":"ap_send_http_trace","message_template":"TRACE with a request body is not allowed","reason":"The HTTP TRACE request included a body, which is not allowed for security reasons","resolution":"The client should not send a body with TRACE requests. Modify the client to send TRACE requests without a body."},{"function":"ap_send_http_trace","message_template":"Extended TRACE request bodies cannot exceed 64k","reason":"The HTTP TRACE request included a body that exceeds the maximum allowed size of 64K","resolution":"The client should reduce the size of the TRACE request body or preferably not send a body with TRACE requests."},{"function":"ap_http_header_filter","message_template":"ap_http_header_filter prep response status %d","reason":"Debug log indicating that the HTTP header filter is preparing a response with the given status code","resolution":"This is an informational log for debugging purposes. No action required."},{"function":"ap_http_header_filter","message_template":"ap_http_header_filter error bucket, should die with status=%d but final response already underway","reason":"An error occurred but headers have already been sent, so the server can't properly report the error","resolution":"This indicates a potentially serious issue where an error occurred after response headers were sent. Check module code that might be triggering late errors."},{"function":"ap_http_header_filter","message_template":"ap_http_header_filter error bucket, die with %d and error","reason":"The header filter encountered an error bucket and will respond with the specified error status","resolution":"This is trace information about error handling. The actual error's cause should be investigated in other log messages."},{"function":"ap_discard_request_body","message_template":"indeterminate request body length forbidden: %s","reason":"A request with indeterminate body length (like chunked encoding) was rejected because the handler requires a known length","resolution":"The client should send requests with a Content-Length header rather than using chunked encoding for this specific URI."},{"function":"ap_discard_request_body","message_template":"Invalid Content-Length '%s'","reason":"The Content-Length header has an invalid value that can't be parsed as a positive number","resolution":"Fix the client to send a valid numeric Content-Length header value."},{"function":"ap_discard_request_body","message_template":"%s with body is not allowed for %s","reason":"The request method is not allowed to have a body for the requested URI","resolution":"Modify the client to not send a body with this method for this URI, or change the server configuration to allow bodies for this method\/URI combination."},{"function":"ap_discard_request_body","message_template":"Requested content-length of %\" APR_OFF_T_FMT\" is larger than the configured limit of %\" APR_OFF_T_FMT","reason":"The request's Content-Length exceeds the server's configured maximum request body size limit","resolution":"Either increase the LimitRequestBody directive in the server configuration or reduce the size of the request body being sent."},{"function":"ap_basic_http_header","message_template":"Error while writing error response","reason":"The server encountered an error while trying to send an error response to the client","resolution":"This typically occurs when the client connection is broken. Check network connectivity and client behavior."},{"function":"ap_h1_response_out_filter","message_template":"ap_h1_response_out_filter seeing response bucket status=%d","reason":"Debug log showing that the response filter is processing a response with the given status code","resolution":"This is an informational trace log. No action required."},{"function":"ap_h1_response_out_filter","message_template":"ap_h1_response_out_filter seeing headers status=%d in strict mode","reason":"The response filter detected an invalid HTTP status code (below 100) in strict mode","resolution":"This indicates a bug in a module that's generating invalid HTTP status codes. Check custom modules that might be setting improper status codes."},{"function":"ap_h1_response_out_filter","message_template":"ap_h1_response_out_filter seeing headers status=%d after final response already sent","reason":"The server tried to send additional headers after the final response headers were already sent","resolution":"This indicates a bug in a module that's attempting to send multiple responses. Check request handling logic in custom modules."},{"function":"ap_h1_response_out_filter","message_template":"ap_h1_response_out_filter passed response, add CHUNK filter","reason":"Debug log indicating that chunked encoding filter is being added to the response","resolution":"This is an informational trace log. No action required."},{"function":"ap_h1_response_out_filter","message_template":"ap_h1_response_out_filter seeing data before headers, %ld bytes","reason":"The filter received data buckets before seeing the response headers, which is an error","resolution":"This indicates a bug in a module that's generating content before setting response headers. Check module code to ensure headers are set before writing response body."},{"function":"ap_h1_request_in_filter","message_template":"request failed: error reading the headers","reason":"The server encountered an error while reading the request headers","resolution":"This could be caused by malformed headers from the client or network issues. Check client implementation for compliance with HTTP header format."},{"function":"ap_h1_request_in_filter","message_template":"http1 request and headers parsed: %s %s %s","reason":"Debug log showing that the HTTP\/1.x request and headers have been successfully parsed","resolution":"This is an informational trace log. No action required."},{"function":"ap_h1_request_in_filter","message_template":"failed reading request line, returning error bucket %d","reason":"The server failed to read the HTTP request line and is returning an error","resolution":"This could be caused by an invalid request line, a timeout, or other client issues. Check client implementation for compliance with HTTP request format."},{"function":"ap_http_header_filter","message_template":"Response sent with status %d%s","reason":"Logs the HTTP status code of the response being sent","resolution":"This is an informational trace log. No action required."},{"function":"ap_h1_body_in_filter","message_template":"sending trailers","reason":"Debug log indicating that the filter is sending HTTP trailers","resolution":"This is an informational trace log. No action required."}],"project":"apache\/httpd"}