{"module":"http_protocol.c","summary":"This module contains core HTTP protocol handling routines for Apache HTTP Server, including handling of HTTP requests\/responses, status codes, error messages, and protocol conformance. It serves as the foundation for communication between clients and the server.","logs":[{"function":"is_mpm_running","message_template":"MPM is in stopping state","reason":"Logs when checking if the Multi-Processing Module (MPM) is running reveals it's in a stopping state","resolution":"This is normal during server shutdown. If seen during normal operation, investigate if the server is being signaled to stop or if there's an issue with the MPM."},{"function":"ap_method_register","message_template":"Maximum new request methods %d reached while registering method %s.","reason":"The server has reached the maximum number of custom HTTP methods that can be registered","resolution":"Review custom method registrations. Consider removing unnecessary custom methods or modifying code to use standard HTTP methods instead."},{"function":"ap_h1_add_end_chunk","message_template":"append empty end chunk","reason":"Debug trace when adding an empty end chunk to a chunked HTTP response","resolution":"Informational log, no resolution required. Useful for debugging chunked transfer encoding issues."},{"function":"ap_h1_add_end_chunk","message_template":"append end chunk with trailers","reason":"Debug trace when adding an end chunk with trailers to a chunked HTTP response","resolution":"Informational log, no resolution required. Useful for debugging chunked transfer encoding issues."},{"function":"rrl_log_error","message_template":"HTTP Request Line; Unrecognized protocol '%.*s' (perhaps whitespace was injected?)","reason":"The HTTP protocol version in the request line couldn't be recognized, possibly due to injection of whitespace","resolution":"Check for malformed requests or possible HTTP protocol attacks. May indicate a client using a non-standard HTTP implementation or a security probe."},{"function":"rrl_log_error","message_template":"HTTP Request Line; Invalid method token: '%.*s'","reason":"The HTTP method in the request line contains invalid characters","resolution":"Check for malformed requests or possible HTTP protocol attacks. Client may be using a non-standard HTTP method name."},{"function":"rrl_log_error","message_template":"HTTP Request Line; Invalid whitespace","reason":"The HTTP request line contains whitespace in invalid positions","resolution":"Check for malformed requests. Client may be using a non-compliant HTTP implementation or this could indicate a protocol-level attack."},{"function":"rrl_log_error","message_template":"HTTP Request Line; Excess whitespace (disallowed by HttpProtocolOptions Strict)","reason":"The HTTP request line contains extra whitespace which is disallowed when using strict HTTP protocol conformance","resolution":"If this occurs frequently, consider changing HttpProtocolOptions from Strict if backwards compatibility with non-conformant clients is needed."},{"function":"rrl_log_error","message_template":"HTTP Request Line; Missing URI","reason":"The HTTP request line is missing the URI portion","resolution":"Check for malformed requests. Client is sending invalid HTTP requests missing the required URI component."},{"function":"rrl_log_error","message_template":"HTTP Request Line; URI incorrectly encoded: '%.*s'","reason":"The URI in the HTTP request line is improperly encoded","resolution":"Check for malformed requests. Client may be using improper URL encoding or sending invalid characters in the URL."},{"function":"rrl_log_error","message_template":"HTTP Request Line; Extraneous text found '%.*s' (perhaps whitespace was injected?)","reason":"The HTTP request line contains unexpected extra text after what should be the end","resolution":"Check for malformed requests or possible HTTP protocol attacks. May indicate a client using a non-standard HTTP implementation or a security probe."},{"function":"ap_h1_tokenize_request_line","message_template":"ap_tokenize_request_line: '%s'","reason":"Debug trace logging the raw HTTP request line before tokenization","resolution":"Informational log, no resolution required. Useful for debugging HTTP request parsing issues."},{"function":"ap_h1_tokenize_request_line","message_template":"ap_tokenize_request: error=%d, method=%s, uri=%s, protocol=%s","reason":"Debug trace showing the result of tokenizing an HTTP request line","resolution":"Informational log, no resolution required. Useful for debugging HTTP request parsing issues."},{"function":"ap_send_error_response","message_template":"Server timeout waiting for the HTTP request from the client.","reason":"The server timed out waiting for the client to send a complete HTTP request","resolution":"Check network connectivity issues between client and server. May indicate slow client connections or clients not completing requests."},{"function":"ap_send_error_response","message_template":"The requested URL was not found on this server.","reason":"Server received a request for a URL that doesn't exist (404 Not Found)","resolution":"Verify the requested URL is correct. Check server configuration and ensure the resource exists at the specified location."},{"function":"ap_send_error_response","message_template":"The server encountered an internal error or misconfiguration and was unable to complete your request.","reason":"An internal server error occurred (500 Internal Server Error)","resolution":"Check server error logs for detailed information. May require fixing server configuration, permissions, or application code."},{"function":"ap_send_error_response","message_template":"The requested method %s is not allowed for this URL.","reason":"Client tried to use an HTTP method that's not allowed for the requested resource (405 Method Not Allowed)","resolution":"Check which methods are allowed for the resource and use one of those instead. Server configuration may need adjustment if the method should be allowed."},{"function":"ap_send_error_response","message_template":"You don't have permission to access this resource.","reason":"Client doesn't have permission to access the requested resource (403 Forbidden)","resolution":"Check file permissions, .htaccess rules, and authentication requirements. Client may need proper credentials or different permissions."},{"function":"ap_send_error_response","message_template":"The server is temporarily unable to service your request due to maintenance downtime or capacity problems. Please try again later.","reason":"The server is temporarily unavailable (503 Service Unavailable)","resolution":"Wait and retry later. If persistent, check server load, resource usage, and maintenance status. May require scaling server resources."},{"function":"ap_send_error_response","message_template":"Access to this URL has been denied for legal reasons.","reason":"Access to the resource is denied for legal reasons (451 Unavailable For Legal Reasons)","resolution":"Content is blocked due to legal requirements. Contact site administrators for more information about the legal restrictions."},{"function":"ap_send_error_response","message_template":"The user has sent too many requests in a given amount of time.","reason":"Client has sent too many requests in a short time period (429 Too Many Requests)","resolution":"Implement rate limiting on client side or reduce request frequency. Wait before retrying and consider adding delays between requests."},{"function":"ap_send_error_response","message_template":"The gateway did not receive a timely response from the upstream server or application.","reason":"The server, acting as a gateway, timed out waiting for response from upstream server (504 Gateway Timeout)","resolution":"Check connectivity and performance of the upstream server. May require adjusting timeout settings or resolving issues with the backend service."}],"project":"apache\/httpd"}