{"module":"mod_mime.c","summary":"The mod_mime module enables the Apache server to determine content types, languages, encodings and handlers based on file extension mappings. It provides capabilities for setting MIME information through configuration directives and manages content negotiation for proper file serving.","logs":[{"function":"mime_post_config","message_template":"Invalid mime types config path %s","reason":"The server failed to validate the path for the MIME types configuration file. This occurs when an invalid path is specified in the TypesConfig directive.","resolution":"Check the TypesConfig directive value in your Apache configuration. Ensure the path is correct and the server has permission to access it."},{"function":"mime_post_config","message_template":"could not open mime types config file %s.","reason":"The server couldn't open the specified MIME types configuration file. This may be due to permissions, file not existing, or incorrect path.","resolution":"Verify that the MIME types file exists at the specified location and Apache has read permissions for it. The default location is specified by the TypesConfig directive."},{"function":"analyze_ct","message_template":"mod_mime: analyze_ct: cannot get media type from '%s'","reason":"The server failed to parse the media type from a Content-Type header or definition. The format may be invalid or malformed.","resolution":"Review the Content-Type format in your configuration or content. Ensure it follows the proper format 'type\/subtype' with optional parameters."},{"function":"analyze_ct","message_template":"Cannot get media type from '%s'","reason":"Failed to extract the media type component from a Content-Type string. The Content-Type format may be invalid.","resolution":"Verify the Content-Type syntax in your configuration or content. It should follow standard MIME type format like 'text\/html'."},{"function":"analyze_ct","message_template":"Cannot get media subtype.","reason":"The parser could not extract the subtype component (the part after the slash) from a Content-Type definition.","resolution":"Check that Content-Type definitions include both a type and subtype separated by a slash (e.g., 'text\/html' where 'html' is the subtype)."},{"function":"analyze_ct","message_template":"Cannot get media parameter.","reason":"Failed to parse parameters in a Content-Type header. Parameters are usually added after the MIME type with semicolons.","resolution":"Examine Content-Type definitions with parameters. Ensure parameters follow the format 'type\/subtype; param=value' and use correct syntax for quoted values."},{"function":"multiviews_match","message_template":"Any is incompatible with NegotiatedOnly, Filters and Handlers","reason":"The configuration contains incompatible MultiviewsMatch options. The 'Any' option cannot be used together with 'NegotiatedOnly', 'Filters', or 'Handlers'.","resolution":"Review your MultiviewsMatch directives and choose either 'Any' alone or some combination of the other options. Remove the conflicting options from your configuration."},{"function":"multiviews_match","message_template":"NegotiatedOnly is incompatible with Any, Filters and Handlers","reason":"Incompatible MultiviewsMatch options defined in configuration. 'NegotiatedOnly' cannot be used with 'Any', 'Filters', or 'Handlers'.","resolution":"Modify your MultiviewsMatch configuration to use either 'NegotiatedOnly' alone or some combination of 'Filters' and 'Handlers' without 'Any'."},{"function":"multiviews_match","message_template":"Filters is incompatible with Any and NegotiatedOnly","reason":"The MultiviewsMatch configuration contains incompatible options. 'Filters' cannot be used with 'Any' or 'NegotiatedOnly'.","resolution":"Adjust your MultiviewsMatch configuration to either use 'Filters' (potentially with 'Handlers') or choose one of the incompatible options but not both."},{"function":"multiviews_match","message_template":"Handlers is incompatible with Any and NegotiatedOnly","reason":"Incompatible MultiviewsMatch options specified in configuration. 'Handlers' cannot be used with 'Any' or 'NegotiatedOnly'.","resolution":"Update your MultiviewsMatch configuration to either use 'Handlers' (potentially with 'Filters') or choose one of the incompatible options but not both."},{"function":"multiviews_match","message_template":"Unrecognized option '%s'","reason":"The configuration contains an invalid option for the MultiviewsMatch directive. Only 'Any', 'NegotiatedOnly', 'Filters', and 'Handlers' are valid.","resolution":"Check your MultiviewsMatch directive and replace the unrecognized option with one of the valid options: 'Any', 'NegotiatedOnly', 'Filters', or 'Handlers'."},{"function":"add_mime_options","message_template":"Invalid MimeOptions option: ","reason":"An invalid option was provided to the MimeOptions directive. Valid options include 'TypesLastExtension', 'NoTypesLastExtension', 'AllLastExtension', 'NoAllLastExtension', 'Enable', and 'Disable'.","resolution":"Review your MimeOptions directive and use only valid options. See the Apache documentation for MimeOptions for correct usage and syntax."}],"project":"apache\/httpd"}