{"module":"mod_cache.c","summary":"This module implements the core caching functionality for Apache HTTP Server, handling URL caching, entity creation, selection, and invalidation. It manages cache keys, conditional requests, and cache freshness validation.","logs":[{"function":"cache_remove_url","message_template":"cache: Removing url %s from the cache","reason":"Logs when a URL is being removed from the cache, either due to an explicit removal request or when handling a stale cache entry.","resolution":"This is an informational message that indicates normal cache maintenance. No action required unless unexpected URLs are being removed."},{"function":"cache_create_entity","message_template":"cache: No cache request information available for key generation","reason":"The cache request record is missing when trying to create a cache entity. This should never happen during normal operation and indicates an internal error.","resolution":"Check for module configuration issues or conflicts. This may indicate a problem with the module initialization or request processing order."},{"function":"cache_select","message_template":"cache: No cache request information available for key generation","reason":"The cache request record is missing when trying to select a cached entity. This should never happen and indicates an internal error.","resolution":"Check for module configuration issues or conflicts. This may indicate a problem with the module initialization or request processing order."},{"function":"cache_select","message_template":"cache_select(): Vary header mismatch.","reason":"A cached entity was found but cannot be used because the Vary header conditions don't match the current request.","resolution":"This is normal when content negotiation is in use. If you're seeing this frequently, consider adjusting your caching strategy for resources with Vary headers or examine client request patterns."},{"function":"cache_select","message_template":"Cached response for %s isn't fresh. Adding conditional request headers.","reason":"The cached entity is stale and needs revalidation. The module is adding conditional headers like If-None-Match or If-Modified-Since to check if the content has changed.","resolution":"This is normal caching behavior. If you see this too frequently, you might want to adjust the cache freshness settings or TTL values for the affected resources."},{"function":"cache_select","message_template":"cache: 'only-if-cached' requested and no cached entity, returning 504 Gateway Timeout for: %s","reason":"A client requested a resource with the 'only-if-cached' directive, but the resource was not in the cache, resulting in a 504 Gateway Timeout response.","resolution":"This occurs when clients specifically request cached content only. If this happens frequently, you might need to pre-warm your cache or adjust client behavior to handle fallbacks when content isn't cached."},{"function":"cache_canonicalise_key","message_template":"cache: Key for entity %s?%s is %s","reason":"Shows the cache key generated for a specific URL, including path and query parameters.","resolution":"This is an informational debug message. No action required. It can be useful for troubleshooting cache hits and misses."},{"function":"cache_invalidate","message_template":"cache: Attempted to invalidate cached entity with key: %s","reason":"Logs when there's an attempt to invalidate a cached entity, typically in response to PUT, POST, or DELETE operations.","resolution":"This is normal cache behavior. If invalidation is happening unexpectedly, check your application logic for operations that might be triggering cache invalidation."},{"function":"cache_invalidate","message_template":"cache: No cache request information available for key generation","reason":"The cache request record is missing when trying to invalidate a cached entity. This should never happen and indicates an internal error.","resolution":"Check for module configuration issues or conflicts. This may indicate a problem with the module initialization or request processing order."}],"project":"apache\/httpd"}