{"module":"mod_socache_dbm.c","summary":"This module implements a shared object cache provider using DBM files for storage. It allows storing, retrieving, and managing cache entries for various Apache modules, with automatic expiration of old entries.","logs":[{"function":"socache_dbm_create","message_template":"Invalid cache file path %s","reason":"The specified path for the DBM cache file is invalid or cannot be resolved relative to the runtime directory","resolution":"Check the path configuration and ensure it is valid and accessible by the Apache process"},{"function":"try_chown","message_template":"Can't change owner of %s","reason":"Failed to change ownership of the DBM file to the Apache user. This can happen due to permission issues or if the file doesn't exist","resolution":"Check file permissions and ensure Apache has proper access to the directory. This might require adjusting ownership at the filesystem level"},{"function":"socache_dbm_init","message_template":"could not use default path '%s' for DBM socache","reason":"The default path for the DBM cache file cannot be used, likely due to permission issues or configuration problems","resolution":"Specify a custom path for the DBM cache file in the configuration or resolve permission issues with the default path"},{"function":"socache_dbm_init","message_template":"Cannot load socache DBM library '%s': %s","reason":"The DBM library required for the cache could not be loaded. This might be due to missing libraries or compatibility issues","resolution":"Ensure that the required DBM libraries are installed on the system and compatible with Apache"},{"function":"socache_dbm_init","message_template":"Cannot create socache DBM file `%s'","reason":"Could not create the DBM file for the cache. This might be due to permission issues or filesystem problems","resolution":"Check directory permissions and ensure Apache has write access to the specified path"},{"function":"socache_dbm_store","message_template":"data size too large for DBM socache: %d >= %d","reason":"The data being stored is too large for the DBM cache. DBM files have size limitations for key-value pairs","resolution":"Consider reducing the size of the data being stored or using a different cache provider that supports larger entries"},{"function":"socache_dbm_store","message_template":"Cannot load socache DBM library '%s' (store): %s","reason":"The DBM library required for storing data could not be loaded during a store operation","resolution":"Check that the DBM library is installed correctly and compatible with your system"},{"function":"socache_dbm_store","message_template":"Cannot open socache DBM file `%s' for writing (store)","reason":"Failed to open the DBM cache file for writing during a store operation. This might be due to permission issues or file corruption","resolution":"Check file permissions, ensure the directory exists, and verify the file is not corrupted"},{"function":"socache_dbm_store","message_template":"Cannot store socache object to DBM file `%s'","reason":"Failed to store data in the DBM cache file. This might be due to disk space issues, corruption, or other DBM-specific errors","resolution":"Check disk space, verify file integrity, and consider rebuilding the cache if issues persist"},{"function":"socache_dbm_retrieve","message_template":"Cannot load socache DBM library '%s' (fetch): %s","reason":"The DBM library required for retrieving data could not be loaded during a fetch operation","resolution":"Check that the DBM library is installed correctly and compatible with your system"},{"function":"socache_dbm_retrieve","message_template":"Cannot open socache DBM file `%s' for reading (fetch)","reason":"Failed to open the DBM cache file for reading during a fetch operation. This might be due to permission issues or file corruption","resolution":"Check file permissions and verify the file exists and is not corrupted"},{"function":"socache_dbm_remove","message_template":"Cannot load socache DBM library '%s' (delete): %s","reason":"The DBM library required for deleting data could not be loaded during a delete operation","resolution":"Check that the DBM library is installed correctly and compatible with your system"},{"function":"socache_dbm_remove","message_template":"Cannot open socache DBM file `%s' for writing (delete)","reason":"Failed to open the DBM cache file for writing during a delete operation. This might be due to permission issues or file corruption","resolution":"Check file permissions and verify the file is not corrupted"},{"function":"socache_dbm_expire","message_template":"Cannot load socache DBM library '%s' (expire): %s","reason":"The DBM library required for expiring data could not be loaded during an expire operation","resolution":"Check that the DBM library is installed correctly and compatible with your system"},{"function":"socache_dbm_expire","message_template":"Cannot open socache DBM file `%s' for scanning","reason":"Failed to open the DBM cache file for scanning during an expire operation. This is needed to identify expired entries","resolution":"Check file permissions and verify the file exists and is not corrupted"},{"function":"socache_dbm_expire","message_template":"Cannot re-open socache DBM file `%s' for expiring","reason":"Failed to re-open the DBM cache file for removing expired entries. This happens after the scanning phase","resolution":"Check file permissions and verify the file is not corrupted or locked by another process"},{"function":"socache_dbm_expire","message_template":"DBM socache expiry: old: %d, new: %d, removed: %d","reason":"Debug information about the cache expiry process, showing the number of entries before and after expiry, and how many were removed","resolution":"Informational log, no resolution required. If the number of removed entries is unexpectedly high, check if the cache lifetime settings are appropriate"},{"function":"socache_dbm_status","message_template":"Cannot load socache DBM library '%s' (status retrieval): %s","reason":"The DBM library required for retrieving status could not be loaded during a status retrieval operation","resolution":"Check that the DBM library is installed correctly and compatible with your system"},{"function":"socache_dbm_status","message_template":"Cannot open socache DBM file `%s' for status retrieval","reason":"Failed to open the DBM cache file for retrieving status information, needed for monitoring and diagnostics","resolution":"Check file permissions and verify the file exists and is not corrupted"},{"function":"socache_dbm_iterate","message_template":"Cannot load socache DBM library '%s' (iterating): %s","reason":"The DBM library required for iterating through cache entries could not be loaded","resolution":"Check that the DBM library is installed correctly and compatible with your system"},{"function":"socache_dbm_iterate","message_template":"Cannot open socache DBM file `%s' for iterating","reason":"Failed to open the DBM cache file for iterating through entries. This might be due to permission issues or file corruption","resolution":"Check file permissions and verify the file exists and is not corrupted"},{"function":"socache_dbm_iterate","message_template":"dbm `%s' entry iterated","reason":"Debug information indicating that a cache entry was successfully iterated","resolution":"Informational log, no resolution required"},{"function":"socache_dbm_iterate","message_template":"Failure reading first\/next socache DBM file `%s' record","reason":"Failed to read a record while iterating through the DBM cache file. This might be due to file corruption","resolution":"Check the integrity of the DBM file and consider rebuilding the cache if issues persist"}],"project":"apache\/httpd"}