{"module":"socache_memcache.c","summary":"Apache module that implements a shared object cache backend using memcached servers. It enables storing, retrieving, and managing cached data across multiple memcached instances, commonly used for caching SSL sessions and other server data.","logs":[{"function":"socache_mc_create","message_template":"List of server names required to create memcache socache.","reason":"The module requires a list of memcached servers to connect to. This error occurs when no server list is provided in the configuration.","resolution":"Add a list of memcached servers in the format 'hostname1:port,hostname2:port,...' to the module configuration."},{"function":"socache_mc_init","message_template":"Failed to create Memcache Object of '%d' size.","reason":"The module failed to create the main memcache object that manages the connection pool. Likely due to resource limitations or memory allocation issues.","resolution":"Check server resource usage and memcache library compatibility. Ensure the system has enough memory and file descriptors available."},{"function":"socache_mc_init","message_template":"Failed to Parse memcache Server: '%s'","reason":"The module couldn't parse one of the specified memcache server strings. This happens when the server address is malformed.","resolution":"Check the server configuration and ensure each memcached server is correctly specified in the format 'hostname:port'. If port is omitted, the default 11211 will be used."},{"function":"socache_mc_init","message_template":"Failed to Parse Server, no hostname specified: '%s'","reason":"One of the memcached server entries doesn't include a hostname. The module needs at least a hostname to connect to the server.","resolution":"Check the server configuration and ensure each memcached server includes a valid hostname."},{"function":"socache_mc_init","message_template":"Failed to Create memcache Server: %s:%d","reason":"The module couldn't create a connection to the specified memcached server. Likely due to resource limitations or invalid server parameters.","resolution":"Verify the memcached server is accessible from the Apache server. Check network connectivity, firewall settings, and that the memcached server is running."},{"function":"socache_mc_init","message_template":"Failed to Add memcache Server: %s:%d","reason":"The module couldn't add the server to the memcache connection pool. This may happen if there are too many servers or memory limitations.","resolution":"Check server resource usage. Consider reducing the number of memcached servers or increasing available memory."},{"function":"socache_mc_store","message_template":"scache_mc: error setting key '%s' with %d bytes of data","reason":"The module failed to store data in the memcached server. This could be due to network issues, server being down, or size limitations.","resolution":"Verify memcached servers are running and accessible. Check network connectivity and memcached server health. Consider increasing the memcached memory limit if data size is the issue."},{"function":"socache_mc_retrieve","message_template":"scache_mc: 'retrieve' FAIL","reason":"The module failed to retrieve data from the memcached server for reasons other than the key not being found. Likely due to network issues or server problems.","resolution":"Check memcached server status and network connectivity. Restart memcached servers if necessary. This error does not include normal cache misses."},{"function":"socache_mc_retrieve","message_template":"scache_mc: 'retrieve' OVERFLOW","reason":"The data retrieved from memcached is larger than the buffer allocated to hold it. This may indicate data corruption or configuration issues.","resolution":"If this happens frequently, you may need to examine what's being stored in the cache and ensure it's the expected size. Consider increasing buffer sizes if appropriate."},{"function":"socache_mc_remove","message_template":"scache_mc: error deleting key '%s'","reason":"The module failed to delete a key from the memcached server. This is a debug-level message and typically not critical.","resolution":"No immediate action required as this is a debug message. If persisting, check memcached server connectivity and status."},{"function":"socache_mc_set_ttl","message_template":" has wrong format","reason":"The MemcacheConnTTL directive has an invalid format. The TTL value should be a time value (e.g., '10s' for 10 seconds).","resolution":"Correct the MemcacheConnTTL directive in your Apache configuration. Use a properly formatted time value like '30s', '2m', etc."},{"function":"socache_mc_set_ttl","message_template":" can only be 0 or up to one hour.","reason":"The TTL value for memcache connections is out of the allowed range. It must be either 0 or a value up to one hour.","resolution":"Adjust the MemcacheConnTTL directive in your Apache configuration to be between 0 and 3600 seconds (1 hour)."}],"project":"apache\/httpd"}