{"module":"cache_disk_module.c","summary":"Apache's disk-based HTTP cache implementation that manages storing and retrieving cached content on disk, supporting file hierarchy organization and cache validation. It handles caching decisions, file operations, and cache invalidation.","logs":[{"function":"safe_file_rename","message_template":"rename tempfile to file failed: %s -> %s","reason":"Logs when a temporary file cannot be renamed to its final cache file location, potentially due to file system permissions or directory structure issues.","resolution":"Check file system permissions and ensure the cache directories exist with proper write permissions. May also need to increase the system's open file limits."},{"function":"create_entity","message_template":"URL %s partial content response not cached","reason":"Informs that partial content responses (HTTP 206) are not being cached, as the module doesn't support caching of range requests.","resolution":"This is an informational message. If caching of partial content is needed, consider a different caching strategy or module."},{"function":"create_entity","message_template":"URL %s failed the size check (%APR_OFF_T_FMT > %APR_OFF_T_FMT)","reason":"The response size exceeds the maximum file size configured for caching (CacheMaxFileSize).","resolution":"If caching of larger files is desired, increase the CacheMaxFileSize directive value in the configuration."},{"function":"create_entity","message_template":"URL %s failed the size check (%APR_OFF_T_FMT < %APR_OFF_T_FMT)","reason":"The response size is smaller than the minimum file size configured for caching (CacheMinFileSize).","resolution":"If caching of smaller files is desired, decrease the CacheMinFileSize directive value in the configuration."},{"function":"open_entity","message_template":"Cannot cache files to disk without a CacheRoot specified.","reason":"The CacheRoot directive is missing from the server configuration, which is required for disk caching.","resolution":"Add a CacheRoot directive in the server configuration specifying a valid directory path where cache files should be stored."},{"function":"open_entity","message_template":"Cannot parse vary header file: %s","reason":"Unable to parse the vary header file due to corruption or unexpected format issues.","resolution":"Delete the corrupt cache files and allow them to be regenerated. This could indicate filesystem issues or concurrent modifications."},{"function":"open_entity","message_template":"File '%s' has a version mismatch. File had version: %d.","reason":"The format version in the cache file doesn't match the expected version for the current module implementation.","resolution":"Clear the cache directory to allow regeneration of cache files with the correct format. This typically happens after mod_cache_disk is upgraded."},{"function":"open_entity","message_template":"Cannot read header file %s","reason":"Unable to read the header file from disk, possibly due to filesystem permissions or corruption.","resolution":"Check file permissions and integrity of the cache directory. The file may be corrupted or inaccessible."},{"function":"open_entity","message_template":"HEAD request cached, non-HEAD requested, ignoring: %s","reason":"A HEAD request was previously cached, but a non-HEAD request is now being processed, so the cached entry is ignored.","resolution":"This is expected behavior. No action required as the system will generate a new cache entry for the full request."},{"function":"open_entity","message_template":"Cannot open data file %s","reason":"The cached data file cannot be opened, possibly due to file permissions or the file has been deleted.","resolution":"Check file permissions and verify the cache directory structure. May require clearing the cache if files are inconsistent."},{"function":"open_entity","message_template":"Recalled cached URL info header %s","reason":"Successfully recalled a cached URL's header information from disk.","resolution":"Informational message indicating successful cache operation. No action required."},{"function":"open_entity","message_template":"Cached URL info header '%s' didn't match body, ignoring this entry","reason":"The header file and body file don't match (different inodes or devices), indicating possible cache corruption.","resolution":"This can happen if files were modified outside of Apache or if disk operations were interrupted. Allow the cache to regenerate the entry."},{"function":"remove_url","message_template":"Deleting %s from cache.","reason":"A cache entry is being removed from disk, either due to invalidation or an error condition.","resolution":"Informational message. No action required as this is part of normal cache maintenance."},{"function":"remove_url","message_template":"Failed to delete headers file %s from cache.","reason":"Unable to delete the headers file during cache entry removal, possibly due to file permissions.","resolution":"Check file permissions and processes that might be holding the file open. May require manual intervention to clean the cache."},{"function":"remove_url","message_template":"Failed to delete data file %s from cache.","reason":"Unable to delete the data file during cache entry removal, possibly due to file permissions.","resolution":"Check file permissions and processes that might be holding the file open. May require manual intervention to clean the cache."},{"function":"remove_url","message_template":"Deleting directory %s from cache","reason":"A cache directory is being deleted during cleanup of a cache entry.","resolution":"Informational message. No action required as this is part of normal cache maintenance."},{"function":"read_array","message_template":"Premature end of vary array.","reason":"When reading the vary information from a cache file, the file ended unexpectedly, indicating corruption.","resolution":"The cache file is likely corrupted. Clear the affected cache entry to allow regeneration."},{"function":"read_table","message_template":"Premature end of cache headers.","reason":"When reading the header information from a cache file, the file ended unexpectedly, indicating corruption.","resolution":"The cache headers file is likely corrupted. Clear the affected cache entry to allow regeneration."},{"function":"read_table","message_template":"CGI Interface Error: Script headers apparently ASCII: (CGI = %s)","reason":"Headers received from a CGI script appear to be in ASCII format rather than the expected EBCDIC format (on EBCDIC platforms only).","resolution":"Check the CGI script to ensure it's generating headers in the correct character encoding for the platform."},{"function":"recall_headers","message_template":"recalling headers; but no header fd for %s","reason":"Attempt to recall headers but the header file descriptor is not available, indicating an internal inconsistency.","resolution":"This indicates a potential bug in the cache implementation. Report the issue with the specific scenario that triggered it."},{"function":"recall_headers","message_template":"Error reading response headers from %s for %s","reason":"Unable to read the response headers from the cache file, possibly due to corruption or I\/O errors.","resolution":"Check disk health and cache file integrity. May need to clear the affected cache entry."},{"function":"recall_headers","message_template":"Error reading request headers from %s for %s","reason":"Unable to read the request headers from the cache file, possibly due to corruption or I\/O errors.","resolution":"Check disk health and cache file integrity. May need to clear the affected cache entry."},{"function":"recall_headers","message_template":"Recalled headers for URL %s","reason":"Successfully recalled headers for a cached URL.","resolution":"Informational message indicating successful cache operation. No action required."},{"function":"write_headers","message_template":"could not create vary file %s","reason":"Unable to create a temporary file for vary header information, potentially due to filesystem permissions or space issues.","resolution":"Check disk space, file permissions, and ensure the CacheRoot directory is writable by the Apache process."},{"function":"write_headers","message_template":"could not write to vary file %s","reason":"Failed to write vary header information to the temporary file, possibly due to disk full or I\/O errors.","resolution":"Check disk space and system I\/O performance. May indicate disk errors requiring maintenance."},{"function":"write_headers","message_template":"could not close vary file %s","reason":"Failed to close the vary header file, potentially indicating I\/O errors during the file flush operation.","resolution":"Check for disk errors or space issues. May require system-level disk diagnostics."},{"function":"write_headers","message_template":"could not create header file %s","reason":"Unable to create a temporary file for header information, potentially due to filesystem permissions or space issues.","resolution":"Check disk space, file permissions, and ensure the CacheRoot directory is writable by the Apache process."},{"function":"write_headers","message_template":"could not write info to header file %s","reason":"Failed to write basic metadata to the header file, possibly due to disk full or I\/O errors.","resolution":"Check disk space and system I\/O performance. May indicate disk errors requiring maintenance."},{"function":"write_headers","message_template":"could not write out-headers to header file %s","reason":"Failed to write response headers to the header file, possibly due to disk full or I\/O errors.","resolution":"Check disk space and system I\/O performance. May indicate disk errors requiring maintenance."},{"function":"write_headers","message_template":"could not write in-headers to header file %s","reason":"Failed to write request headers to the header file, possibly due to disk full or I\/O errors.","resolution":"Check disk space and system I\/O performance. May indicate disk errors requiring maintenance."},{"function":"write_headers","message_template":"could not close header file %s","reason":"Failed to close the header file, potentially indicating I\/O errors during the file flush operation.","resolution":"Check for disk errors or space issues. May require system-level disk diagnostics."},{"function":"store_body","message_template":"Error when reading bucket for URL %s","reason":"Failed to read data from the input bucket brigade while caching content, indicating a network or memory issue.","resolution":"This may occur due to network interruptions or resource constraints. Check server load and client connection stability."},{"function":"store_body","message_template":"Error when writing cache file for URL %s","reason":"Failed to write data to the cache file, typically due to disk space or permission issues.","resolution":"Check disk space, permissions, and I\/O subsystem health. May require freeing disk space or fixing permission issues."},{"function":"store_body","message_template":"URL %s failed the size check (%APR_OFF_T_FMT>%APR_OFF_T_FMT)","reason":"During streaming storage, the response exceeded the maximum file size configured for caching.","resolution":"If caching of larger files is desired, increase the CacheMaxFileSize directive value in the configuration."},{"function":"store_body","message_template":"Discarding body for URL %s because connection has been aborted.","reason":"The client connection was terminated before the response was fully received, so caching is abandoned.","resolution":"Client-side issue. No server-side action required, though frequent occurrences might indicate network problems."},{"function":"store_body","message_template":"URL %s failed the size check (%APR_OFF_T_FMT<%APR_OFF_T_FMT)","reason":"The response size is smaller than the minimum file size configured for caching.","resolution":"If caching of smaller files is desired, decrease the CacheMinFileSize directive value in the configuration."},{"function":"store_body","message_template":"URL %s didn't receive complete response, not caching","reason":"The Content-Length header doesn't match the actual bytes received, indicating an incomplete or corrupted response.","resolution":"This could indicate network issues or incorrectly generated Content-Length headers. Check proxy configurations and origin server responses."},{"function":"commit_entity","message_template":"commit_entity: URL '%s' not cached due to earlier disk error.","reason":"A previous disk error during cache file creation prevents committing the entity to the cache.","resolution":"Investigate previous error messages to identify and resolve the underlying disk issue (permissions, space, etc.)."},{"function":"commit_entity","message_template":"commit_entity: Headers and body for URL %s cached.","reason":"Successfully completed caching of a response, including headers and body.","resolution":"Informational message indicating successful cache operation. No action required."}],"project":"apache\/httpd"}