{"module":"mod_file_cache.c","summary":"This Apache module improves performance by caching frequently accessed static files either by holding open file handles or by memory-mapping file contents. It supports two directives: 'cachefile' for caching file handles and 'mmapfile' for memory-mapping files, both configured at server startup time.","logs":[{"function":"cache_the_file","message_template":"invalid file path %s, skipping","reason":"The file path provided in the cachefile\/mmapfile directive cannot be resolved relative to the server root. Likely due to missing directory or incorrect path specification.","resolution":"Check the file path in your configuration and ensure it exists and is properly specified relative to ServerRoot. Absolute paths should start with a leading slash (\/)."},{"function":"cache_the_file","message_template":"unable to stat(%s), skipping","reason":"The module cannot retrieve file information for the specified file. This could be due to file permissions, non-existent file, or file system issues.","resolution":"Verify the file exists, check file permissions to ensure the Apache user can read the file, and investigate any potential file system issues."},{"function":"cache_the_file","message_template":"%s isn't a regular file, skipping","reason":"The specified path is not a regular file but could be a directory, symbolic link, or other special file type that cannot be cached.","resolution":"Ensure the path specified in the cachefile\/mmapfile directive points to a regular file, not a directory or other special file type."},{"function":"cache_the_file","message_template":"%s is too large to cache, skipping","reason":"The file exceeds the maximum size limit (AP_MAX_SENDFILE) that can be cached. Very large files are not suitable for caching.","resolution":"Consider breaking large files into smaller components if possible, or serve these large files through standard Apache mechanisms without caching."},{"function":"cache_the_file","message_template":"unable to open(%s, O_RDONLY), skipping","reason":"The module cannot open the file for reading. This may be due to permissions issues or file system problems.","resolution":"Check file permissions to ensure Apache has read access, verify the file exists and is not locked by another process."},{"function":"cache_the_file","message_template":"unable to mmap %s, skipping","reason":"Memory mapping the file failed. This could be due to system resource limitations or issues with the file itself.","resolution":"Ensure sufficient system memory is available, check file system health, and consider using file handle caching (cachefile) instead of memory mapping (mmapfile) if the problem persists."},{"function":"cachefilehandle","message_template":"unable to cache file: %s. Sendfile is not supported on this OS","reason":"The operating system does not support the sendfile operation which is required for file handle caching.","resolution":"On systems without sendfile support, use the mmapfile directive instead if your OS supports memory mapping, or consider alternative caching mechanisms like mod_cache."},{"function":"cachefilemmap","message_template":"unable to cache file: %s. MMAP is not supported by this OS","reason":"The operating system does not support memory mapping which is required for mmapfile directives.","resolution":"On systems without mmap support, use the cachefile directive instead if your OS supports sendfile, or consider alternative caching mechanisms like mod_cache."}],"project":"apache\/httpd"}