{"module":"socache_dc.c","summary":"This module provides a distributed cache implementation for Apache's shared object cache system using the distcache library. It allows Apache to store, retrieve, and remove cache entries through a network-based distributed cache, supporting both temporary and persistent connection modes.","logs":[{"function":"compiler error check","message_template":"You must compile with a more recent version of the distcache-base package","reason":"This is a compile-time error that occurs when the distcache client API version is too old or not defined.","resolution":"Update the distcache-base package to a more recent version and recompile the module."},{"function":"socache_dc_init","message_template":"distributed scache failed to obtain context","reason":"The module failed to create a new distcache client context, which is necessary for all cache operations. Likely due to connection issues to the distcache server or insufficient resources.","resolution":"Verify the distcache server is running and accessible at the configured target. Check network connectivity and ensure proper configuration of the target server address."},{"function":"socache_dc_init","message_template":"distributed scache context initialised","reason":"The module successfully initialized the distcache client context and established a connection to the distcache server.","resolution":"Informational log, no resolution required. Confirms the distcache setup is working properly."},{"function":"socache_dc_store","message_template":"distributed scache 'store' failed","reason":"Failed to store a session in the distributed cache. This could happen due to network issues, server problems, or capacity limitations.","resolution":"Check if the distcache server is running properly, verify network connectivity, and ensure the server has enough capacity to store new sessions."},{"function":"socache_dc_store","message_template":"distributed scache 'store' successful","reason":"Successfully stored a session in the distributed cache.","resolution":"Informational log, no resolution required. Confirms the cache storage operation worked correctly."},{"function":"socache_dc_retrieve","message_template":"distributed scache 'retrieve' MISS","reason":"Attempted to retrieve a session from the distributed cache, but no matching entry was found. This is common for new sessions or after cache expiration.","resolution":"Informational log, no resolution required unless misses are unexpectedly frequent, which might indicate cache expiration times are too short or the cache is being cleared unexpectedly."},{"function":"socache_dc_retrieve","message_template":"distributed scache 'retrieve' OVERFLOW","reason":"The retrieved session data was larger than the provided buffer. This indicates a mismatch between the expected maximum session size and the actual size.","resolution":"Increase the buffer size allocation for session data in the calling code. May require modifications to the module using this cache provider."},{"function":"socache_dc_retrieve","message_template":"distributed scache 'retrieve' HIT","reason":"Successfully retrieved a session from the distributed cache.","resolution":"Informational log, no resolution required. Confirms the cache retrieval operation worked correctly."},{"function":"socache_dc_remove","message_template":"distributed scache 'remove' MISS","reason":"Attempted to remove a session from the distributed cache, but no matching entry was found.","resolution":"This is generally not a problem unless sessions that should exist are missing. If this happens frequently when they shouldn't, check if another process is clearing the cache or if entries are expiring too quickly."},{"function":"socache_dc_remove","message_template":"distributed scache 'remove' HIT","reason":"Successfully removed a session from the distributed cache. Note that this is logged as an error, which appears to be a bug in the code.","resolution":"Informational log, no resolution required. The error level for this log should probably be changed to INFO or DEBUG in the module code."},{"function":"socache_dc_status","message_template":"distributed scache 'socache_dc_status'","reason":"The status function of the distributed cache module was called, typically in response to a server-status request.","resolution":"Informational log, no resolution required. Part of normal operation when viewing server status."},{"function":"socache_dc_status","message_template":"cache type: <b>DC (Distributed Cache)<\/b>, target: <b>%s<\/b><br>","reason":"Displays formatted HTML status information about the distributed cache configuration, including the target server.","resolution":"Informational output, no resolution required. Provides visibility into the current cache configuration."},{"function":"socache_dc_status","message_template":"CacheType: DC\nCacheTarget: %s\n","reason":"Displays plain text status information about the distributed cache configuration when requested in short format.","resolution":"Informational output, no resolution required. Provides visibility into the current cache configuration."}],"project":"apache\/httpd"}