{"module":"socache_redis_module.c","summary":"This module implements a Redis-based shared object cache for Apache HTTP Server, providing functionality to store, retrieve, and manage cached data using Redis servers as the backend storage system.","logs":[{"function":"socache_rd_create","message_template":"List of server names required to create redis socache.","reason":"This error occurs when no Redis server configuration is provided to the module. The module requires at least one Redis server to be specified.","resolution":"Add Redis server configuration to the Apache configuration file using the syntax: 'CacheSocache redis:server1:port1,server2:port2'"},{"function":"socache_rd_init","message_template":"Failed to create Redis Object of '%d' size.","reason":"Failed to initialize the Redis connection object pool. Likely due to memory allocation issues or invalid number of servers.","resolution":"Check system resources and verify Redis server configuration. Consider reducing the number of configured Redis servers."},{"function":"socache_rd_init","message_template":"Failed to Parse redis Server: '%s'","reason":"The module could not parse the specified Redis server address. The server string has an invalid format.","resolution":"Ensure Redis server specifications follow the format 'hostname:port'. If port is omitted, the default port 6379 will be used."},{"function":"socache_rd_init","message_template":"Failed to Parse Server, no hostname specified: '%s'","reason":"The Redis server configuration is missing a hostname. A valid hostname is required to connect to Redis.","resolution":"Specify a valid hostname in the Redis server configuration. Format should be 'hostname:port'."},{"function":"socache_rd_init","message_template":"Failed to Create redis Server: %s:%d","reason":"The module could not create a connection to the specified Redis server. Likely due to network issues or invalid server parameters.","resolution":"Verify the Redis server is running at the specified address and port. Check network connectivity between Apache and Redis server."},{"function":"socache_rd_init","message_template":"Failed to Add redis Server: %s:%d","reason":"The specified Redis server could not be added to the connection pool. This may occur if the server is unreachable or if there are configuration issues.","resolution":"Ensure Redis server is running and accessible. Check for firewall rules blocking access and verify correct server address and port."},{"function":"socache_rd_store","message_template":"scache_rd: error setting key '%s' with %d bytes of data","reason":"Failed to store data in the Redis cache. Could be due to Redis server issues, network problems, or Redis reaching maximum memory limit.","resolution":"Check Redis server status, verify network connectivity, and ensure Redis has sufficient memory. May need to adjust Redis maxmemory configuration."},{"function":"socache_rd_retrieve","message_template":"scache_rd: 'retrieve' FAIL","reason":"Failed to retrieve data from Redis cache. This is not normal operation and indicates a problem with the Redis connection or server.","resolution":"Check Redis server health, network connectivity, and Redis server logs for errors. Verify Redis is not being overloaded with requests."},{"function":"socache_rd_retrieve","message_template":"scache_rd: 'retrieve' OVERFLOW","reason":"Retrieved data exceeds the buffer size. The cached item is larger than the allocated buffer for retrieval.","resolution":"This is an internal error that might indicate corruption in the cache or a mismatch between storage and retrieval mechanisms. Consider clearing the Redis cache."},{"function":"socache_rd_remove","message_template":"scache_rd: error deleting key '%s'","reason":"Failed to delete a key from the Redis cache. Could indicate connectivity issues with Redis or key doesn't exist.","resolution":"Check Redis server health and network connectivity. This error might be transient and may not require action if infrequent."},{"function":"socache_rd_set_ttl","message_template":"RedisConnPoolTTL has wrong format","reason":"The RedisConnPoolTTL directive was provided with an invalid time format. This affects the TTL of connections in the Redis connection pool.","resolution":"Use a valid time format for RedisConnPoolTTL directive, such as '10s' for 10 seconds. Valid values are between 0 and 3600 seconds."},{"function":"socache_rd_set_ttl","message_template":"RedisConnPoolTTL can only be 0 or up to one hour.","reason":"The specified TTL value for Redis connection pool is outside the allowed range (0 to 3600 seconds).","resolution":"Set RedisConnPoolTTL to a value between 0 and 3600 seconds (one hour) in the Apache configuration."},{"function":"socache_rd_set_rwto","message_template":"RedisTimeout has wrong format","reason":"The RedisTimeout directive was provided with an invalid time format. This affects the read\/write timeout for Redis operations.","resolution":"Use a valid time format for RedisTimeout directive, such as '10s' for 10 seconds. Valid values are between 0 and 3600 seconds."},{"function":"socache_rd_set_rwto","message_template":"RedisTimeout can only be 0 or up to one hour.","reason":"The specified timeout value for Redis read\/write operations is outside the allowed range (0 to 3600 seconds).","resolution":"Set RedisTimeout to a value between 0 and 3600 seconds (one hour) in the Apache configuration."}],"project":"apache\/httpd"}