{"module":"mod_cache.c","summary":"A core Apache module that provides caching capabilities for HTTP requests. It implements RFC 2616 caching logic, handles cache storage management with locking mechanisms, and supports conditional requests and cache validation.","logs":[{"function":"cache_quick_handler","message_template":"PUT\/POST\/DELETE: Adding CACHE_INVALIDATE filter for %s","reason":"Logs that a CACHE_INVALIDATE filter is being added for a URL because a PUT, POST, or DELETE request was received, which should invalidate any cached entity if successful","resolution":"This is an informational log and no resolution is needed. It indicates normal cache invalidation behavior for mutating HTTP methods."},{"function":"cache_quick_handler","message_template":"cache: Method '%s' not cacheable by mod_cache, ignoring: %s","reason":"The HTTP method used in the request is not one that can be cached (only GET is typically cacheable)","resolution":"No resolution needed; this is informational. If you need to cache other methods, you may need a different caching approach."},{"function":"cache_quick_handler","message_template":"Adding CACHE_SAVE_SUBREQ filter for %s","reason":"A CACHE_SAVE_SUBREQ filter is being added for a subrequest to save the response in the cache","resolution":"Information log, no resolution required. Indicates normal caching operation for subrequests."},{"function":"cache_quick_handler","message_template":"Adding CACHE_SAVE filter for %s","reason":"A CACHE_SAVE filter is being added to cache the response for a main request","resolution":"Information log, no resolution required. Normal cache operation."},{"function":"cache_quick_handler","message_template":"Adding CACHE_REMOVE_URL filter for %s","reason":"A CACHE_REMOVE_URL filter is being added to allow removal of a stale cache entry if needed","resolution":"Information log, no resolution required. This is part of normal cache management."},{"function":"cache_quick_handler","message_template":"Cache locked for url, not caching response: %s","reason":"The URL is already being cached by another request, so this request won't attempt to cache it. This prevents the 'thundering herd' problem where multiple requests try to cache the same URL simultaneously","resolution":"This is expected behavior under high load. If you see this frequently, you might want to adjust the cache lock timeout settings with CacheLockMaxAge."},{"function":"cache_quick_handler","message_template":"Restoring request headers for %s","reason":"Original request headers are being restored after a cache lookup operation","resolution":"Information log, no resolution required. This is normal cache operation."},{"function":"cache_quick_handler","message_template":"Restoring request headers.","reason":"Request headers are being restored after a cache hit or conditional hit","resolution":"Information log, no resolution required. This is normal cache operation."},{"function":"cache_quick_handler","message_template":"cache_quick_handler(%s): ap_pass_brigade returned","reason":"An error occurred when passing the filter brigade in the quick handler. This is a critical error in the filter chain processing","resolution":"Check the error logs for more details on the specific error. This could indicate problems with the underlying storage, memory issues, or network problems."},{"function":"cache_replace_filter","message_template":"Replacing CACHE with CACHE_SAVE filter for %s","reason":"The CACHE placeholder filter is being replaced with the CACHE_SAVE filter at the exact position specified by the administrator","resolution":"Information log, no resolution required. This is normal cache filter operation."},{"function":"cache_replace_filter","message_template":"Replacing CACHE with CACHE_OUT filter for %s","reason":"The CACHE placeholder filter is being replaced with the CACHE_OUT filter at the exact position specified by the administrator","resolution":"Information log, no resolution required. This is normal cache filter operation."},{"function":"cache_handler","message_template":"PUT\/POST\/DELETE: Adding CACHE_INVALIDATE filter for %s","reason":"The CACHE_INVALIDATE filter is being added for a PUT, POST, or DELETE request to invalidate any cached entity if successful","resolution":"Information log, no resolution required. This indicates normal cache invalidation behavior for mutating HTTP methods."},{"function":"cache_handler","message_template":"cache: Method '%s' not cacheable by mod_cache, ignoring: %s","reason":"The HTTP method used in the request is not one that can be cached (only GET is typically cacheable)","resolution":"No resolution needed; this is informational. If you need to cache other methods, you may need a different caching approach."},{"function":"cache_handler","message_template":"Adding CACHE_SAVE_SUBREQ filter for %s","reason":"A CACHE_SAVE_SUBREQ filter is being added for a subrequest to save the response in the cache","resolution":"Information log, no resolution required. Indicates normal caching operation for subrequests."},{"function":"cache_handler","message_template":"Adding CACHE_SAVE filter for %s","reason":"A CACHE_SAVE filter is being added to cache the response for a main request","resolution":"Information log, no resolution required. Normal cache operation."},{"function":"cache_handler","message_template":"Adding CACHE_REMOVE_URL filter for %s","reason":"A CACHE_REMOVE_URL filter is being added to allow removal of a stale cache entry if needed","resolution":"Information log, no resolution required. This is part of normal cache management."},{"function":"cache_handler","message_template":"Cache locked for url, not caching response: %s","reason":"The URL is already being cached by another request, so this request won't attempt to cache it. Prevents the 'thundering herd' problem","resolution":"This is expected behavior under high load. If you see this frequently, you might want to adjust the cache lock timeout settings with CacheLockMaxAge."},{"function":"cache_handler","message_template":"cache(%s): ap_pass_brigade returned","reason":"An error occurred when passing the filter brigade in the cache handler. This indicates a critical error in the filter chain processing","resolution":"Check the error logs for more details on the specific error. This could indicate problems with the underlying storage, memory issues, or network problems."},{"function":"cache_out_filter","message_template":"CACHE\/CACHE_OUT filter enabled while caching is disabled, ignoring","reason":"The CACHE_OUT filter was manually configured when caching is not enabled. The filter will be ignored","resolution":"Review your configuration. You should use mod_cache configuration directives (like CacheEnable) rather than directly manipulating the filter chain."},{"function":"cache_out_filter","message_template":"cache: running CACHE_OUT filter","reason":"The CACHE_OUT filter is executing to serve content from the cache","resolution":"Information log, no resolution required. This is normal cache operation."},{"function":"cache_out_filter","message_template":"cache: serving %s","reason":"A cached response is being served for the specified URL","resolution":"Information log, no resolution required. This indicates a cache hit which is optimal behavior."},{"function":"cache_save_store","message_template":"cache: Cache provider's store_body failed for URI %s","reason":"The cache storage provider encountered an error when trying to store the response body for the URI. This could be due to disk space issues, permissions, or other storage problems","resolution":"Check the error logs for more details. Verify disk space, permissions, and the proper configuration of the cache storage provider. You may need to adjust CacheRoot or other provider-specific settings."},{"function":"cache_save_store","message_template":"cache: Cache provider's store_body returned an empty brigade, but didn't consume all of the input brigade, standing down to prevent a spin","reason":"The cache storage provider is not properly handling the data it was given. This is a safety check to prevent an infinite loop (spin)","resolution":"This may indicate a bug in the cache provider implementation. If you consistently see this error, try using a different cache provider or update your Apache installation."},{"function":"cache_save_filter","message_template":"CACHE\/CACHE_SAVE filter enabled while caching is disabled, ignoring","reason":"The CACHE_SAVE filter was manually configured when caching is not enabled. The filter will be ignored","resolution":"Review your configuration. You should use mod_cache configuration directives (like CacheEnable) rather than directly manipulating the filter chain."},{"function":"cache_save_filter","message_template":"cache hit: %d status; stale content returned","reason":"A stale cached entry is being served because a server error occurred during revalidation. This is allowed by RFC2616 if the 'must-revalidate' directive is not present","resolution":"This is a fallback behavior to ensure availability. Check why the backend server is generating errors. If this happens frequently, investigate the backend server issues."},{"function":"cache_save_filter","message_template":"cache: Last modified is in the future, replacing with now","reason":"The Last-Modified date in the response is in the future, which is invalid. The date is being adjusted to the current time","resolution":"Check if the origin server's clock is properly synchronized. This message indicates a time synchronization issue between servers."},{"function":"cache_save_filter","message_template":"cache: updating headers with store_headers failed. Removing cached url.","reason":"There was an error updating the headers in the cached entity. The cached URL is being removed to prevent serving incorrect content","resolution":"Check the error logs for more details. This could indicate storage issues or permission problems with the cache storage. Verify the cache storage configuration."},{"function":"cache_save_filter","message_template":"cache: attempt to remove url from cache unsuccessful.","reason":"After a failure to update headers, an attempt to remove the cached URL also failed. This suggests serious cache storage issues","resolution":"This could indicate filesystem permissions issues or that the cache storage area is read-only (possibly remounted). Check file permissions and disk space."},{"function":"cache_save_filter","message_template":"conditional cache hit: entity refresh failed","reason":"A conditional cache hit occurred but the attempt to refresh the cached entity failed","resolution":"This is usually not critical as the old cached content is still being served. However, check for backend server issues or storage problems that might prevent cache updates."},{"function":"cache_save_filter","message_template":"conditional cache hit: entity refreshed","reason":"A conditional cache hit occurred and the cached entity was successfully refreshed","resolution":"Information log, no resolution required. This indicates normal and optimal cache operation."},{"function":"cache_save_filter","message_template":"cache: serving %s (revalidated)","reason":"A cached response was revalidated with the origin server and is now being served","resolution":"Information log, no resolution required. This indicates normal cache revalidation, which is optimal behavior."},{"function":"cache_save_filter","message_template":"cache: store_headers failed","reason":"There was an error storing the headers for the cached entity. This could be due to storage issues, permissions, or other problems","resolution":"Check the error logs for more details. Verify disk space, permissions, and the proper configuration of the cache storage provider."},{"function":"cache_save_filter","message_template":"cache: %s not cached for request %s. Reason: %s","reason":"The response for the specified URL was not cached, with the specific reason provided. This could be due to various factors like cache-control headers, response status, etc.","resolution":"This is often informational and may indicate normal operation based on caching rules. If you expect this content to be cached, review the reason provided and adjust cache configuration or content headers accordingly."},{"function":"cache_save_filter","message_template":"cache: Caching url %s for request %s","reason":"The response for the specified URL is being cached","resolution":"Information log, no resolution required. This indicates normal cache operation."},{"function":"cache_save_filter","message_template":"cache: Removing CACHE_REMOVE_URL filter.","reason":"The CACHE_REMOVE_URL filter is being removed because the response will be cached, so there's no need to remove the cached URL","resolution":"Information log, no resolution required. This indicates normal cache operation."},{"function":"cache_save_filter","message_template":"%s responded with an uncacheable 304, retrying the request %s. Reason: %s","reason":"The server returned a 304 Not Modified response that cannot be cached. The request will be retried without the conditional headers","resolution":"This can happen if the origin server adds contradictory headers to 304 responses. Check the origin server configuration for proper handling of conditional requests."},{"function":"cache_save_filter","message_template":"conditional cache miss: 304 was uncacheable, entity removed: %s","reason":"A conditional request resulted in a 304 response that couldn't be cached, and the cached entity was removed","resolution":"Check the origin server's behavior with 304 responses. It may be adding headers that contradict the caching model. Review the reason provided in the log message for specific details."},{"function":"cache_remove_url_filter","message_template":"cache: CACHE_REMOVE_URL enabled unexpectedly","reason":"The CACHE_REMOVE_URL filter was manually configured, which is not the expected way to use mod_cache","resolution":"Review your configuration. You should use mod_cache configuration directives rather than directly manipulating the filter chain."},{"function":"cache_invalidate_filter","message_template":"cache: CACHE_INVALIDATE enabled unexpectedly: %s","reason":"The CACHE_INVALIDATE filter was manually configured, which is not the expected way to use mod_cache","resolution":"Review your configuration. You should use mod_cache configuration directives rather than directly manipulating the filter chain."},{"function":"cache_invalidate_filter","message_template":"cache: response status to '%s' method is %d (>299), not invalidating cached entity: %s","reason":"A non-successful response to a PUT, POST, or DELETE method is not causing cache invalidation as specified by RFC2616","resolution":"This is normal behavior. Cache invalidation only occurs for successful mutating requests. If you see this frequently, check why your mutating requests are failing."},{"function":"cache_invalidate_filter","message_template":"cache: Invalidating all cached entities in response to '%s' request for %s","reason":"All cached entities related to the URL are being invalidated because of a successful PUT, POST, or DELETE request","resolution":"Information log, no resolution required. This indicates normal cache invalidation behavior for mutating HTTP methods."},{"function":"cache_invalidate_filter","message_template":"cache invalidated by %s","reason":"A cache entry was invalidated by the specified HTTP method (usually PUT, POST, or DELETE)","resolution":"Information log, no resolution required. This indicates normal cache invalidation behavior."},{"function":"cache_filter","message_template":"cache: CACHE filter was added in quick handler mode and will be ignored: %s","reason":"The CACHE filter was manually added to the filter chain when running in quick handler mode, which is not allowed","resolution":"When CacheQuickHandler is On (the default), you cannot use the CACHE filter directly. Either turn off CacheQuickHandler or use the proper cache configuration directives."},{"function":"cache_filter","message_template":"cache: CACHE filter was added twice, or was added where the cache has been bypassed and will be ignored: %s","reason":"The CACHE filter was either added multiple times or added at a point where caching has already been bypassed. The filter will be ignored","resolution":"Review your configuration for duplicate CACHE filter additions or check if another module or configuration is causing caching to be bypassed before this filter."}],"project":"apache\/httpd"}