{"module":"unixd.c","summary":"Core Apache module for Unix-specific functionality including resource limit management, process creation, privilege handling, signal management, and socket operations for Unix\/POSIX systems.","logs":[{"function":"ap_unixd_set_rlimit","message_template":"%s: getrlimit failed","reason":"Logs an error when the system call to get resource limits fails. This typically happens due to system resource constraints or permissions issues.","resolution":"Check system resource settings and ensure Apache has appropriate permissions. May require adjusting kernel parameters or system configuration."},{"function":"ap_unixd_set_rlimit","message_template":"Invalid parameters for %s","reason":"Indicates that incorrect or incomplete parameters were provided for a resource limit configuration directive.","resolution":"Review the resource limit directives in your configuration file. Ensure values are properly specified for both soft and hard limits if required."},{"function":"ap_unixd_set_rlimit","message_template":"Must be uid 0 to raise maximum %s","reason":"Occurs when a non-root user attempts to increase the maximum (hard) resource limit, which requires root privileges.","resolution":"Either run Apache as root during startup (it will drop privileges later), or adjust the resource limits at the system level before starting Apache."},{"function":"ap_unixd_set_rlimit","message_template":"Platform does not support rlimit for %s","reason":"Indicates that the current operating system doesn't support setting the specified resource limit type.","resolution":"This is a platform limitation. Consider upgrading your OS or finding alternative ways to manage the resource constraints for your application."},{"function":"ap_unixd_accept","message_template":"new file descriptor %d is too large; you probably need to rebuild Apache with a larger FD_SETSIZE (currently %d)","reason":"A socket descriptor exceeds the maximum FD_SETSIZE value, which is a compile-time constant. Occurs in high-traffic servers with many connections.","resolution":"Rebuild Apache with a larger FD_SETSIZE or switch to an MPM that uses poll()\/epoll() instead of select(). May require code modifications and recompilation."},{"function":"ap_unixd_accept","message_template":"apr_socket_accept: giving up.","reason":"Occurs when the network layer has been shut down (ENETDOWN). The server cannot continue accepting connections.","resolution":"Check network interface status and system network configuration. This might indicate a serious network failure requiring OS or hardware attention."},{"function":"ap_unixd_accept","message_template":"apr_socket_accept failed for inactive listener","reason":"A socket accept operation failed on a listener that has been marked as inactive, typically during server shutdown or restart.","resolution":"This is an informational message during shutdown\/restart. No action required unless it occurs during normal operation, which would indicate an internal error."},{"function":"ap_unixd_accept","message_template":"apr_socket_accept: (client socket)","reason":"Generic error when accepting a client connection fails for reasons other than those specifically handled.","resolution":"Check system logs for more specific error information. May indicate resource exhaustion, network issues, or configuration problems."},{"function":"ap_unixd_mpm_set_signals","message_template":"sigaction(SIGPIPE)","reason":"Failed to set up signal handler for SIGPIPE, which could lead to server termination when writing to closed connections.","resolution":"This indicates a system-level problem with signal handling. Check system resources and consider OS patches or updates if this occurs frequently."},{"function":"ap_unixd_mpm_set_signals","message_template":"sigaction(SIGXCPU)","reason":"Failed to set up signal handler for SIGXCPU (CPU time limit exceeded), which could affect how the server handles CPU-intensive requests.","resolution":"Check system signal handling capabilities. May indicate OS limitations or resource issues."},{"function":"ap_unixd_mpm_set_signals","message_template":"sigaction(SIGXFSZ)","reason":"Failed to set up signal handler for SIGXFSZ (file size limit exceeded), which affects how the server handles large file operations.","resolution":"Check system signal handling capabilities and file size limits. Consider OS updates if this occurs repeatedly."},{"function":"ap_unixd_mpm_set_signals","message_template":"sigaction(SIGTERM)","reason":"Failed to set up signal handler for SIGTERM, which could prevent the server from shutting down gracefully.","resolution":"This indicates a system-level issue with signal handling. Check system resources and consider OS patches or updates."},{"function":"ap_unixd_mpm_set_signals","message_template":"sigaction(SIGINT)","reason":"Failed to set up signal handler for SIGINT, which could prevent the server from handling keyboard interrupts properly.","resolution":"Check system signal handling capabilities. May require system updates or reconfiguration."},{"function":"ap_unixd_mpm_set_signals","message_template":"sigaction(SIGHUP)","reason":"Failed to set up signal handler for SIGHUP, which could prevent the server from restarting gracefully.","resolution":"Check system signal handling capabilities and available resources. Consider OS updates if persistent."},{"function":"os_init_job_environment","message_template":"The debug mode of Apache should only be started by an unprivileged user!","reason":"Attempting to run Apache in debug mode (one_process) as root, which is a security risk as it would run all requests with root privileges.","resolution":"Start Apache in debug mode as a non-root user. If testing functionality that requires root, consider setting up proper privilege separation instead."},{"function":"os_fork","message_template":"ufork: Possible mis-configuration for user %s - Aborting.","reason":"Failed to fork a child process with the specified user identity on BS2000 systems. Usually indicates a user configuration issue.","resolution":"Check that the specified user exists in the system and that Apache has permissions to switch to that user. Verify BS2000-specific user settings."}],"project":"apache\/httpd"}