{"module":"mpm_mpmt_os2.c","summary":"A multi-process, multi-threaded MPM for OS\/2 that manages server processes and threads. It handles server startup, shutdown, child process management, and thread pool maintenance to ensure optimal performance under various load conditions.","logs":[{"function":"mpmt_os2_run","message_template":"no listening sockets available, shutting down","reason":"The server failed to set up any network sockets to listen for incoming connections, making it impossible to serve requests.","resolution":"Check network configuration, make sure the ports specified are available and not in use by other applications. Verify the Listen directives in the configuration."},{"function":"mpmt_os2_run","message_template":"caught %s, shutting down","reason":"The server received a signal (SIGTERM or another error) that caused it to initiate shutdown.","resolution":"This may be a normal shutdown initiated by an administrator, or it may indicate a crash. Check system logs for additional context if the shutdown was unexpected."},{"function":"master_main","message_template":"%s","reason":"Prints the server description at startup.","resolution":"Informational log, no resolution required."},{"function":"master_main","message_template":"no listening sockets available, shutting down","reason":"The server failed to set up any network sockets to listen for incoming connections in the main parent process.","resolution":"Check network configuration, make sure ports are available and not in use by other applications. Verify the Listen directives in the configuration."},{"function":"master_main","message_template":"failure allocating shared memory, shutting down","reason":"The server couldn't allocate shared memory needed for inter-process communication between parent and child processes.","resolution":"Check the system's shared memory limits and increase if necessary. This could be due to resource constraints on the OS\/2 system."},{"function":"master_main","message_template":"failure creating accept mutex, shutting down","reason":"The server couldn't create a mutex that prevents multiple child processes from simultaneously accepting the same connection.","resolution":"This might indicate system resource exhaustion. Check system limits for semaphores and mutexes, and consider rebooting if system resources appear corrupted."},{"function":"master_main","message_template":"unable to allocate shared memory for scoreboard, exiting","reason":"The server couldn't allocate shared memory for the scoreboard which tracks process and thread status information.","resolution":"Increase available system memory or reduce memory usage by other applications. Check OS\/2 memory settings and limits."},{"function":"master_main","message_template":"%s configured -- resuming normal operations","reason":"Indicates the server has completed startup configuration and is now ready to serve requests.","resolution":"Informational log, no resolution required."},{"function":"master_main","message_template":"Server built: %s","reason":"Displays information about when the server executable was built\/compiled.","resolution":"Informational log, no resolution required."},{"function":"spawn_child","message_template":"error spawning child, slot %d","reason":"The server failed to create a new child process in the designated slot number.","resolution":"Check system resources like maximum processes and available memory. This might occur if the system is under heavy load or if process limits have been reached."},{"function":"set_signals","message_template":"sigaction(SIGTERM)","reason":"The server failed to set up a handler for the SIGTERM signal, which is used for shutting down the server.","resolution":"This indicates a potential problem with the OS\/2 signal handling. Consider restarting the server or checking OS\/2 system health."},{"function":"set_signals","message_template":"sigaction(SIGINT)","reason":"The server failed to set up a handler for the SIGINT signal, which is used for shutting down the server.","resolution":"This indicates a potential problem with the OS\/2 signal handling. Consider restarting the server or checking OS\/2 system health."},{"function":"set_signals","message_template":"sigaction(SIGHUP)","reason":"The server failed to set up a handler for the SIGHUP signal, which is used for graceful restarts.","resolution":"This indicates a potential problem with the OS\/2 signal handling. Graceful restarts might not work properly; consider a full restart if changes need to be applied."},{"function":"set_signals","message_template":"sigaction(SIGUSR1)","reason":"The server failed to set up a handler for the SIGUSR1 signal, which is also used for graceful restarts.","resolution":"This indicates a potential problem with the OS\/2 signal handling. Graceful restarts might not work properly; consider a full restart if changes need to be applied."},{"function":"mpmt_os2_check_config","message_template":"WARNING: StartServers of %d not allowed, increasing to 1.","reason":"The configuration specifies an invalid (negative) value for StartServers directive, which has been automatically adjusted to 1.","resolution":"Modify the configuration to specify a valid value for StartServers (must be at least 1)."},{"function":"mpmt_os2_check_config","message_template":"StartServers of %d not allowed, increasing to 1","reason":"The configuration specifies an invalid (negative) value for StartServers directive, which has been automatically adjusted to 1.","resolution":"Modify the configuration to specify a valid value for StartServers (must be at least 1)."},{"function":"mpmt_os2_check_config","message_template":"WARNING: MinSpareThreads of %d not allowed, increasing to 1 to avoid almost certain server failure. Please read the documentation.","reason":"The configuration specifies an invalid (less than 1) value for MinSpareThreads, which has been automatically increased to 1 to prevent server failure.","resolution":"Review the server documentation and set MinSpareThreads to at least 1. Setting this value too low can cause performance issues under load."},{"function":"mpmt_os2_check_config","message_template":"MinSpareThreads of %d not allowed, increasing to 1","reason":"The configuration specifies an invalid (less than 1) value for MinSpareThreads, which has been automatically increased to 1.","resolution":"Modify the configuration to specify a valid value for MinSpareThreads (must be at least 1)."}],"project":"apache\/httpd"}