{"module":"apreq_module_apache2.c","summary":"This module is part of Apache's libapreq2 library that handles HTTP request parsing. It provides functions for accessing cookies, query parameters, and request body content in Apache 2 web server modules.","logs":[{"function":"apache2_jar","message_template":"APREQ_ERROR_NODATA when processing cookies","reason":"No cookies were found in the HTTP request headers. This occurs when the 'Cookie' header is missing in the request.","resolution":"This is an informational status and doesn't require resolution unless cookies are expected. Check client configuration if cookies should be present."},{"function":"apache2_args","message_template":"APREQ_ERROR_NODATA when processing query arguments","reason":"No query string arguments were found in the HTTP request. This occurs when the request URL doesn't contain a query string.","resolution":"This is an informational status and doesn't require resolution unless query parameters are expected. Check that the client is sending the expected query string."},{"function":"apache2_parser_set","message_template":"APREQ_ERROR_NOTEMPTY when setting parser","reason":"Attempt to set a parser when one is already set. This could indicate a programming error in the calling code.","resolution":"Check the calling code to ensure it's not trying to set the parser multiple times. Clear the existing parser before setting a new one if this is intentional."},{"function":"apache2_brigade_limit_set","message_template":"APREQ_ERROR_MISMATCH when setting brigade limit","reason":"Attempt to decrease the brigade limit after request processing has begun, or after some data has already been read.","resolution":"Set the brigade limit earlier in the request processing cycle or ensure the new limit is larger than the current one."},{"function":"apache2_read_limit_set","message_template":"APREQ_ERROR_MISMATCH when setting read limit","reason":"Attempt to decrease the read limit after too much data has already been read, or when the new limit is smaller than bytes already read.","resolution":"Set the read limit earlier in the request processing cycle, before any data has been read, or ensure the new limit is larger than bytes already read."},{"function":"apache2_temp_dir_set","message_template":"APREQ_ERROR_NOTEMPTY when setting temp directory","reason":"Attempt to set the temporary directory after request processing has begun or when a directory is already set.","resolution":"Set the temporary directory earlier in the request processing cycle, before any data has been processed."}],"project":"apache\/httpd"}