{"module":"mod_actions.c","summary":"This module executes scripts based on MIME type or HTTP method. It provides 'Action' directive to map content types to scripts and 'Script' directive to map HTTP methods to scripts, allowing custom handling of requests based on their characteristics.","logs":[{"function":"add_action","message_template":"unrecognized option '%s'","reason":"This error occurs when a user specifies an option other than 'virtual' in the Action directive configuration. Likely due to a typographical error or misunderstanding of available options.","resolution":"Check the Apache configuration and ensure the correct syntax is used for the Action directive. The only valid option is 'virtual' - other options should be removed or corrected."},{"function":"set_script","message_template":"TRACE not allowed for Script","reason":"This error occurs when attempting to configure a script handler for the HTTP TRACE method, which is not allowed for security reasons. The TRACE method can potentially expose sensitive information.","resolution":"Remove any Script directives that attempt to handle the TRACE method. Consider using a different HTTP method for your application's needs."},{"function":"set_script","message_template":"Could not register method '%s' for Script","reason":"This error occurs when the server fails to register a custom HTTP method specified in a Script directive. This typically happens in .htaccess contexts where registering new methods is restricted.","resolution":"If using .htaccess, stick to standard HTTP methods. Custom HTTP methods should be defined in the server or virtual host configuration. Ensure the method name is valid and properly formatted."},{"function":"action_handler","message_template":"File does not exist: %s","reason":"This informational message is logged when a non-virtual action is triggered but the requested file does not exist on the filesystem. This could happen due to misconfiguration or missing files.","resolution":"Check that the file referenced in the request actually exists on the server. If using content-type based actions, ensure the mapping is correct. For method-based scripts, verify paths and permissions."}],"project":"apache\/httpd"}