{"module":"mod_speling.c","summary":"A module that attempts to correct misspelled URLs in HTTP requests. It can fix capitalization, character transposition, omission, or insertion errors, and either redirects directly to the corrected URL or provides a list of possible matches.","logs":[{"function":"check_speling","message_template":"Fixed spelling: %s to %s from %s","reason":"Logs when a single unambiguous spelling correction is found and a redirect is sent. Includes the original URL, corrected URL, and referrer information.","resolution":"This is an informational log indicating successful URL correction. No resolution needed, but if this appears frequently for the same URLs, consider adding redirects or fixing links on the referring page."},{"function":"check_speling","message_template":"Fixed spelling: %s to %s%s","reason":"Logs when a single unambiguous spelling correction is found and a redirect is sent, but no referrer information is available.","resolution":"This is an informational log indicating successful URL correction. No resolution needed, but if this appears frequently, consider adding permanent redirects for common misspellings."},{"function":"check_speling","message_template":"Spelling fix: %s: %d candidates from %s","reason":"Logs when multiple possible spelling corrections are found and a '300 Multiple Choices' response is sent. Includes the original URL, number of alternatives, and referrer information.","resolution":"This is an informational log. If this appears frequently for the same URL, consider adding a specific redirect for that URL or fixing links on the referring page."},{"function":"check_speling","message_template":"Spelling fix: %s: %d candidates%s","reason":"Logs when multiple possible spelling corrections are found and a '300 Multiple Choices' response is sent, but no referrer information is available.","resolution":"This is an informational log. If this appears frequently, consider adding permanent redirects for common misspellings."},{"function":"check_speling","message_template":"The document name you requested (<code>%s<\/code>) could not be found on this server.\nHowever, we found documents with names similar to the one you requested.","reason":"Part of the HTML response sent when multiple possible spelling corrections are found. This is displayed to the user in the browser.","resolution":"This is part of the user-facing response, not an error that needs resolution. If users report seeing this page frequently, consider adding redirects for common misspellings."},{"function":"check_speling","message_template":"Please consider informing the owner of the referring page <tt>%s<\/tt> about the broken link.","reason":"Part of the HTML response when there's a referrer available. Suggests that users notify the referring page owner about the broken link.","resolution":"This is part of the user-facing response. If this appears in logs frequently with the same referrer, consider contacting the owner of that site to fix their links."}],"project":"apache\/httpd"}