{"module":"http_alias.c","summary":"Manages URL aliases and redirects in Apache HTTP Server, providing functionality to map URLs to different filesystem paths or redirect clients to different URLs. Supports both exact matches and regular expressions for flexible URL manipulation.","logs":[{"function":"add_alias_internal","message_template":"The %s directive in %s at line %d will probably never match because it overlaps an earlier %sAlias%s.","reason":"Warns when an alias directive will likely never be reached because it's shadowed by an earlier, more general alias directive that will match first.","resolution":"Review your alias configuration and reorder or adjust the overlapping aliases to ensure each has a chance to match when appropriate."},{"function":"add_alias","message_template":"Cannot parse alias expression '%s': %s","reason":"Occurs when the alias expression contains syntax errors or other issues that prevent it from being parsed correctly.","resolution":"Check the alias expression syntax and correct any errors. Verify that any variables or functions used are properly defined."},{"function":"add_alias_internal","message_template":"Regular expression could not be compiled.","reason":"The regular expression provided for AliasMatch or ScriptAliasMatch has syntax errors or is otherwise invalid.","resolution":"Review and correct the regular expression syntax. Use a regex tester to validate the pattern before configuring it in Apache."},{"function":"add_redirect_internal","message_template":"Regular expression could not be compiled.","reason":"The regular expression provided for RedirectMatch has syntax errors or is otherwise invalid.","resolution":"Review and correct the regular expression syntax. Use a regex tester to validate the pattern before configuring it in Apache."},{"function":"add_redirect_internal","message_template":"URL to redirect to is missing","reason":"A Redirect directive was configured without specifying a destination URL.","resolution":"Add the missing destination URL to the Redirect directive."},{"function":"add_redirect_internal","message_template":"Redirect to non-URL","reason":"The redirect target is not a valid URL and doesn't start with a slash, making it invalid as both absolute URL and path.","resolution":"Ensure the redirect target is either an absolute URL (starting with http:\/\/ or similar) or an absolute path (starting with \/)."},{"function":"add_redirect_internal","message_template":"Redirect URL not valid for this status","reason":"A URL was provided for a redirect status that doesn't support URLs (like 410 Gone).","resolution":"Remove the URL for status codes that don't support it, or change to an appropriate redirect status code."},{"function":"add_redirect_internal","message_template":"Cannot parse redirect expression '%s': %s","reason":"The redirect expression contains syntax errors or other issues that prevent it from being parsed correctly.","resolution":"Check the redirect expression syntax and correct any errors. Verify that any variables or functions used are properly defined."},{"function":"try_alias","message_template":"Can't evaluate alias expression: %s","reason":"An error occurred when evaluating the alias expression at runtime, possibly due to undefined variables or function errors.","resolution":"Review the alias expression and check server logs for more details about the specific evaluation error. Ensure all referenced variables exist."},{"function":"try_redirect","message_template":"Can't evaluate redirect expression: %s","reason":"An error occurred when evaluating the redirect expression at runtime, possibly due to undefined variables or function errors.","resolution":"Review the redirect expression and check server logs for more details about the specific evaluation error. Ensure all referenced variables exist."},{"function":"try_alias_list","message_template":"Regex substitution in '%s' failed. Replacement too long?","reason":"The substitution part of a regular expression redirect or alias couldn't be applied, possibly because the resulting string would be too long.","resolution":"Simplify the regular expression or ensure that the replacement pattern doesn't generate excessively large strings."},{"function":"try_alias_list","message_template":"Cannot map %s to file","reason":"The system couldn't map the requested URI to a file, likely due to security constraints or invalid path combinations.","resolution":"Check that the alias target paths are correctly configured and accessible to the Apache process. Verify that path security settings aren't preventing the mapping."},{"function":"translate_alias_redir","message_template":"incomplete redirection target of '%s' for URI '%s' modified to '%s'","reason":"A relative redirect URL was converted to an absolute URL, as Apache needs to provide absolute URLs in Location headers for redirects.","resolution":"This is an informational message. If you want to avoid this automatic conversion, either use absolute URLs in your redirects or consider enabling the RedirectRelative option."},{"function":"translate_alias_redir","message_template":"cannot redirect '%s' to '%s'; target is not a valid absoluteURI or abs_path","reason":"The system tried to redirect to a destination that is neither an absolute URL nor an absolute path, which is invalid per HTTP standards.","resolution":"Modify your redirect configuration to use either an absolute URL (starting with http:\/\/) or an absolute path (starting with \/)."},{"function":"fixup_redir","message_template":"incomplete redirection target of '%s' for URI '%s' modified to '%s'","reason":"A relative redirect URL was converted to an absolute URL during the fixup phase, as Apache needs to provide absolute URLs in Location headers.","resolution":"This is an informational message. If you want to avoid this automatic conversion, either use absolute URLs in your redirects or consider enabling the RedirectRelative option."},{"function":"fixup_redir","message_template":"cannot redirect '%s' to '%s'; target is not a valid absoluteURI or abs_path","reason":"During the fixup phase, the system tried to redirect to a destination that is neither an absolute URL nor an absolute path.","resolution":"Modify your redirect configuration to use either an absolute URL (starting with http:\/\/) or an absolute path (starting with \/)."}],"project":"apache\/httpd"}