{"module":"mod_imagemap.c","summary":"Apache module for handling image maps in HTML pages, allowing clickable regions in images to link to different URLs. It processes map files defining regions (polygons, circles, rectangles, points) and their target URLs, and either redirects to the appropriate URL when an area is clicked or generates a menu of options.","logs":[{"function":"imap_url","message_template":"invalid base directive in map file: %s","reason":"Logs an error when the base URL in the map file is invalid, typically when it has no slash but is combined with a relative URL path that starts with '..\/'.","resolution":"Check the map file and ensure the base directive contains a valid URL structure. Make sure relative paths are properly formatted and not breaking URL construction."},{"function":"imap_url","message_template":"invalid directory name in map file: %s","reason":"Logs an error when trying to combine the base URL with a relative path, but the directory structure is invalid.","resolution":"Verify that directory references in the map file are correct and that relative paths (especially '..\/' sequences) don't violate URL structure rules."},{"function":"imap_handler_internal","message_template":"map file %s, line %d syntax error: requires at least two fields","reason":"Logs an error when a line in the map file does not contain at least two space-delimited fields (directive and value).","resolution":"Check the map file at the specified line number and ensure each non-comment, non-blank line has at least a directive and a value field."},{"function":"imap_handler_internal","message_template":"[an internal server error occurred]","reason":"An error message sent to the user in the HTML output when there's a server error while generating a menu.","resolution":"Check Apache error logs for more specific details about the error. This is a general fallback message when something fails after headers have been sent."},{"function":"imap_reply","message_template":"error","reason":"A directive in the map file specifically requesting an error response from the server.","resolution":"This is by design when the map file specifies 'error' as the action. If not intended, modify the map file to use a different action."},{"function":"imap_reply","message_template":"nocontent","reason":"A directive in the map file requesting that the client should keep its current page (HTTP 204 No Content).","resolution":"This is by design when the map file specifies 'nocontent' as the action. If not intended, modify the map file to use a different action."}],"project":"apache\/httpd"}