{"module":"mod_negotiation.c","summary":"The content negotiation module for Apache servers that selects the most appropriate content version (by language, encoding, character set, or type) based on client preferences expressed in HTTP headers.","logs":[{"function":"read_type_map","message_template":"cannot access type map file: %s","reason":"Logs an error when the server cannot access the specified type map file. This could be due to file permissions or an incorrect path.","resolution":"Check that the file exists with appropriate permissions for the server user. Verify the path to the file in server configuration."},{"function":"lcase_header_name_return_body","message_template":"Syntax error in type map, no ':' in %s for header %s","reason":"Logs an error when a type map header line is missing a colon character, making it invalid syntax.","resolution":"Check the format of the type map file and ensure each header has the format 'Header: value'. Fix any malformed header lines."},{"function":"lcase_header_name_return_body","message_template":"Syntax error in type map --- no header body: %s for %s","reason":"Logs an error when a type map header has no body (content after the colon).","resolution":"Check the type map file and ensure each header has actual content after the colon. Fix any empty header values."},{"function":"get_entry","message_template":"Parse error in type map, Content-Length: '%s' in %s is invalid.","reason":"The Content-Length header in the type map file contains a non-numeric value or is otherwise unparseable.","resolution":"Ensure the Content-Length value in the type map file is a valid positive number."},{"function":"get_body","message_template":"Syntax error in type map, no end tag '%s' found in %s for Body: content.","reason":"The Body section in the type map file is missing its end tag, which is required to terminate the body content properly.","resolution":"Add the missing end tag for the Body section in the type map file. The end tag should match the start tag specified."},{"function":"read_types_multi","message_template":"Negotiation: discovered file(s) matching request: %s (None could be negotiated).","reason":"Files matching the multiviews pattern were found, but none could be negotiated based on client preferences or server configuration.","resolution":"Check that the variants available have appropriate types, languages, or encodings that match what clients are likely to request. Verify the client's Accept headers."},{"function":"best_match","message_template":"no acceptable variant: %s","reason":"Content negotiation failed to find a variant that satisfied the requirements from the client's Accept headers.","resolution":"Add more variants that match client preferences or adjust LanguagePriority settings. Consider enabling ForceLanguagePriority to allow fallbacks."},{"function":"set_force_priority","message_template":"Cannot combine ForceLanguagePriority options with None","reason":"Configuration error: attempting to combine the 'None' option with other ForceLanguagePriority options, which is not allowed.","resolution":"Correct the ForceLanguagePriority directive in your configuration to either use 'None' alone or remove 'None' when using other options."},{"function":"set_force_priority","message_template":"Cannot combine ForceLanguagePriority options None and Prefer","reason":"Configuration error: attempting to use both 'None' and 'Prefer' options together in ForceLanguagePriority, which is not allowed.","resolution":"Choose either 'None' or 'Prefer' for your ForceLanguagePriority directive, but not both."},{"function":"set_force_priority","message_template":"Cannot combine ForceLanguagePriority options None and Fallback","reason":"Configuration error: attempting to use both 'None' and 'Fallback' options together in ForceLanguagePriority, which is not allowed.","resolution":"Choose either 'None' or 'Fallback' for your ForceLanguagePriority directive, but not both."},{"function":"set_force_priority","message_template":"Invalid ForceLanguagePriority option","reason":"Configuration error: specified an unrecognized option for the ForceLanguagePriority directive.","resolution":"Use only valid options for ForceLanguagePriority: 'None', 'Prefer', or 'Fallback'."},{"function":"is_variant_better_rvsa","message_template":"Variant: file=%s type=%s lang=%s sourceq=%1.3f mimeq=%1.3f langq=%1.3f charq=%1.3f encq=%1.3f q=%1.5f definite=%d","reason":"Debug information showing variant selection details using the RVSA algorithm (only appears if NEG_DEBUG is enabled).","resolution":"Informational log, no resolution required. Useful for debugging content negotiation issues."},{"function":"is_variant_better","message_template":"Variant: file=%s type=%s lang=%s sourceq=%1.3f mimeq=%1.3f langq=%1.3f langidx=%d charq=%1.3f encq=%1.3f","reason":"Debug information showing variant selection details using Apache's standard negotiation algorithm (only appears if NEG_DEBUG is enabled).","resolution":"Informational log, no resolution required. Useful for debugging content negotiation issues."},{"function":"parse_negotiate_header","message_template":"dont_fiddle_headers=%d use_rvsa=%d ua_supports_trans=%d send_alternates=%d, may_choose=%d","reason":"Debug information showing negotiation parameters parsed from the Negotiate request header (only appears if NEG_DEBUG is enabled).","resolution":"Informational log, no resolution required. Useful for debugging content negotiation issues."}],"project":"apache\/httpd"}