{"module":"mod_dir.c","summary":"This module handles directory index files (like index.html) and trailing-slash redirects in Apache HTTP Server. It processes directory requests, provides configurable index file lists, manages slash redirects, and offers fallback resources when files aren't found.","logs":[{"function":"configure_slash","message_template":"DirectorySlash only accepts ON, OFF, or 'NotFound'","reason":"This error occurs when an invalid value is provided for the DirectorySlash directive in server configuration files. The server was expecting one of the three valid options.","resolution":"Check the server configuration and ensure DirectorySlash is set to either 'ON', 'OFF', or 'NotFound'. Fix the typo or invalid value in the configuration file."},{"function":"configure_redirect","message_template":"DirectoryIndexRedirect only accepts values between 300 and 399","reason":"This error occurs when a numeric value outside the valid HTTP redirect status code range (300-399) is provided for the DirectoryIndexRedirect directive.","resolution":"Modify the server configuration to use a valid HTTP redirect status code between 300 and 399, or use one of the named options (ON, OFF, permanent, temp, seeother)."},{"function":"configure_redirect","message_template":"DirectoryIndexRedirect ON|OFF|permanent|temp|seeother|3xx","reason":"This error occurs when an invalid value is provided for the DirectoryIndexRedirect directive. The provided value doesn't match any of the accepted keywords or numeric formats.","resolution":"Update the configuration to use one of the valid values: 'ON', 'OFF', 'permanent', 'temp', 'seeother', or a valid 3xx status code."},{"function":"fixup_dir","message_template":"HTTP_MOVED_PERMANENTLY (301)","reason":"A redirect is issued when a directory is requested without a trailing slash. This helps standardize URLs and ensures relative links in pages work correctly.","resolution":"This is normal behavior. If you're seeing unexpected redirects, check the DirectorySlash configuration. Set it to 'OFF' to disable these redirects or 'NotFound' to return 404 instead."},{"function":"fixup_dir","message_template":"HTTP_NOT_FOUND (404)","reason":"This status is returned when DirectorySlash is set to 'NotFound' and a directory is requested without a trailing slash, or when none of the configured index files exist.","resolution":"Ensure the requested directory exists and contains at least one of the configured index files, or adjust the DirectorySlash configuration if the slash behavior is not desired."},{"function":"fixup_dir","message_template":"dir-index-names","reason":"This note is set to record which index filenames were considered when processing a directory request. It's primarily used by other modules like mod_autoindex.","resolution":"This is an informational note, not an error. No resolution required unless you're developing a module that depends on this information."}],"project":"apache\/httpd"}