{"module":"slotmem_plain.c","summary":"This module implements a plain memory slot allocation mechanism for Apache HTTP Server. It provides functions to create, attach to, and manage blocks of memory divided into fixed-size slots, with support for grabbing and releasing slots as needed.","logs":[{"function":"slotmem_create","message_template":"anonymous","reason":"Used as the default name for slot memory instances when no name is provided. This could appear in logs if a module creates a slot memory without specifying a name.","resolution":"If seeing many anonymous slot memory instances, consider explicitly naming them for better tracking and debugging."},{"function":"slotmem_do","message_template":"APR_ENOSHMAVAIL","reason":"Error returned when the memory instance is NULL, indicating that shared memory is not available.","resolution":"Check that the slot memory was properly initialized before use. Might indicate memory allocation failures or attempts to use a slot memory that hasn't been created yet."},{"function":"slotmem_create","message_template":"APR_ENOSHMAVAIL","reason":"Error returned when memory allocation fails during slot memory creation.","resolution":"Check system memory availability and Apache memory limits. May require increasing available memory or reducing memory usage elsewhere."},{"function":"slotmem_attach","message_template":"APR_ENOSHMAVAIL","reason":"Error returned when attempting to attach to a non-existent slot memory instance or when no name is provided.","resolution":"Verify that the slot memory name is correct and that it exists before attempting to attach to it."},{"function":"slotmem_dptr","message_template":"APR_ENOSHMAVAIL","reason":"Error returned when the slot memory instance is NULL or the requested slot pointer cannot be obtained.","resolution":"Check that the slot memory was properly initialized and that memory allocation succeeded during creation."},{"function":"slotmem_dptr","message_template":"APR_EINVAL","reason":"Error returned when attempting to access a slot ID that is out of bounds.","resolution":"Verify that slot IDs being used are within the range of available slots (0 to num-1)."},{"function":"slotmem_get","message_template":"APR_ENOSHMAVAIL","reason":"Error returned when the slot memory instance is NULL.","resolution":"Check that the slot memory was properly initialized before attempting to get data from it."},{"function":"slotmem_get","message_template":"APR_EINVAL","reason":"Error returned when attempting to get data from a slot ID that is out of bounds.","resolution":"Verify that slot IDs being used are within the range of available slots (0 to num-1)."},{"function":"slotmem_get","message_template":"APR_NOTFOUND","reason":"Error returned when attempting to get data from a slot that is not in use in a pre-grab slot memory.","resolution":"For pre-grab slot memories, ensure that slots are properly grabbed before attempting to access their data."},{"function":"slotmem_put","message_template":"APR_ENOSHMAVAIL","reason":"Error returned when the slot memory instance is NULL.","resolution":"Check that the slot memory was properly initialized before attempting to put data into it."},{"function":"slotmem_put","message_template":"APR_EINVAL","reason":"Error returned when attempting to put data into a slot ID that is out of bounds.","resolution":"Verify that slot IDs being used are within the range of available slots (0 to num-1)."},{"function":"slotmem_put","message_template":"APR_NOTFOUND","reason":"Error returned when attempting to put data into a slot that is not in use in a pre-grab slot memory.","resolution":"For pre-grab slot memories, ensure that slots are properly grabbed before attempting to modify their data."},{"function":"slotmem_grab","message_template":"APR_ENOSHMAVAIL","reason":"Error returned when the slot memory instance is NULL.","resolution":"Check that the slot memory was properly initialized before attempting to grab a slot."},{"function":"slotmem_grab","message_template":"APR_EINVAL","reason":"Error returned when no free slots are available.","resolution":"Consider increasing the number of slots allocated during creation or releasing unused slots. Check for memory leaks where slots are grabbed but never released."},{"function":"slotmem_fgrab","message_template":"APR_ENOSHMAVAIL","reason":"Error returned when the slot memory instance is NULL.","resolution":"Check that the slot memory was properly initialized before attempting to force-grab a slot."},{"function":"slotmem_fgrab","message_template":"APR_EINVAL","reason":"Error returned when attempting to force-grab a slot ID that is out of bounds.","resolution":"Verify that slot IDs being used are within the range of available slots (0 to num-1)."},{"function":"slotmem_release","message_template":"APR_ENOSHMAVAIL","reason":"Error returned when the slot memory instance is NULL.","resolution":"Check that the slot memory was properly initialized before attempting to release a slot."},{"function":"slotmem_release","message_template":"APR_EINVAL","reason":"Error returned when attempting to release a slot ID that is out of bounds.","resolution":"Verify that slot IDs being used are within the range of available slots (0 to num-1)."},{"function":"slotmem_release","message_template":"APR_NOTFOUND","reason":"Error returned when attempting to release a slot that is not currently in use.","resolution":"Check for logic errors where the same slot is released multiple times or released without being grabbed first."},{"function":"ap_slotmem_plain_register_hook","message_template":"plain","reason":"Provider name registered with Apache for the plain slot memory implementation.","resolution":"Informational only, no resolution required."},{"function":"storage","message_template":"plainmem","reason":"Identifier for the plain memory slot allocation provider in Apache.","resolution":"Informational only, no resolution required."}],"project":"apache\/httpd"}