{"module":"authz_dbm_module.c","summary":"This Apache module provides authorization capabilities based on DBM group files. It allows administrators to restrict access to resources based on group membership stored in DBM databases, supporting both standard group authorization and file-group authorization patterns.","logs":[{"function":"get_dbm_grp","message_template":"could not load '%s' dbm library: %s","reason":"Logs an error when the specified DBM library type could not be loaded. This happens when the DBM driver requested is unavailable or invalid.","resolution":"Ensure the specified DBM type is valid and the corresponding library is installed on the system. Check for typos in the AuthzDBMType directive."},{"function":"get_dbm_grp","message_template":"could not open dbm (type %s) group access file: %s","reason":"Logs an error when the DBM group file cannot be opened. This could be due to permission issues, file not existing, or corruption.","resolution":"Verify the group file exists, has correct permissions, and is a valid DBM file of the specified type. Check the path in the AuthDBMGroupFile directive."},{"function":"dbmgroup_check_authorization","message_template":"No group file was specified in the configuration","reason":"Logs an error when authorization is attempted but no AuthDBMGroupFile directive was provided in the configuration.","resolution":"Add an AuthDBMGroupFile directive to your configuration to specify the DBM file containing group information."},{"function":"dbmgroup_check_authorization","message_template":"Authorization of user %s to access %s failed, reason: user doesn't appear in DBM group file (%s).","reason":"Logs an error when a user attempting to access a resource is not found in the DBM group file at all.","resolution":"Ensure the user is added to the DBM group file. Check for typos in the username or issues with the group file format."},{"function":"dbmgroup_check_authorization","message_template":"authz_dbm authorize: require dbm-group: Can't evaluate require expression: %s","reason":"Logs an error when the require expression for dbm-group authorization could not be evaluated due to syntax or other errors.","resolution":"Check the syntax of the 'require dbm-group' directive in your configuration. Ensure the expression is valid and properly formed."},{"function":"dbmgroup_check_authorization","message_template":"Authorization of user %s to access %s failed, reason: user is not part of the 'require'ed group(s).","reason":"Logs an error when a user is found in the DBM group file but is not a member of any of the groups specified in the 'require' directive.","resolution":"Add the user to one of the required groups in the DBM group file, or modify the 'require' directive to include groups the user is a member of."},{"function":"dbmfilegroup_check_authorization","message_template":"No group file was specified in the configuration","reason":"Logs an error when file-group authorization is attempted but no AuthDBMGroupFile directive was provided in the configuration.","resolution":"Add an AuthDBMGroupFile directive to your configuration to specify the DBM file containing group information needed for file-group authorization."},{"function":"dbmfilegroup_check_authorization","message_template":"Authorization of user %s to access %s failed, reason: user doesn't appear in DBM group file (%s).","reason":"Logs an error when a user attempting to access a resource is not found in the DBM group file during file-group authorization.","resolution":"Ensure the user is added to the DBM group file. Check for typos in the username or issues with the group file format."},{"function":"dbmfilegroup_check_authorization","message_template":"Authorization of user %s to access %s failed, reason: user is not part of the 'require'ed group(s).","reason":"Logs an error when a user is found in the DBM group file but is not a member of the group that owns the requested file.","resolution":"Add the user to the group that owns the requested file in the DBM group file, or change the file ownership to a group the user belongs to."},{"function":"dbm_parse_config","message_template":"Cannot parse expression in require line: ","reason":"Returns an error when the expression in a 'require' directive cannot be parsed due to syntax errors.","resolution":"Check the syntax of the expression in your 'require' directive. Ensure it follows the correct format and does not contain syntax errors."}],"project":"apache\/httpd"}