{"module":"autht_core_module.c","summary":"This module implements authentication token provider aliasing in Apache, allowing administrators to create aliases for authentication providers. It provides the <AuthtProviderAlias> directive which enables reusing an existing authentication provider under a different name with potentially different configuration.","logs":[{"function":"authaliassection","message_template":"> directive missing closing '>'","reason":"This error occurs when the <AuthtProviderAlias> directive is not properly closed with a '>' character. Likely due to a syntax error in the Apache configuration file.","resolution":"Check the Apache configuration file and ensure all <AuthtProviderAlias> directives are properly closed with a '>' character."},{"function":"authaliassection","message_template":"> directive requires additional arguments","reason":"This error occurs when the <AuthtProviderAlias> directive is used without specifying the required provider name and alias name arguments. Likely due to incomplete configuration syntax.","resolution":"Update the configuration to include both the provider name and the alias name as arguments, such as '<AuthtProviderAlias ProviderName AliasName>'."},{"function":"authaliassection","message_template":"The alias provider name must be different from the base provider name.","reason":"This error occurs when attempting to create a provider alias with the same name as the original provider. The alias must have a different name to avoid confusion and circular references.","resolution":"Choose a different name for the alias provider that is distinct from the base provider name."},{"function":"authaliassection","message_template":"The alias provider %s has already be registered previously as either a base provider or an alias provider.","reason":"This error occurs when trying to create an alias with a name that is already in use by another provider or alias. Provider names and aliases must be unique in the system.","resolution":"Choose a different, unique name for the alias provider that isn't already used in the configuration."},{"function":"authaliassection","message_template":"Unknown Authn provider: %s","reason":"This error occurs when the specified base provider name doesn't exist in the system. The base provider must be a valid, registered authentication provider.","resolution":"Check the spelling of the provider name and ensure the module providing it is loaded. You may need to load additional authentication modules or fix typos in the configuration."}],"project":"apache\/httpd"}