{"module":"auth_form_module.c","summary":"This module implements form-based authentication for Apache HTTP Server. It allows users to authenticate via HTML forms instead of browser-based authentication dialogs, stores credentials in sessions, and handles login\/logout redirections and form processing.","logs":[{"function":"add_authn_provider","message_template":"Unknown Authn provider: %s","reason":"A configured authentication provider couldn't be found. This happens when the authentication provider specified in the configuration doesn't exist or isn't loaded.","resolution":"Ensure the specified provider module is loaded or correct the provider name in the configuration. Check if the module provides the specified authentication method."},{"function":"add_authn_provider","message_template":"The '%s' Authn provider doesn't support Form Authentication","reason":"The specified authentication provider exists but doesn't support the check_password function required for form authentication.","resolution":"Use an authentication provider that supports form authentication, or modify your configuration to use a different authentication method supported by this provider."},{"function":"check_string","message_template":" cannot be empty, or contain '=' or '&'.","reason":"A form field name in the configuration contains invalid characters or is empty. These characters could interfere with form parameter parsing.","resolution":"Choose field names that don't contain '=' or '&' characters and aren't empty. Update your configuration to use valid field names."},{"function":"set_cookie_form_size","message_template":"AuthCookieFormSize must be a size in bytes, or zero.","reason":"The AuthCookieFormSize directive has an invalid value that isn't a positive integer or zero.","resolution":"Set AuthCookieFormSize to a valid numeric value representing the maximum size in bytes, or zero for the default size."},{"function":"set_login_required_location","message_template":"Could not parse login required expression '%s': %s","reason":"The login required expression provided in the configuration contains syntax errors and cannot be parsed.","resolution":"Check the syntax of your AuthFormLoginRequiredLocation expression and correct any errors. Refer to the Apache expression syntax documentation."},{"function":"set_login_success_location","message_template":"Could not parse login success expression '%s': %s","reason":"The login success expression provided in the configuration contains syntax errors and cannot be parsed.","resolution":"Check the syntax of your AuthFormLoginSuccessLocation expression and correct any errors. Refer to the Apache expression syntax documentation."},{"function":"set_logout_location","message_template":"Could not parse logout required expression '%s': %s","reason":"The logout expression provided in the configuration contains syntax errors and cannot be parsed.","resolution":"Check the syntax of your AuthFormLogoutLocation expression and correct any errors. Refer to the Apache expression syntax documentation."},{"function":"get_form_auth","message_template":"form parsed, but username field '%s' was missing or empty, unauthorized","reason":"The login form was submitted but the username field was missing or empty. This often occurs when users submit a form without entering their username.","resolution":"Ensure the login form includes the correctly named username field and that users enter their username. Check the AuthFormUsername directive matches the form field name."},{"function":"get_form_auth","message_template":"form parsed, but password field '%s' was missing or empty, unauthorized","reason":"The login form was submitted but the password field was missing or empty. This occurs when users submit a form without entering their password.","resolution":"Ensure the login form includes the correctly named password field and that users enter their password. Check the AuthFormPassword directive matches the form field name."},{"function":"check_authn","message_template":"no authn provider configured","reason":"No authentication provider has been configured for the form authentication. The module cannot authenticate users without a provider.","resolution":"Configure at least one authentication provider using the AuthFormProvider directive in your Apache configuration."},{"function":"check_authn","message_template":"user '%s': authentication failure for \"%s\": password Mismatch","reason":"A user attempted to log in but provided an incorrect password. This is a common authentication failure scenario.","resolution":"This is a normal security event when users mistype passwords. If it happens repeatedly for the same user, it might indicate a brute force attack. Consider implementing rate limiting or account lockouts."},{"function":"check_authn","message_template":"user '%s' not found: %s","reason":"A login attempt was made with a username that doesn't exist in the authentication provider's database.","resolution":"Verify the user exists in the authentication database. If legitimate users encounter this error, check if they're using the correct username or if there are case sensitivity issues."},{"function":"authenticate_form_authn","message_template":"form auth cannot be used for proxy requests due to XSS risk, access denied: %s","reason":"Form authentication was attempted for a proxy request, which is blocked due to cross-site scripting (XSS) security risks.","resolution":"Form authentication cannot be used with forward proxies. If you need authentication for proxied requests, use a different authentication method such as Basic or Digest authentication."},{"function":"authenticate_form_authn","message_template":"need AuthName: %s","reason":"Form authentication requires an authentication realm (AuthName) but none was specified in the configuration.","resolution":"Add an AuthName directive to your configuration to specify the authentication realm. This is required for form authentication to function properly."},{"function":"authenticate_form_login_handler","message_template":"the form-login-handler only supports the POST method for %s","reason":"A request was made to the form login handler using a method other than POST, which is not supported for security reasons.","resolution":"Ensure your login form uses method=\"POST\". GET requests to the login handler are not allowed to prevent credentials from appearing in URLs or server logs."},{"function":"authenticate_form_login_handler","message_template":"Can't evaluate login success expression: %s","reason":"The login was successful, but there was an error evaluating the login success expression that determines where to redirect the user.","resolution":"Check your AuthFormLoginSuccessLocation expression for runtime errors. Verify that any variables referenced in the expression exist and have valid values."},{"function":"authenticate_form_login_handler","message_template":"Can't evaluate login required expression: %s","reason":"There was an error evaluating the login required expression that determines where to redirect unauthenticated users.","resolution":"Check your AuthFormLoginRequiredLocation expression for runtime errors. Verify that any variables referenced in the expression exist and have valid values."},{"function":"authenticate_form_logout_handler","message_template":"Can't evaluate logout expression: %s","reason":"A logout was processed, but there was an error evaluating the logout expression that determines where to redirect the user after logout.","resolution":"Check your AuthFormLogoutLocation expression for runtime errors. Verify that any variables referenced in the expression exist and have valid values."},{"function":"authenticate_form_redirect_handler","message_template":"internal redirect to method '%s' and body mimetype '%s' for the uri: %s","reason":"Debug message indicating an internal redirect is being performed after form authentication, with the specified method and body MIME type.","resolution":"This is an informational log, no resolution required. It helps in debugging the flow of requests after authentication."},{"function":"authenticate_form_redirect_handler","message_template":"internal redirect requested but one or all of method, mimetype or body are NULL: %s","reason":"An internal redirect was attempted after form authentication, but required information about the request method, MIME type, or body is missing.","resolution":"Check that your form includes the necessary fields for method, MIME type, and body if you're using the redirect handler. Verify the AuthFormMethod, AuthFormMimetype, and AuthFormBody directives are correctly configured."},{"function":"authenticate_form_post_config","message_template":"You must load mod_session to enable the mod_auth_form functions","reason":"The mod_auth_form module requires mod_session but it's not loaded or available. Form authentication cannot function without session support.","resolution":"Add LoadModule session_module modules\/mod_session.so to your Apache configuration before loading mod_auth_form. Check that mod_session is properly installed."},{"function":"authenticate_form_post_config","message_template":"You must load mod_request to enable the mod_auth_form functions","reason":"The mod_auth_form module requires mod_request but it's not loaded or available. Form authentication cannot function without request filtering support.","resolution":"Add LoadModule request_module modules\/mod_request.so to your Apache configuration before loading mod_auth_form. Check that mod_request is properly installed."}],"project":"apache\/httpd"}