{"module":"mod_authz_dbd.c","summary":"An Apache module providing database-driven user authorization with support for group-based access control, login\/logout actions, and redirection mechanisms. It allows administrators to configure SQL queries for authenticating users and determining group membership directly from a database.","logs":[{"function":"authz_dbd_prepare","message_template":"You must load mod_dbd to enable AuthzDBD functions","reason":"The module depends on mod_dbd which is not loaded. This error occurs when attempting to prepare database queries without mod_dbd being available.","resolution":"Load the mod_dbd module in your Apache configuration before loading mod_authz_dbd."},{"function":"authz_dbd_login","message_template":"No query configured for %s!","reason":"The login or logout action is attempted but no SQL query has been configured for it. This typically happens when AuthzDBDQuery directive is missing.","resolution":"Add the AuthzDBDQuery directive to your configuration with an appropriate SQL query for the authentication action."},{"function":"authz_dbd_login","message_template":"No db handle available for %s! Check your database access","reason":"The module could not obtain a database connection handle. This might be due to database connectivity issues or misconfiguration of mod_dbd.","resolution":"Verify that mod_dbd is properly configured, database credentials are correct, and the database server is accessible."},{"function":"authz_dbd_login","message_template":"Error retrieving Query for %s!","reason":"The prepared SQL query could not be retrieved from the hash table. This might indicate that query preparation failed or the query name is incorrect.","resolution":"Check that the AuthzDBDQuery has been correctly prepared and the database driver supports prepared statements."},{"function":"authz_dbd_login","message_template":"authz_dbd: %s of user %s updated %d rows","reason":"This warning indicates the SQL query affected a number of rows other than one. This could suggest a database integrity issue if multiple user records were updated.","resolution":"Review your database schema and ensure user records are unique. Modify your query to ensure it affects only a single row per user."},{"function":"authz_dbd_login","message_template":"authz_dbd: query for %s failed; user %s [%s]","reason":"The SQL query execution for user login\/logout action failed. The third parameter contains the database-specific error message.","resolution":"Check the full error message for details. Common issues include SQL syntax errors, permission problems, or database server issues."},{"function":"authz_dbd_login","message_template":"authz_dbd: no redirect query!","reason":"A redirect was attempted after login but the redirect query could not be found. This happens when AuthzDBDRedirectQuery is configured but the query preparation failed.","resolution":"Verify that the AuthzDBDRedirectQuery directive is properly set and the query was successfully prepared at server startup."},{"function":"authz_dbd_login","message_template":"authz_dbd in get_row; action=%s user=%s [%s]","reason":"An error occurred while retrieving a row from the database result set during a login\/logout action. The third parameter contains the database-specific error.","resolution":"Investigate the specific database error reported. This could be related to data type mismatches, connection issues, or result set handling problems."},{"function":"authz_dbd_login","message_template":"authz_dbd\/redirect for %s of %s [%s]","reason":"An error occurred while executing the redirect query after a successful login\/logout. The third parameter contains the database-specific error.","resolution":"Check the database error message and verify the redirect query syntax. Ensure the user has proper permissions to execute the query."},{"function":"authz_dbd_group_query","message_template":"No query configured for dbd-group!","reason":"The module is attempting to check user group membership but no SQL query has been configured for it. This typically happens when AuthzDBDQuery is missing for group authorization.","resolution":"Configure the AuthzDBDQuery directive with an appropriate SQL query that retrieves user group memberships from the database."},{"function":"authz_dbd_group_query","message_template":"No db handle available for dbd-query! Check your database access","reason":"The module could not obtain a database connection handle for group membership queries. This might be due to database connectivity issues or misconfiguration of mod_dbd.","resolution":"Verify mod_dbd configuration, database credentials, and server accessibility. Check Apache error logs for more specific mod_dbd errors."},{"function":"authz_dbd_group_query","message_template":"Error retrieving query for dbd-group!","reason":"The prepared SQL query for group membership checking could not be retrieved. This might indicate that query preparation failed or the query name is incorrect.","resolution":"Check that the AuthzDBDQuery has been correctly prepared and the database driver supports prepared statements."},{"function":"authz_dbd_group_query","message_template":"authz_dbd in get_row; user_group query for user=%s [%s]","reason":"An error occurred while retrieving user group information from the database result set. The second parameter contains the database-specific error.","resolution":"Investigate the specific database error. Common issues include data type mismatches, result column configuration, or database connectivity problems."},{"function":"authz_dbd_group_query","message_template":"authz_dbd, in groups query for %s [%s]","reason":"An error occurred while executing the SQL query to retrieve user groups. The second parameter contains the database-specific error message.","resolution":"Check the database error message for details. Verify the query syntax and ensure the user has appropriate privileges to execute the query."},{"function":"dbdgroup_check_authorization","message_template":"authz_dbd authorize: require dbd-group: Can't evaluate require expression: %s","reason":"The module failed to evaluate the expression in the 'require dbd-group' directive. This typically happens when the expression syntax is invalid or contains undefined variables.","resolution":"Review the require directive expression syntax. Ensure all variables used in the expression are properly defined and the expression is well-formed."}],"project":"apache\/httpd"}