{"module":"access_compat_module.c","summary":"This module provides backward compatibility for older Apache access control directives including Order, Allow, Deny, and Satisfy. It implements client access control based on client hostname, IP address, or environment variables.","logs":[{"function":"order","message_template":"unknown order","reason":"This error occurs during server configuration when an invalid value is specified for the 'Order' directive. Only 'allow,deny', 'deny,allow', or 'mutual-failure' are valid options.","resolution":"Check the configuration file and correct the Order directive to use one of the valid values: 'allow,deny', 'deny,allow', or 'mutual-failure'."},{"function":"satisfy","message_template":"Satisfy either 'any' or 'all'.","reason":"This error occurs during server configuration when an invalid value is specified for the 'Satisfy' directive. Only 'any' or 'all' are valid options.","resolution":"Modify the Satisfy directive in the configuration file to use either 'any' or 'all'."},{"function":"allow_cmd","message_template":"allow and deny must be followed by 'from'","reason":"This error occurs during server configuration when the 'Allow' or 'Deny' directive isn't properly followed by the 'from' keyword. The correct syntax requires 'from' before specifying hosts or IP addresses.","resolution":"Correct the syntax in the configuration file by ensuring 'from' follows the Allow or Deny directive, e.g., 'Allow from all' or 'Deny from 192.168.1.0\/24'."},{"function":"allow_cmd","message_template":"An IP address was expected","reason":"This error occurs during server configuration when a malformed IP address or subnet is provided in Allow or Deny directives. The specified value doesn't conform to IP address syntax.","resolution":"Check and correct the IP address format in the Allow or Deny directive. Ensure the IP address follows proper notation (e.g., 192.168.1.1 or 10.0.0.0\/24)."},{"function":"allow_cmd","message_template":"%pm","reason":"This error occurs during server configuration when there's a failure creating an IP subnet from the provided specification. The exact error details are formatted with the %pm specifier.","resolution":"Review the specific error message and correct the IP subnet notation in your Allow or Deny directive. Common issues include invalid netmask format or incorrect IP address format."},{"function":"allow_cmd","message_template":"No comments are allowed here","reason":"This error occurs during server configuration when a comment character (#) is found in an IP address specification within Allow or Deny directives.","resolution":"Remove any comments or '#' characters from within the IP address specification. If you need to add comments, place them on a new line or at the end of the directive line, not within the IP address itself."},{"function":"check_dir_access","message_template":"client denied by server configuration: %s%s","reason":"This runtime error occurs when a client request is denied access based on the configured Allow, Deny, and Order directives. The client's IP address or hostname doesn't meet the access requirements.","resolution":"If this is an unexpected denial, review your access control configuration. Check the Order, Allow, and Deny directives to ensure they implement the intended access policy. You may need to add the client's IP address to an Allow directive or remove it from a Deny directive."}],"project":"apache\/httpd"}