{"module":"authn_core.c","summary":"This Apache module is responsible for core authentication functionality, managing AuthType and AuthName directives, and providing a mechanism for aliasing authentication providers. It handles the parsing and evaluation of authentication expressions and ensures proper authentication module loading.","logs":[{"function":"authaliassection","message_template":"> directive missing closing '>'","reason":"The AuthnProviderAlias directive is malformed and missing the closing '>' character. This occurs when the directive syntax is incorrect in the configuration.","resolution":"Check the Apache configuration file and correct the syntax of the AuthnProviderAlias directive, ensuring it has a properly closing '>' character."},{"function":"authaliassection","message_template":"> directive requires additional arguments","reason":"The AuthnProviderAlias directive was provided but with insufficient arguments. It requires both a provider name and an alias name.","resolution":"Modify the AuthnProviderAlias directive to include both the provider name and the alias name as required arguments."},{"function":"authaliassection","message_template":"The alias provider name must be different from the base provider name.","reason":"An attempt was made to create an authentication provider alias with the same name as the base provider, which is not allowed.","resolution":"Choose a different name for the alias provider that is distinct from the base provider name."},{"function":"authaliassection","message_template":"The alias provider %s has already be registered previously as either a base provider or an alias provider.","reason":"An attempt was made to register an authentication provider alias, but a provider with that alias name already exists.","resolution":"Use a unique name for each authentication provider alias to avoid conflicts with existing providers."},{"function":"authaliassection","message_template":"Unknown Authn provider: %s","reason":"The authentication provider specified in the AuthnProviderAlias directive is not registered or available in the system.","resolution":"Ensure the referenced authentication provider is properly installed and loaded in your Apache configuration."},{"function":"set_authname","message_template":"Cannot parse expression '%s' in AuthName: %s","reason":"The expression provided for the AuthName directive could not be parsed, likely due to syntax errors or invalid expression format.","resolution":"Review and correct the AuthName expression syntax in your configuration. Check for missing quotes, incorrect operators, or invalid variables."},{"function":"set_authtype","message_template":"Cannot parse expression '%s' in AuthType: %s","reason":"The expression provided for the AuthType directive could not be parsed, likely due to syntax errors or invalid expression format.","resolution":"Review and correct the AuthType expression syntax. Ensure the expression follows the Apache expression syntax rules and contains valid operators and variables."},{"function":"authn_ap_auth_type","message_template":"AuthType expression could not be evaluated: %s","reason":"The AuthType expression was parsed successfully but could not be evaluated at runtime, possibly due to variables that don't exist or runtime errors.","resolution":"Check that all variables used in the AuthType expression are available at runtime. Consider simplifying the expression or verifying the values of referenced variables."},{"function":"authn_ap_auth_name","message_template":"AuthName expression could not be evaluated: %s","reason":"The AuthName expression was parsed successfully but failed during runtime evaluation, possibly due to missing variables or runtime errors.","resolution":"Verify that all variables in the AuthName expression exist at runtime and contain expected values. Simplify complex expressions or provide fallback values for optional variables."},{"function":"authenticate_no_user","message_template":"AuthType %s configured without corresponding module","reason":"An authentication type was specified in the configuration, but no authentication module is loaded to support that type. This creates an unsatisfiable authentication requirement.","resolution":"Load the appropriate authentication module for the specified AuthType, or remove\/change the AuthType directive if authentication is not required."}],"project":"apache\/httpd"}