{"module":"authz_core_module.c","summary":"Core Apache authorization module that handles access control directives like Require, RequireAll, RequireAny, etc. It processes authorization rules, evaluates conditions, and determines if a request should be allowed or denied.","logs":[{"function":"authz_alias_check_authorization","message_template":"no alias provider found for '%s' (BUG?)","reason":"An alias provider referenced in the configuration could not be found in the server's provider list. This is likely a programming error in the module.","resolution":"This is likely a bug in the module that needs to be reported to Apache developers. Check configuration for misspelled alias names."},{"function":"authz_require_alias_section","message_template":"> directive missing closing '>'","reason":"A syntax error in the configuration where a directive is missing its closing bracket.","resolution":"Fix the syntax error in the Apache configuration file by adding the missing closing bracket to the directive."},{"function":"authz_require_alias_section","message_template":"> directive requires additional arguments","reason":"The authorization directive is missing required arguments needed for proper function.","resolution":"Update the configuration to include all required arguments for the directive. Check the Apache documentation for the correct syntax."},{"function":"authz_require_alias_section","message_template":"When several arguments (%s %s...) are passed to a %s directive, they must be enclosed in quotation marks. Otherwise, only the first one is taken into account","reason":"Multiple arguments to a directive need to be enclosed in quotes, but weren't properly formatted.","resolution":"Enclose multiple arguments in quotation marks in the directive configuration."},{"function":"authz_require_alias_section","message_template":"Unknown Authz provider: %s","reason":"The specified authorization provider is not registered or doesn't exist.","resolution":"Verify that the authorization provider is correctly spelled and that the corresponding module is loaded in the Apache configuration."},{"function":"add_authz_provider","message_template":"Unknown Authz provider: %s","reason":"The specified authorization provider in a Require directive is not registered or doesn't exist.","resolution":"Check that the authorization provider name is spelled correctly and that the corresponding module (like mod_authz_user, mod_authz_groupfile, etc.) is loaded."},{"function":"add_authz_provider","message_template":"The '%s' Authz provider is not supported by any of the loaded authorization modules","reason":"The authorization provider exists but doesn't implement the required check_authorization function.","resolution":"Ensure that all required authorization modules are loaded, or switch to a different authorization provider that is supported."},{"function":"add_authz_provider","message_template":"negative %s directive has no effect in %s directive","reason":"A negated authorization directive has no effect when used within an OR-type container.","resolution":"Restructure your authorization configuration to use the negated directive in an AND-type container where it will have an effect."},{"function":"add_authz_section","message_template":"> directive missing closing '>'","reason":"A syntax error in the configuration where a section directive is missing its closing bracket.","resolution":"Fix the syntax error in the Apache configuration file by adding the missing closing bracket to the section directive."},{"function":"add_authz_section","message_template":"> directive doesn't take additional arguments","reason":"Extra arguments were provided to a directive that doesn't accept them.","resolution":"Remove the additional arguments from the directive in the configuration."},{"function":"add_authz_section","message_template":"%s directive has no effect in %s directive","reason":"A directive is used in a context where it has no effect, such as a nested directive with conflicting logic.","resolution":"Restructure your authorization configuration to use directives in contexts where they will have an effect."},{"function":"add_authz_section","message_template":"%s directive contains no authorization directives","reason":"An authorization container was defined but contains no actual authorization directives inside it.","resolution":"Add appropriate authorization directives inside the container or remove the empty container from the configuration."},{"function":"authz_merge_sections","message_template":"%s must be one of: Off | And | Or","reason":"An invalid value was specified for the AuthMerging directive.","resolution":"Change the AuthMerging directive value to one of the allowed values: Off, And, or Or."},{"function":"authz_core_check_section","message_template":"%s directive contains only negative authorization directives","reason":"An authorization section contains only negated (Require not) directives, which is invalid as it would always deny access.","resolution":"Add at least one positive authorization directive to the section, or restructure your authorization logic."},{"function":"authorize_user_core","message_template":"AuthType configured with no corresponding authorization directives","reason":"Authentication type is configured but no authorization directives are present to control access.","resolution":"Add appropriate Require directives to your configuration to specify who is allowed access after authentication."},{"function":"authorize_user_core","message_template":"authorization result: granted (no directives)","reason":"Access is granted because no authorization directives were specified to restrict access.","resolution":"This is an informational message. If you intended to restrict access, add appropriate Require directives to your configuration."},{"function":"authorize_user_core","message_template":"authorization failure (no authenticated user): %s","reason":"Authorization failed because the request has no authenticated user, but the authorization directives require one.","resolution":"Ensure the client provides valid authentication credentials before accessing the resource, or modify your authorization configuration if anonymous access should be allowed."},{"function":"authorize_user_core","message_template":"client denied by server configuration: %s%s","reason":"The client's request was denied based on the authorization configuration.","resolution":"If the client should have access, modify the authorization configuration to grant access to this client or resource."},{"function":"authorize_user_core","message_template":"user %s: authorization failure for \"%s\": ","reason":"An authenticated user was denied access to a resource because they didn't match the authorization criteria.","resolution":"If the user should have access, update your authorization directives to include this user or their group\/attributes."},{"function":"expr_check_authorization","message_template":"Error evaluating expression in 'Require expr': %s","reason":"An error occurred while evaluating a conditional expression in a 'Require expr' directive.","resolution":"Check and correct the syntax of the expression in the 'Require expr' directive. Make sure all referenced variables and functions are available."},{"function":"apply_authz_sections","message_template":"authorization result of %s: %s (directive limited to other methods)","reason":"The authorization directive does not apply to the current HTTP method, so its result has no effect.","resolution":"This is an informational debug message. If you expected this directive to affect the current method, check your <Limit> directives or method-specific configurations."},{"function":"apply_authz_sections","message_template":"authorization result of %s: %s","reason":"Shows the result of evaluating an authorization directive or container, for debugging purposes.","resolution":"This is an informational debug message that helps track the authorization decision process. No action is required."},{"function":"all_parse_config","message_template":"Argument for 'Require all' must be 'granted' or 'denied'","reason":"The 'Require all' directive was used with an invalid argument. Only 'granted' or 'denied' are valid options.","resolution":"Change the argument for 'Require all' to either 'granted' (to allow all requests) or 'denied' (to deny all requests)."},{"function":"method_parse_config","message_template":"Invalid Method '%s'","reason":"An unrecognized HTTP method was specified in a method-based authorization directive.","resolution":"Correct the method name in your configuration. Use standard HTTP methods like GET, POST, PUT, DELETE, etc."}],"project":"apache\/httpd"}