{"module":"mod_authz_host.c","summary":"Apache module for host-based access control that provides authorization based on client IP address, hostname, forward DNS lookup, and local connections. It allows configuration directives like 'Require ip', 'Require host', 'Require forward-dns', and 'Require local' to restrict access to server resources.","logs":[{"function":"ip_parse_config","message_template":"'require ip' requires an argument","reason":"An attempt was made to use 'Require ip' directive without specifying any IP addresses or networks. This is an invalid configuration.","resolution":"Add one or more valid IP addresses or CIDR notations as arguments to the 'Require ip' directive."},{"function":"ip_parse_config","message_template":"ip address '%s' appears to be invalid","reason":"The specified IP address in a 'Require ip' directive doesn't conform to valid IP address syntax.","resolution":"Correct the IP address format in the configuration file. Ensure it's a valid IPv4 or IPv6 address or CIDR notation."},{"function":"ip_parse_config","message_template":"ip address '%s' appears to be invalid: %pm","reason":"The specified IP address in a 'Require ip' directive is invalid, with a specific error message provided.","resolution":"Review the error message details and correct the IP address format in the configuration file according to the specific issue mentioned."},{"function":"host_check_authorization","message_template":"access check of '%s' to %s failed, reason: unable to get the remote host name","reason":"The server couldn't resolve the DNS name of the client. This often happens when reverse DNS is not properly configured or when DNS servers are unreachable.","resolution":"Ensure DNS is properly configured for reverse lookups, or consider using 'Require ip' instead of 'Require host' if DNS resolution is unreliable. Check if the client has a proper PTR record."},{"function":"host_check_authorization","message_template":"authz_host authorize: require host: Can't evaluate require expression: %s","reason":"The expression in a 'Require host' directive couldn't be evaluated, likely due to syntax errors in the expression.","resolution":"Check the syntax of the host expression in the 'Require host' directive and correct any errors. Refer to Apache documentation for proper expression syntax."},{"function":"host_check_authorization","message_template":"authz_host authorize: dubious empty 'Require host %s' with only comment","reason":"A 'Require host' directive was found with only comments and no actual host specifications, which is likely a configuration mistake.","resolution":"Add actual hostnames to the 'Require host' directive or remove it if not needed. Comments should follow valid hostnames, not replace them."},{"function":"host_check_authorization","message_template":"authz_host authorize: ignoring comment in 'Require host %s'","reason":"A comment was found in a 'Require host' directive and will be ignored. Only the part before the '#' symbol will be processed.","resolution":"This is just a warning. No action is required, but you may want to separate comments from directives for clarity in your configuration files."},{"function":"forward_dns_check_authorization","message_template":"authz_host authorize: require forward-dns: Can't evaluate require expression: %s","reason":"The expression in a 'Require forward-dns' directive couldn't be evaluated, likely due to syntax errors.","resolution":"Check the syntax of the expression in the 'Require forward-dns' directive and correct any errors. Refer to Apache documentation for proper expression syntax."},{"function":"forward_dns_check_authorization","message_template":"access check for %s as '%s': %s","reason":"Debug log entry showing the result of an access check using forward DNS lookup. Shows client IP, hostname being checked against, and result (yes\/no).","resolution":"This is an informational debug message. No action required unless you're troubleshooting access issues. If denials are unexpected, verify DNS configuration and hostnames in 'Require forward-dns' directives."},{"function":"forward_dns_check_authorization","message_template":"No sockaddr info for \"%s\"","reason":"DNS resolution failed for a hostname specified in a 'Require forward-dns' directive. The server couldn't resolve the hostname to an IP address.","resolution":"Verify that the hostname is correct and can be resolved. Check DNS server configuration and connectivity. If the hostname is temporary, consider using IP-based authentication instead."},{"function":"host_parse_config","message_template":"Cannot parse expression in require line: ","reason":"The expression in a 'Require host' or 'Require forward-dns' directive contains syntax errors that prevent it from being parsed.","resolution":"Review and correct the syntax of the expression in the 'Require' directive according to Apache's expression syntax rules. Common errors include mismatched quotes or parentheses."}],"project":"apache\/httpd"}