{"module":"allowhandlers_module.c","summary":"Apache module that restricts which handlers can process requests. It allows administrators to configure permitted handlers using the AllowHandlers directive, denying requests that use non-allowed handlers with HTTP_FORBIDDEN responses.","logs":[{"function":"ah_fixups","message_template":"Handler 'forbidden' denied by server configuration: URI %s (file %s)","reason":"Logs when a request tries to use the special 'forbidden' handler which is always denied. This is a security measure to prevent access to restricted resources.","resolution":"This is an expected security behavior when a request attempts to use the 'forbidden' handler. Check the URI in the message to see what resource was being accessed and investigate if this might be a security incident."},{"function":"ah_fixups","message_template":"Handler '%s' denied by server configuration: URI %s (file %s)","reason":"Logs when a request uses a handler that is not in the allowed list (or is in the denied list). The server blocks access based on handler restrictions.","resolution":"If this handler should be allowed, update your AllowHandlers configuration to include this handler. If the request is legitimate, you may need to add the handler to the allowed list in your Apache configuration."},{"function":"ah_fixups","message_template":"Handler denied by server configuration: No handler set for URI %s (file %s)","reason":"Logs when a request with no handler specified is denied access based on the configuration rules. This happens when the 'none' handler is not allowed.","resolution":"If files without explicit handlers should be accessible, update your AllowHandlers configuration to include the 'none' handler. This typically affects static files that don't require special processing."},{"function":"set_allowed_handlers","message_template":"AllowHandlers: No handler name given","reason":"Configuration error when the AllowHandlers directive is used without specifying any handlers.","resolution":"Correct the AllowHandlers directive in your Apache configuration by providing at least one handler name or 'all'."},{"function":"set_allowed_handlers","message_template":"Handler name 'forbidden' cannot be changed.","reason":"Configuration error when trying to allow the special 'forbidden' handler, which is always denied by design.","resolution":"Remove 'forbidden' from your AllowHandlers directive. This handler is reserved and always denied for security reasons."},{"function":"set_allowed_handlers","message_template":"'all' not possible with specific handler names","reason":"Configuration error when the AllowHandlers directive includes both 'all' and specific handler names.","resolution":"Either use 'all' alone to allow all handlers, or specify only the handlers you want to allow, but not both in the same directive."},{"function":"set_allowed_handlers","message_template":"'not' must come before specific handler names","reason":"Configuration error when the 'not' keyword is not placed at the beginning of the AllowHandlers directive arguments.","resolution":"Rewrite your AllowHandlers directive with 'not' as the first argument, followed by the handlers you want to exclude."}],"project":"apache\/httpd"}