{"module":"authn_file_module.c","summary":"This Apache module provides file-based authentication functionality, allowing user authentication against a text file containing usernames and passwords. It supports both basic password validation and digest authentication by retrieving password hashes from the specified AuthUserFile.","logs":[{"function":"check_password","message_template":"AuthUserFile not specified in the configuration","reason":"This error occurs when authentication is attempted but no password file path is configured. Likely due to missing 'AuthUserFile' directive in the server configuration.","resolution":"Add the 'AuthUserFile' directive to the appropriate Apache configuration file, pointing to a valid password file. Example: 'AuthUserFile \/path\/to\/passwords'"},{"function":"check_password","message_template":"Could not open password file: %s","reason":"This error occurs when the module cannot open the specified password file. Likely due to file permissions, incorrect path, or the file not existing.","resolution":"Check that the specified password file exists and has appropriate read permissions for the Apache process. Verify the path is correct and that the filesystem is accessible."},{"function":"get_realm_hash","message_template":"AuthUserFile not specified in the configuration","reason":"This error occurs when digest authentication is attempted but no password file path is configured. Likely due to missing 'AuthUserFile' directive in the server configuration.","resolution":"Add the 'AuthUserFile' directive to the appropriate Apache configuration file, pointing to a valid password file. Example: 'AuthUserFile \/path\/to\/passwords'"},{"function":"get_realm_hash","message_template":"Could not open password file: %s","reason":"This error occurs when the module cannot open the specified password file during digest authentication. Likely due to file permissions, incorrect path, or the file not existing.","resolution":"Check that the specified password file exists and has appropriate read permissions for the Apache process. Verify the path is correct and that the filesystem is accessible."}],"project":"apache\/httpd"}