{"module":"allowmethods_module.c","summary":"This Apache module restricts which HTTP methods can be executed against a server, allowing administrators to specify allowed methods via the AllowMethods directive. When unauthorized methods are used, the module returns a 405 (Method Not Allowed) status.","logs":[{"function":"am_check_access","message_template":"client method denied by server configuration: '%s' to %s%s","reason":"Logs an error when a client attempts to use an HTTP method that is not allowed by the server configuration. This occurs when the requested method is not in the allowed methods list.","resolution":"Ensure the required HTTP method is added to the AllowMethods directive for the relevant directory or location. For example, add 'AllowMethods GET POST' to allow both GET and POST methods."},{"function":"am_allowmethods","message_template":"AllowMethods: No method or 'reset' keyword given","reason":"Returned when the AllowMethods directive is used without any arguments. The directive requires either a list of methods or the 'reset' keyword.","resolution":"Add specific HTTP methods to the AllowMethods directive (e.g., 'AllowMethods GET POST') or use 'AllowMethods reset' to disable the module's restrictions."},{"function":"am_allowmethods","message_template":"Either all methods in AllowMethods must start with + or -, or no methods may.","reason":"Returned when there's inconsistent use of the +\/- syntax in the AllowMethods directive. Either all methods must use this syntax or none of them should.","resolution":"Be consistent with the syntax - either use modifiers for all methods (e.g., 'AllowMethods +GET +POST') or don't use modifiers at all (e.g., 'AllowMethods GET POST')."},{"function":"am_allowmethods","message_template":"AllowMethods: Invalid Method '%s'","reason":"Returned when an unknown or invalid HTTP method is specified in the AllowMethods directive. This usually indicates a typo or an attempt to use a non-standard method.","resolution":"Check the spelling of the HTTP method and ensure it's a standard method recognized by Apache (GET, POST, HEAD, OPTIONS, PUT, DELETE, etc.)."}],"project":"apache\/httpd"}