{"module":"mod_authz_owner.c","summary":"This Apache module provides authorization based on file ownership, allowing requests to be authorized if the authenticated user matches the owner of the requested file. It also provides functionality to get the file group for use by other authorization modules.","logs":[{"function":"fileowner_check_authorization","message_template":"'Require file-owner' is not supported on this platform.","reason":"Logs when the file-owner authorization feature is attempted on a platform that doesn't support user identification (APR_HAS_USER is not defined). Likely due to limitations in the operating system or APR library configuration.","resolution":"This is a platform limitation. Consider using a different authorization mechanism or switching to a platform that supports user identification."},{"function":"fileowner_check_authorization","message_template":"Authorization of user %s to access %s failed, reason: %s","reason":"General error template used when any file-owner authorization check fails. This includes platform support issues, file stat failures, owner lookup failures, or when the owner doesn't match the user.","resolution":"Check the specific reason in the log message. Resolution depends on the specific failure - could be file permissions, file system issues, or a legitimate authorization denial."},{"function":"fileowner_check_authorization","message_template":"no filename available","reason":"Logs when trying to authorize against file ownership but the filename (r->filename) is not available. Likely due to configuration issues or request processing problems.","resolution":"Verify Apache configuration, especially related to document root and path mapping. Check if any modules that should set the filename are functioning correctly."},{"function":"fileowner_check_authorization","message_template":"could not stat file ","reason":"Logs when the system call to get file information (stat) fails. Likely due to permissions, file system issues, or the file not existing.","resolution":"Verify file exists and is accessible by the Apache process. Check file system permissions and potential mount issues."},{"function":"fileowner_check_authorization","message_template":"no file owner information available","reason":"Logs when the file metadata doesn't include owner information. This can happen on some file systems or with certain mount options.","resolution":"Check the file system type and mount options. Some network or special file systems may not support owner information. Consider using a different authorization method."},{"function":"fileowner_check_authorization","message_template":"could not get name of file owner","reason":"Logs when the system can't convert the numeric user ID to a username. Likely due to issues with user database or permissions.","resolution":"Verify that the Apache process has access to user database (like \/etc\/passwd or NSS). Check if the user ID exists in the system."},{"function":"fileowner_check_authorization","message_template":"file owner %s does not match.","reason":"Logs when authorization fails because the authenticated user is not the owner of the file. This is a legitimate denial case rather than an error.","resolution":"Either change the file ownership to match the user, or have the user authenticate as the file owner. This is normal behavior when authorization should be denied."},{"function":"authz_owner_get_file_group","message_template":"no filename available","reason":"Logs when trying to get file group but the filename (r->filename) is not available. Similar to the same error in fileowner_check_authorization.","resolution":"Verify Apache configuration, especially related to document root and path mapping. Check if any modules that should set the filename are functioning correctly."},{"function":"authz_owner_get_file_group","message_template":"could not stat file ","reason":"Logs when the system call to get file information (stat) fails when looking for group information. Similar to the same error in fileowner_check_authorization.","resolution":"Verify file exists and is accessible by the Apache process. Check file system permissions and potential mount issues."},{"function":"authz_owner_get_file_group","message_template":"no file group information available","reason":"Logs when the file metadata doesn't include group information. This can happen on some file systems or with certain mount options.","resolution":"Check the file system type and mount options. Some network or special file systems may not support group information. Consider using a different authorization method."},{"function":"authz_owner_get_file_group","message_template":"could not get name of file group","reason":"Logs when the system can't convert the numeric group ID to a group name. Likely due to issues with group database or permissions.","resolution":"Verify that the Apache process has access to group database (like \/etc\/group or NSS). Check if the group ID exists in the system."}],"project":"apache\/httpd"}