{"module":"mod_authz_user.c","summary":"This Apache module implements authorization based on user identity. It provides two authorization providers: 'user' to check if a specific user is authorized, and 'valid-user' to check if any authenticated user is authorized.","logs":[{"function":"user_check_authorization","message_template":"authz_user authorize: require user: Can't evaluate require expression: %s","reason":"The module failed to evaluate the expression specified in the 'require user' directive. This typically occurs when the expression syntax is invalid or contains references to undefined variables.","resolution":"Check the syntax of the 'require user' directive in your Apache configuration. Ensure that any variables used are properly defined and available in the current context. The error message should provide more details about the specific evaluation failure."},{"function":"user_check_authorization","message_template":"access to %s failed, reason: user '%s' does not meet 'require'ments for user to be allowed access","reason":"A user tried to access a resource but doesn't match any of the usernames specified in the 'require user' directive. This is a debug-level log entry that records access control rejections.","resolution":"This is typically not an error but part of normal access control. If the user should have access, update your Apache configuration to include this username in the appropriate 'require user' directive for the accessed resource."},{"function":"user_parse_config","message_template":"Cannot parse expression in require line: ","reason":"The module couldn't parse the expression provided in a 'require user' directive during server configuration. This typically happens at startup when Apache is parsing the configuration.","resolution":"Check the syntax of the 'require user' directive in your Apache configuration. Look for syntax errors like unbalanced quotes, missing operators, or malformed expressions. Fix the syntax according to Apache's expression language requirements."}],"project":"apache\/httpd"}