{"module":"mod_authz_groupfile.c","summary":"This Apache module implements group-based authorization using a text file that defines user group memberships. It validates HTTP requests against 'require group' and 'require file-group' directives, allowing or denying access based on whether the authenticated user belongs to the specified groups.","logs":[{"function":"group_check_authorization","message_template":"No group file was specified in the configuration","reason":"The module is configured to use group-based authorization, but no AuthGroupFile directive was specified in the configuration. This prevents the module from validating group membership.","resolution":"Add an AuthGroupFile directive in the server configuration or .htaccess file, pointing to a valid group file."},{"function":"group_check_authorization","message_template":"Could not open group file: %s","reason":"The module couldn't open the specified group file. This could be due to file permissions, incorrect path, or the file doesn't exist.","resolution":"Check that the path in AuthGroupFile directive is correct, the file exists, and the Apache server has read permissions to the file."},{"function":"group_check_authorization","message_template":"Authorization of user %s to access %s failed, reason: user doesn't appear in group file (%s).","reason":"The authenticated user is not listed in any group in the group file, so they cannot be authorized by group membership.","resolution":"Add the user to the appropriate group in the group file. The format should be 'groupname: username1 username2 ...' on each line."},{"function":"group_check_authorization","message_template":"authz_groupfile authorize: require group: Can't evaluate require expression: %s","reason":"There was an error evaluating the expression in the 'require group' directive, likely due to syntax errors in the expression.","resolution":"Check the syntax of the 'require group' directive in your configuration. The expression may contain invalid characters or format."},{"function":"group_check_authorization","message_template":"Authorization of user %s to access %s failed, reason: user is not part of the 'require'ed group(s).","reason":"The user is authenticated and appears in the group file, but is not a member of any of the groups specified in the 'require group' directive.","resolution":"Either add the user to one of the required groups in the group file, or modify the 'require group' directive to include a group the user is already a member of."},{"function":"filegroup_check_authorization","message_template":"No group file was specified in the configuration","reason":"The module is configured to use file-group authorization, but no AuthGroupFile directive was specified. This prevents the module from validating group membership.","resolution":"Add an AuthGroupFile directive in the server configuration or .htaccess file, pointing to a valid group file."},{"function":"filegroup_check_authorization","message_template":"Could not open group file: %s","reason":"The module couldn't open the specified group file for file-group authorization. This could be due to file permissions, incorrect path, or the file doesn't exist.","resolution":"Check that the path in AuthGroupFile directive is correct, the file exists, and the Apache server has read permissions to the file."},{"function":"filegroup_check_authorization","message_template":"Authorization of user %s to access %s failed, reason: user doesn't appear in group file (%s).","reason":"The authenticated user is not listed in any group in the group file when attempting file-group authorization.","resolution":"Add the user to the appropriate group in the group file, particularly to the group that matches the file's group ownership."},{"function":"filegroup_check_authorization","message_template":"Authorization of user %s to access %s failed, reason: user is not part of the 'require'ed file group.","reason":"The authenticated user is not a member of the group that owns the requested file, as required by the 'require file-group' directive.","resolution":"Add the user to the group in the group file that matches the file's group ownership, or change the file's group ownership to match a group the user belongs to."},{"function":"groupfile_parse_config","message_template":"Cannot parse expression in require line: ","reason":"The configuration contains a syntactically invalid expression in a 'require' directive, which prevents the module from properly evaluating authorization rules.","resolution":"Check the syntax of the 'require' directive in your configuration. Fix any malformed expressions or invalid syntax according to Apache's expression format."}],"project":"apache\/httpd"}