{"module":"mpm_winnt.c","summary":"This module implements the Windows NT MPM (Multi-Processing Module) for Apache HTTP Server, handling connection processing using a thread pool model. It manages accepting connections, dispatching connections to worker threads, and handling process\/thread lifecycle events on Windows systems.","logs":[{"function":"child_main","message_template":"Server ran out of threads to serve requests. Consider raising the ThreadsPerChild setting","reason":"This occurs when all worker threads are busy and there are no more free completion contexts available to handle new connections.","resolution":"Increase the ThreadsPerChild directive in Apache configuration to allow more concurrent connections. Alternatively, check if connections are staying open too long or if there's a performance bottleneck causing slow processing."},{"function":"mpm_get_completion_context","message_template":"mpm_get_completion_context: Failed to get a free context within 1 second","reason":"The server is waiting for a worker thread to free a connection context but timed out after 1 second, indicating high server load.","resolution":"This is a diagnostic message that occurs under high load. If it appears frequently, increase ThreadsPerChild setting or investigate performance bottlenecks in your application."},{"function":"mpm_get_completion_context","message_template":"mpm_get_completion_context: WaitForSingleObject failed to get free context","reason":"An error occurred while waiting for a free connection context, likely due to a system resource issue.","resolution":"Check system resources like memory and handle limits. This could indicate a system-level problem with the Windows API or resource exhaustion."},{"function":"mpm_get_completion_context","message_template":"mpm_get_completion_context: CreateEvent failed.","reason":"The server failed to create a Windows event object for connection handling, which is required for async I\/O operations.","resolution":"Check if the system is low on handles or other resources. May require server restart or addressing system resource limitations."},{"function":"mpm_get_completion_context","message_template":"mpm_get_completion_context: Failed to create the transaction pool.","reason":"Memory allocation for the transaction pool failed, likely due to memory exhaustion.","resolution":"Check system memory usage and consider increasing available memory. May also need to tune Apache memory settings to use less memory per connection."},{"function":"winnt_accept","message_template":"winnt_accept: Listen protocol '%s' has no known accept filter. Using 'none' instead","reason":"The protocol specified in a Listen directive doesn't have a corresponding AcceptFilter defined in the server configuration.","resolution":"Define an appropriate AcceptFilter for this protocol in the server configuration, or verify the protocol name is correct in the Listen directive."},{"function":"winnt_accept","message_template":"winnt_accept: 'data' accept filter is no longer supported. Using 'connect' instead","reason":"The 'data' accept filter is deprecated and no longer supported by the server.","resolution":"Update your configuration to use 'connect' instead of 'data' for the AcceptFilter directive."},{"function":"winnt_accept","message_template":"winnt_accept: unrecognized AcceptFilter '%s', only 'data', 'connect' or 'none' are valid. Using 'none' instead","reason":"An invalid AcceptFilter value was specified in the server configuration.","resolution":"Change the AcceptFilter directive to use one of the valid values: 'connect' or 'none'."},{"function":"winnt_accept","message_template":"winnt_accept: getsockname error on listening socket, is IPv6 available?","reason":"Failed to get socket address information for a listening socket, possibly because IPv6 support was expected but not available.","resolution":"Verify IPv6 is properly configured on your system if you're using IPv6 addresses. Otherwise, check for networking configuration issues or disable IPv6 in Apache if not needed."},{"function":"winnt_accept","message_template":"winnt_accept: failed to retrieve AcceptEx, try 'AcceptFilter none'","reason":"The server failed to get a pointer to the AcceptEx function from the Winsock provider, which is needed for optimized connection acceptance.","resolution":"Configure your server to use 'AcceptFilter none' instead. This will use standard accept() calls instead of the optimized AcceptEx function."},{"function":"winnt_accept","message_template":"winnt_accept: failed to retrieve GetAcceptExSockaddrs, try 'AcceptFilter none'","reason":"Failed to get a pointer to the GetAcceptExSockaddrs function, which is needed for the optimized connection processing.","resolution":"Use 'AcceptFilter none' in your server configuration to fall back to standard accept() calls instead of the optimized AcceptEx function."},{"function":"winnt_accept","message_template":"WSAEventSelect() failed.","reason":"The Windows socket API call WSAEventSelect failed, which is needed to monitor socket events.","resolution":"Check for system resource issues or Windows networking problems. May require server restart or system troubleshooting."},{"function":"winnt_accept","message_template":"Child: Accept thread listening on %pI using AcceptFilter %s","reason":"Informational message indicating an accept thread has started and is listening on a specific address with a specific accept filter.","resolution":"Information log, no resolution required"},{"function":"winnt_accept","message_template":"winnt_accept: Failed to allocate an accept socket. Temporary resource constraint? Try again.","reason":"The server couldn't create a new socket to accept connections, possibly due to reaching system limits on file descriptors or sockets.","resolution":"Check system limits for open files\/sockets. May need to increase system ulimit settings or reduce MaxConnectionsPerChild."},{"function":"winnt_accept","message_template":"Child: Encountered too many AcceptEx faults accepting client connections. Possible causes: dynamic address renewal, or incompatible VPN or firewall software.","reason":"AcceptEx is repeatedly failing, which may be caused by network configuration changes, VPN software, or firewall interference.","resolution":"Check for VPN or firewall software that might be interfering with network operations. If using DHCP, frequent IP changes could cause issues. Consider disabling incompatible network software or using 'AcceptFilter none'."},{"function":"winnt_accept","message_template":"winnt_mpm: falling back to 'AcceptFilter none'.","reason":"Due to repeated failures with AcceptEx, the server is automatically switching to the standard accept() method instead.","resolution":"This is an automatic fallback mechanism. If it resolves the issue, consider explicitly setting 'AcceptFilter none' in your configuration to avoid the initial failures."},{"function":"winnt_accept","message_template":"Child: Encountered too many AcceptEx faults accepting client connections.","reason":"Multiple failures occurred when trying to use AcceptEx to accept new connections.","resolution":"Consider using 'AcceptFilter none' in your server configuration to use standard accept() instead of AcceptEx."},{"function":"winnt_accept","message_template":"winnt_accept: Asynchronous AcceptEx failed.","reason":"The asynchronous AcceptEx call failed when trying to accept a new connection.","resolution":"This could be due to network issues or system resource constraints. Check Windows event logs for network-related errors."},{"function":"winnt_accept","message_template":"setsockopt(SO_UPDATE_ACCEPT_CONTEXT) failed.","reason":"Failed to set socket options required for proper functioning of accepted connections.","resolution":"This is often not a critical error. If connections still work, it can be ignored. If problems persist, check for system networking issues."},{"function":"winnt_accept","message_template":"accept() failed, retrying.","reason":"A standard accept() call failed, but the error is considered recoverable, so the server will retry.","resolution":"Information log, no resolution required unless it appears repeatedly. Transient network issues typically resolve automatically."},{"function":"winnt_accept","message_template":"accept() failed.","reason":"A standard accept() call failed with an error that's considered worth logging but may not cause immediate issues.","resolution":"If seen occasionally, this may be normal. If frequent, check for network issues or system resource constraints."},{"function":"winnt_accept","message_template":"Child: Encountered too many accept() resource faults, aborting.","reason":"The server has repeatedly failed to accept connections due to resource constraints, and has decided to exit.","resolution":"Check system resource limits, particularly file descriptors. May need to increase system limits or reduce Apache's resource usage by lowering MaxConnectionsPerChild or similar settings."},{"function":"winnt_accept","message_template":"getsockname failed","reason":"Failed to retrieve local address information for a socket, which may affect logging or virtual host selection.","resolution":"Check system networking configuration. This could indicate network interface issues or system resource problems."},{"function":"winnt_accept","message_template":"getpeername failed","reason":"Failed to retrieve the remote client's address information, which may affect logging or access control.","resolution":"This may happen if a client disconnects very quickly. If persistent, check for network configuration issues or client behavior problems."},{"function":"winnt_accept","message_template":"Child: Accept thread exiting.","reason":"An accept thread is shutting down, possibly due to server shutdown or restart.","resolution":"Information log, no resolution required"},{"function":"winnt_accept","message_template":"Child: GetQueuedCompletionStatus returned %d","reason":"Debug information about the return code from GetQueuedCompletionStatus, used for I\/O completion port operations.","resolution":"Information log, no resolution required unless error codes appear repeatedly, which may indicate system-level issues."},{"function":"child_main","message_template":"Child: Failed to create a listener_shutdown event.","reason":"The server couldn't create a Windows event object needed for signaling listener threads to shut down.","resolution":"Check system resources, particularly handle limits. May indicate serious resource exhaustion that requires server restart or system maintenance."},{"function":"child_main","message_template":"Child: Failed to create a max_requests event.","reason":"The server couldn't create a Windows event object needed for handling MaxConnectionsPerChild functionality.","resolution":"Check system resources, particularly handle limits. Indicates potential resource exhaustion that may require server restart."},{"function":"child_main","message_template":"Child: Failed to open handle to parent process %ld; will not react to abrupt parent termination","reason":"The child process couldn't get a handle to its parent process, which means it won't be notified if the parent dies unexpectedly.","resolution":"Usually not critical, but may indicate privilege issues. The child will still function but may not clean up properly if the parent process terminates abnormally."},{"function":"child_main","message_template":"Child: Failed to acquire the start_mutex. Process will exit.","reason":"The child process couldn't acquire the mutex that controls which child process can accept connections, making it unable to function.","resolution":"Check for system resource issues or other Apache processes that might be interfering. May require restarting Apache or addressing system-wide lock issues."},{"function":"child_main","message_template":"Child: Acquired the start mutex.","reason":"Informational message indicating the child process successfully acquired the start mutex and can begin accepting connections.","resolution":"Information log, no resolution required"},{"function":"child_main","message_template":"Child: Failed to create a ctxpool_wait event.","reason":"The server couldn't create a Windows event object needed for the connection context pool management.","resolution":"Check system resources, particularly handle limits. May indicate serious resource exhaustion that requires server restart."},{"function":"child_main","message_template":"Child: Starting %d worker threads.","reason":"Informational message indicating the child process is creating the specified number of worker threads to handle connections.","resolution":"Information log, no resolution required"},{"function":"child_main","message_template":"Child: thread creation failed. Unable to create all worker threads. Created %d of the %d threads requested with the ThreadsPerChild configuration directive.","reason":"The server couldn't create all the worker threads requested in the configuration, possibly due to system resource constraints.","resolution":"Check system resource usage, particularly memory and thread limits. May need to lower ThreadsPerChild setting or increase system resources."},{"function":"child_main","message_template":"Child: %d threads starting up, %d remain from a prior generation","reason":"Informational message during graceful restart showing how many threads are starting in the new generation versus remaining from the old generation.","resolution":"Information log, no resolution required"},{"function":"child_main","message_template":"Child: WAIT_FAILED -- shutting down server","reason":"A critical error occurred while waiting for child process events, causing the server to shut down.","resolution":"Check system stability and resource availability. May indicate serious system-level issues requiring investigation of Windows event logs or system monitoring."},{"function":"child_main","message_template":"Child: Event handle #%d (%pp) is invalid","reason":"One of the event handles used for child process synchronization has become invalid, indicating a possible memory corruption or resource handling issue.","resolution":"This indicates a potentially serious internal error. Check for module conflicts, memory issues, or system stability problems. May require server restart."},{"function":"child_main","message_template":"Child: Exit event signaled. Child process is ending.","reason":"The child process received a signal to exit and is shutting down gracefully.","resolution":"Information log, no resolution required. This is part of normal shutdown sequence."},{"function":"child_main","message_template":"Child: Parent process exited abruptly. Child process is ending","reason":"The parent process of this child has terminated unexpectedly, so the child is also shutting down.","resolution":"Check why the parent process terminated. Look in server and system logs for errors that might have caused the parent to exit abnormally."},{"function":"child_main","message_template":"Child: Process exiting because it reached MaxConnectionsPerChild. Signaling the parent to restart a new child process.","reason":"This child process has processed the maximum number of connections configured in MaxConnectionsPerChild and is shutting down gracefully.","resolution":"Information log, no resolution required. This is normal behavior when MaxConnectionsPerChild is set to prevent memory leaks or accumulation issues."},{"function":"child_main","message_template":"Child: Released the start mutex","reason":"The child process has released the mutex that controls which child can accept connections, allowing another child to take over.","resolution":"Information log, no resolution required"},{"function":"child_main","message_template":"Child: Failure releasing the start mutex","reason":"The child process encountered an error when trying to release the start mutex during shutdown.","resolution":"Usually not critical during shutdown, but could indicate system resource issues. If persistent across restarts, check for system-level lock problems."},{"function":"child_main","message_template":"Child: Waiting %d more seconds for %d worker threads to finish.","reason":"During shutdown, the child process is waiting for worker threads to complete their current requests before terminating.","resolution":"Information log, no resolution required. If this persists for a long time, long-running requests may be preventing shutdown. Consider adjusting timeout settings."},{"function":"child_main","message_template":"Child: Waiting for %d threads timed out, terminating process.","reason":"The child process waited for worker threads to finish but they didn't complete within the timeout period, so it's forcibly terminating.","resolution":"Check for hung requests or threads that aren't responding. May indicate requests that take too long or deadlocks in application code."},{"function":"child_main","message_template":"Child: All worker threads have exited.","reason":"All worker threads have successfully completed and exited during child process shutdown.","resolution":"Information log, no resolution required. This indicates a clean shutdown sequence."}],"project":"apache\/httpd"}