{"module":"mpm_winnt.c","summary":"The Windows NT Multi-Processing Module handles process management, thread configuration, service management, and restart\/shutdown functionality for Apache HTTP Server on Windows platforms. It manages parent-child process communication, graceful restarts, and interaction with the Windows Service Control Manager.","logs":[{"function":"get_handles_from_parent","message_template":"Child: Unable to retrieve the ready event from the parent","reason":"The child process is unable to receive the ready event handle from the parent process via the pipe, which is necessary for synchronization. Likely due to a broken pipe or process creation issue.","resolution":"Check for process permission issues or memory constraints that might prevent the handle inheritance."},{"function":"get_handles_from_parent","message_template":"Child: Unable to retrieve the exit event from the parent","reason":"The child process is unable to receive the exit event handle from the parent process via the pipe. This event is critical for proper shutdown signaling.","resolution":"Check for pipe communication issues between parent and child processes. May require restarting the server."},{"function":"get_handles_from_parent","message_template":"Child: Unable to retrieve the start_mutex from the parent","reason":"The child process cannot receive the start mutex handle from the parent, which is needed to coordinate process startup.","resolution":"Verify process permissions and available system resources. May need server restart."},{"function":"get_handles_from_parent","message_template":"Child: Unable to access the start_mutex from the parent","reason":"The child received a handle but could not access the start mutex object. This prevents proper process synchronization.","resolution":"Check permissions on the object and ensure the Windows security context allows access."},{"function":"get_handles_from_parent","message_template":"Child: Unable to retrieve the scoreboard from the parent","reason":"The child process cannot receive the scoreboard handle from the parent. The scoreboard is essential for process coordination.","resolution":"Check pipe communication and verify sufficient handle table space in the process."},{"function":"get_handles_from_parent","message_template":"Child: Unable to access the scoreboard from the parent","reason":"The child received a handle but could not access the scoreboard object, which prevents process status tracking.","resolution":"Verify permissions and memory access rights. May require reinstallation if persistent."},{"function":"get_handles_from_parent","message_template":"Child: Unable to reopen the scoreboard from the parent","reason":"The child process cannot reopen the scoreboard in shared memory, which prevents tracking worker threads.","resolution":"Check for memory allocation issues or corruption of shared memory. Restart Apache to reset the scoreboard."},{"function":"get_handles_from_parent","message_template":"Child: Retrieved our scoreboard from the parent.","reason":"Informational message indicating successful retrieval of the scoreboard from the parent process.","resolution":"Information log, no resolution required."},{"function":"send_handles_to_child","message_template":"Parent: Unable to send its generation to the child","reason":"The parent process could not write the generation number to the child's input pipe.","resolution":"Check for pipe communication issues and system resources. May require server restart."},{"function":"send_handles_to_child","message_template":"Parent: Unable to duplicate the ready event handle for the child","reason":"The parent could not duplicate a handle to the ready event for the child process.","resolution":"Check for handle inheritance permissions and system resource limits that might prevent handle duplication."},{"function":"send_handles_to_child","message_template":"Parent: Unable to send the exit event handle to the child","reason":"The parent could not send the exit event handle to the child process, which prevents proper shutdown signaling.","resolution":"Check pipe communication and ensure sufficient resources for interprocess communication."},{"function":"send_handles_to_child","message_template":"Parent: Unable to duplicate the exit event handle for the child","reason":"The parent could not duplicate the exit event handle for the child process.","resolution":"Verify handle duplication permissions and available system resources."},{"function":"send_handles_to_child","message_template":"Parent: Unable to retrieve the start mutex for the child","reason":"The parent could not get an OS handle from the APR mutex object to send to the child.","resolution":"Check APR mutex initialization and ensure proper OS object creation."},{"function":"send_handles_to_child","message_template":"Parent: Unable to duplicate the start mutex to the child","reason":"The parent could not duplicate the start mutex handle for the child process.","resolution":"Verify handle duplication permissions and available system resources."},{"function":"send_handles_to_child","message_template":"Parent: Unable to send the start mutex to the child","reason":"The parent could not send the start mutex handle to the child process via the pipe.","resolution":"Check pipe communication and ensure sufficient resources for interprocess communication."},{"function":"send_handles_to_child","message_template":"Parent: Unable to retrieve the scoreboard handle for the child","reason":"The parent could not get an OS handle from the APR shared memory object for the scoreboard.","resolution":"Check APR shared memory initialization and ensure proper OS object creation."},{"function":"send_handles_to_child","message_template":"Parent: Unable to duplicate the scoreboard handle to the child","reason":"The parent could not duplicate the scoreboard handle for the child process.","resolution":"Verify handle duplication permissions and available system resources."},{"function":"send_handles_to_child","message_template":"Parent: Unable to send the scoreboard handle to the child","reason":"The parent could not send the scoreboard handle to the child process via the pipe.","resolution":"Check pipe communication and ensure sufficient resources for interprocess communication."},{"function":"send_handles_to_child","message_template":"Parent: Sent the scoreboard to the child","reason":"Informational message indicating the scoreboard was successfully sent to the child process.","resolution":"Information log, no resolution required."},{"function":"get_listeners_from_parent","message_template":"Child: Waiting for data for listening socket %pI","reason":"The child process is waiting to receive socket information from the parent for a specific network address.","resolution":"Information log, no resolution required."},{"function":"get_listeners_from_parent","message_template":"Child: Unable to read socket data from parent","reason":"The child could not read socket data from the parent process via the pipe.","resolution":"Check pipe communication and ensure parent process is still active. May require server restart."},{"function":"get_listeners_from_parent","message_template":"Child: WSASocket failed to open the inherited socket","reason":"The child failed to recreate a socket from the WSAPROTOCOL_INFO structure sent by the parent.","resolution":"Check Windows socket implementation status and ensure correct Winsock version. May require reinstallation of TCP\/IP stack."},{"function":"get_listeners_from_parent","message_template":"Child: SetHandleInformation failed","reason":"The child failed to mark the socket handle as non-inheritable, which might cause handle leaks.","resolution":"This is usually non-fatal. Check Windows API compatibility and permissions."},{"function":"get_listeners_from_parent","message_template":"Child: retrieved %d listeners from parent","reason":"Informational message showing how many listening sockets were successfully received from the parent.","resolution":"Information log, no resolution required."},{"function":"send_listeners_to_child","message_template":"Parent: Duplicating socket %d (%pI) and sending it to child process %lu","reason":"The parent is duplicating a socket for a specific network address to send to the child process.","resolution":"Information log, no resolution required."},{"function":"send_listeners_to_child","message_template":"Parent: WSADuplicateSocket failed for socket %d. Check the FAQ.","reason":"The parent failed to duplicate a socket for the child process. This prevents the child from listening on that socket.","resolution":"Check the Apache FAQ for common issues with socket duplication. Often related to permissions or TCP\/IP stack issues."},{"function":"send_listeners_to_child","message_template":"Parent: Unable to write duplicated socket %d to the child.","reason":"The parent could not send the duplicated socket info to the child process via the pipe.","resolution":"Check pipe communication and ensure sufficient resources for interprocess communication."},{"function":"send_listeners_to_child","message_template":"Parent: Sent %d listeners to child %lu","reason":"Informational message showing how many listening sockets were successfully sent to the child process.","resolution":"Information log, no resolution required."},{"function":"ap_signal_parent","message_template":"OpenEvent on %s event","reason":"Failed to open a named event for signaling the parent process. This prevents proper communication for shutdown or restart.","resolution":"Check permissions and ensure the event name is correct. May indicate parent process is no longer running."},{"function":"ap_signal_parent","message_template":"SetEvent on %s event","reason":"Failed to signal a named event to notify the parent process. This prevents proper communication for shutdown or restart.","resolution":"Check if the event handle is valid and the parent process is still running."},{"function":"create_process","message_template":"Parent: Failed to get the current path","reason":"The parent process could not determine the current working directory, which is needed for child process creation.","resolution":"Check directory permissions and path length limitations. Ensure the process has access to its working directory."},{"function":"create_process","message_template":"Parent: Failed to get full path of %s","reason":"The parent process could not determine the full path of the executable, which is needed for child process creation.","resolution":"Verify the executable path and permissions. Check for path length issues or access restrictions."},{"function":"create_process","message_template":"Parent: Unable to create child stdin pipe.","reason":"The parent could not create a pipe for communicating with the child process's standard input.","resolution":"Check system resources and handle limits. May require server restart."},{"function":"create_process","message_template":"Parent: Could not create ready event for child process","reason":"The parent could not create an event object used to synchronize with the child process during startup.","resolution":"Check system resources and permissions for creating kernel objects."},{"function":"create_process","message_template":"Parent: Could not create exit event for child process","reason":"The parent could not create an event object used to signal the child process to exit.","resolution":"Check system resources and permissions for creating kernel objects."},{"function":"create_process","message_template":"Parent: Failed to create the child process.","reason":"The parent failed to create a child process. This prevents Apache from processing requests.","resolution":"Check system resources, permissions, and ensure the executable path is correct. May indicate corrupted installation."},{"function":"create_process","message_template":"Parent: Created child process %d","reason":"Informational message indicating successful creation of a child process with the given process ID.","resolution":"Information log, no resolution required."},{"function":"master_main","message_template":"master_main: create child process failed. Exiting.","reason":"The master process could not create a child process, which is fatal for server operation.","resolution":"Check all previous error logs for specific reasons. Verify system resources and permissions."},{"function":"master_main","message_template":"master_main: WaitForMultipleObjects WAIT_FAILED -- doing server shutdown","reason":"A critical failure occurred while waiting for events in the master process, forcing server shutdown.","resolution":"Check system resources and event handle validity. May indicate a serious Windows API failure."},{"function":"master_main","message_template":"master_main: WaitForMultipleObjects with INFINITE wait exited with WAIT_TIMEOUT","reason":"An unexpected timeout occurred while waiting indefinitely for events in the master process.","resolution":"This should never happen with an INFINITE timeout. Indicates a possible Windows API issue or corruption."},{"function":"master_main","message_template":"Parent: Received shutdown signal -- Shutting down the server.","reason":"The master process received a shutdown signal and will begin graceful server shutdown.","resolution":"Information log, no resolution required. Normal part of shutdown process."},{"function":"master_main","message_template":"ResetEvent(shutdown_event)","reason":"Failed to reset the shutdown event, which might cause repeated shutdown signals.","resolution":"Check event handle validity. Usually non-fatal since shutdown is already in progress."},{"function":"master_main","message_template":"Parent: Received restart signal -- Restarting the server.","reason":"The master process received a restart signal and will begin graceful server restart.","resolution":"Information log, no resolution required. Normal part of restart process."},{"function":"master_main","message_template":"Parent: ResetEvent(restart_event) failed.","reason":"Failed to reset the restart event, which might cause repeated restart signals.","resolution":"Check event handle validity. Usually non-fatal but may cause multiple restarts."},{"function":"master_main","message_template":"Parent: SetEvent for child process event %pp failed.","reason":"Failed to signal an event to the child process, which affects coordination during shutdown or restart.","resolution":"Check if the child process is still running and the event handle is valid."},{"function":"master_main","message_template":"Parent: child process %lu exited with status %lu -- Aborting.","reason":"A child process exited with a fatal error status, forcing server shutdown.","resolution":"Check preceding error logs for specific issues. May indicate configuration problems or resource limitations."},{"function":"master_main","message_template":"Parent: child process %lu exited with status %lu -- Restarting.","reason":"A child process exited unexpectedly but with a non-fatal status. The server will restart the child.","resolution":"Check logs for the reason of the exit. If recurring, investigate resource issues or application errors."},{"function":"master_main","message_template":"Parent: SetEvent for child process event %pp failed","reason":"Failed to signal an event to the child process during server operation.","resolution":"Check if the child process is still running and the event handle is valid."},{"function":"master_main","message_template":"Parent: Child process %lu exited successfully.","reason":"Informational message indicating a child process exited normally during shutdown or restart.","resolution":"Information log, no resolution required."},{"function":"master_main","message_template":"Parent: Forcing termination of child process %lu","reason":"The parent is forcibly terminating a child process that did not exit gracefully within the timeout period.","resolution":"If this occurs frequently, check for hung operations or blocking calls in modules that prevent clean shutdown."},{"function":"get_handles_from_parent","message_template":"Child: Unable to retrieve my generation from the parent","reason":"The child process could not read its generation number from the parent via the pipe.","resolution":"Check pipe communication and ensure proper process creation sequence. May require server restart."},{"function":"winnt_rewrite_args","message_template":"Failed to get the full path of %s","reason":"Could not determine the full path of the Apache executable, which is needed for proper operation.","resolution":"Verify the executable path and permissions. Check for path length issues or access restrictions."},{"function":"winnt_rewrite_args","message_template":"%s: Service is already installed.","reason":"Attempted to install a service that is already installed in the service control manager.","resolution":"If you want to modify the service, use -k config instead of -k install, or uninstall first."},{"function":"winnt_rewrite_args","message_template":"Using ConfigArgs of the installed service \"%s\".","reason":"Informational message indicating the server is using configuration arguments from the installed service.","resolution":"Information log, no resolution required."},{"function":"winnt_rewrite_args","message_template":"No installed ConfigArgs for the service \"%s\", using Apache defaults.","reason":"The server could not find configuration arguments for the specified service and will use defaults.","resolution":"Consider running -k config to set proper configuration arguments for the service."},{"function":"winnt_rewrite_args","message_template":"No installed service named \"%s\".","reason":"Attempted to use a service that is not installed in the service control manager.","resolution":"Verify the service name or install the service first using -k install."},{"function":"winnt_check_config","message_template":"WARNING: ThreadLimit of %d exceeds compile-time limit of %d threads, decreasing to %d.","reason":"The configured ThreadLimit exceeds the maximum allowed by the compiled settings and will be reduced.","resolution":"Adjust ThreadLimit in your configuration to be within the allowed range (1 to MAX_THREAD_LIMIT)."},{"function":"winnt_check_config","message_template":"ThreadLimit of %d exceeds compile-time limit of %d, decreasing to match","reason":"The configured ThreadLimit exceeds the maximum allowed by the compiled settings and will be reduced.","resolution":"Adjust ThreadLimit in your configuration to be within the allowed range."},{"function":"winnt_check_config","message_template":"WARNING: ThreadLimit of %d not allowed, increasing to 1.","reason":"The configured ThreadLimit is less than the minimum allowed (1) and will be increased.","resolution":"Adjust ThreadLimit in your configuration to be at least 1."},{"function":"winnt_check_config","message_template":"ThreadLimit of %d not allowed, increasing to 1","reason":"The configured ThreadLimit is less than the minimum allowed (1) and will be increased.","resolution":"Adjust ThreadLimit in your configuration to be at least 1."},{"function":"winnt_check_config","message_template":"changing ThreadLimit to %d from original value of %d not allowed during restart","reason":"ThreadLimit cannot be changed during a server restart and will remain at its original value.","resolution":"To change ThreadLimit, perform a full stop and start of the server rather than a restart."},{"function":"winnt_check_config","message_template":"WARNING: ThreadsPerChild of %d exceeds ThreadLimit of %d threads, decreasing to %d. To increase, please see the ThreadLimit directive.","reason":"The configured ThreadsPerChild exceeds the ThreadLimit and will be reduced to match.","resolution":"Increase ThreadLimit or decrease ThreadsPerChild in your configuration to make them consistent."},{"function":"winnt_check_config","message_template":"ThreadsPerChild of %d exceeds ThreadLimit of %d, decreasing to match","reason":"The configured ThreadsPerChild exceeds the ThreadLimit and will be reduced to match.","resolution":"Increase ThreadLimit or decrease ThreadsPerChild in your configuration to make them consistent."},{"function":"winnt_check_config","message_template":"WARNING: ThreadsPerChild of %d not allowed, increasing to 1.","reason":"The configured ThreadsPerChild is less than the minimum allowed (1) and will be increased.","resolution":"Adjust ThreadsPerChild in your configuration to be at least 1."},{"function":"winnt_check_config","message_template":"ThreadsPerChild of %d not allowed, increasing to 1","reason":"The configured ThreadsPerChild is less than the minimum allowed (1) and will be increased.","resolution":"Adjust ThreadsPerChild in your configuration to be at least 1."},{"function":"winnt_post_config","message_template":"Parent: Cannot create shutdown event %s","reason":"The parent process could not create a named event used for shutdown signaling.","resolution":"Check permissions for creating kernel objects and ensure no naming conflicts with existing events."},{"function":"winnt_post_config","message_template":"Parent: Cannot create restart event %s","reason":"The parent process could not create a named event used for restart signaling.","resolution":"Check permissions for creating kernel objects and ensure no naming conflicts with existing events."},{"function":"winnt_post_config","message_template":"%s: Unable to create the start_mutex.","reason":"Failed to create a mutex object used to coordinate child process startup.","resolution":"Check system resources and permissions for creating kernel objects."},{"function":"winnt_child_init","message_template":"%s child: Unable to init the start_mutex.","reason":"The child process could not initialize the start mutex, which is needed for proper synchronization.","resolution":"Check system resources and permissions. May indicate parent-child communication problems."},{"function":"winnt_run","message_template":"Child process is running","reason":"Informational message indicating a child process has started and is operational.","resolution":"Information log, no resolution required."},{"function":"winnt_run","message_template":"Child process is exiting","reason":"Informational message indicating a child process is shutting down.","resolution":"Information log, no resolution required."},{"function":"winnt_run","message_template":"%s configured -- resuming normal operations","reason":"Informational message indicating Apache has been successfully configured and is running normally.","resolution":"Information log, no resolution required."},{"function":"winnt_run","message_template":"Server built: %s","reason":"Informational message showing the build date\/time of the Apache server.","resolution":"Information log, no resolution required."},{"function":"winnt_pre_config","message_template":"%s: Unable to start the service manager.","reason":"Failed to start the service manager when running as a Windows service.","resolution":"Check Windows service configuration and permissions. Ensure the service account has sufficient privileges."},{"function":"winnt_open_logs","message_template":"no listening sockets available, shutting down","reason":"Apache could not open any listening sockets, making it unable to accept connections.","resolution":"Check for port conflicts, ensure Listen directives specify accessible addresses\/ports, and verify the server has permission to bind to the specified ports."}],"project":"apache\/httpd"}