{"module":"service.c","summary":"Windows service control module for Apache HTTP server. It provides functionality to install, start, stop, and configure Apache as a Windows service, handling interactions with the Windows Service Control Manager.","logs":[{"function":"hold_console_open_on_error","message_template":"Note the errors or messages above, and press the <ESC> key to exit.","reason":"Displayed when Apache encounters an error during startup or operation, to prevent the console window from closing immediately and allowing users to read error messages.","resolution":"Review the error messages displayed above this message to identify and fix the specific issue."},{"function":"console_control_handler","message_template":"Apache server restarting...","reason":"Displayed when the server receives a CTRL_BREAK_EVENT signal, indicating that a restart is being initiated.","resolution":"Informational message, no resolution required."},{"function":"console_control_handler","message_template":"Apache server interrupted...","reason":"Displayed when the server receives a CTRL_C_EVENT signal, indicating that a shutdown is being initiated via interrupt.","resolution":"Informational message, no resolution required."},{"function":"console_control_handler","message_template":"Apache server shutdown initiated...","reason":"Displayed when the server receives a terminate signal (CLOSE, LOGOFF, or SHUTDOWN events), indicating that a graceful shutdown is starting.","resolution":"Informational message, no resolution required."},{"function":"service_nt_main_fn_w","message_template":"Failure registering service handler","reason":"Occurs when the Windows RegisterServiceCtrlHandlerExW function fails, preventing the service from properly registering with the Service Control Manager.","resolution":"Verify that the user has appropriate permissions. Check if another service with the same name is already registered. May require restarting the Service Control Manager or rebooting the system."},{"function":"service_nt_main_fn","message_template":"Failure registering service handler","reason":"Occurs when the Windows RegisterServiceCtrlHandlerExA function fails, preventing the service from properly registering with the Service Control Manager.","resolution":"Verify that the user has appropriate permissions. Check if another service with the same name is already registered. May require restarting the Service Control Manager or rebooting the system."},{"function":"service_nt_dispatch_thread","message_template":"Error starting Windows service control dispatcher","reason":"Occurs when StartServiceCtrlDispatcher fails, preventing the service from being started. Often due to the program not being run as a service or lacking appropriate permissions.","resolution":"Ensure the program is being run as a service through the Service Control Manager. Verify the user has sufficient privileges to start Windows services."},{"function":"mpm_service_set_name","message_template":"No ConfigArgs registered for the '%s' service, perhaps this service is not installed?","reason":"Displayed when attempting to retrieve configuration arguments for a service that appears not to be properly installed in the registry.","resolution":"Reinstall the service using the appropriate installation command (httpd -k install) or verify that the service is correctly registered in the Windows registry."},{"function":"mpm_service_install","message_template":"Reconfiguring the '%s' service","reason":"Informational message shown when reconfiguring an existing service installation.","resolution":"Informational message, no resolution required."},{"function":"mpm_service_install","message_template":"Installing the '%s' service","reason":"Informational message shown when installing a new service.","resolution":"Informational message, no resolution required."},{"function":"mpm_service_install","message_template":"GetModuleFileName failed","reason":"Occurs when attempting to get the path of the current executable during service installation, usually due to system resource issues or corrupt installation.","resolution":"Verify that the Apache installation is complete and not corrupt. Reinstall Apache if necessary."},{"function":"mpm_service_install","message_template":"Failed to open the Windows service manager, perhaps you forgot to log in as Administrator?","reason":"Occurs when OpenSCManager fails during service installation, typically due to insufficient privileges.","resolution":"Ensure you're running the command with administrator privileges. Try right-clicking the command prompt and selecting 'Run as administrator'."},{"function":"mpm_service_install","message_template":"Failed to open the '%s' service","reason":"Occurs when attempting to open an existing service during reconfiguration but the operation fails.","resolution":"Verify the service name is correct and that the service exists. Check if you have sufficient permissions to manage services."},{"function":"mpm_service_install","message_template":"ChangeServiceConfig failed","reason":"Occurs when attempting to change the configuration of an existing service but the operation fails. May be due to insufficient privileges or invalid configuration parameters.","resolution":"Ensure you have administrator rights. Verify the service configuration parameters are valid. Try restarting the Service Control Manager."},{"function":"mpm_service_install","message_template":"Failed to create the '%s' service","reason":"Occurs when CreateService fails during service installation, possibly due to a service with the same name already existing or insufficient privileges.","resolution":"If the service already exists, remove it first or use -k config to reconfigure it. Ensure you're running with administrator privileges."},{"function":"mpm_service_install","message_template":"Failed to store ConfigArgs for the '%s' service in the registry.","reason":"Occurs when the service is installed but storing configuration arguments in the registry fails, possibly due to registry access restrictions.","resolution":"Verify you have write access to the registry. Run the command with administrator privileges. Check if registry keys for the service can be manually created."},{"function":"mpm_service_install","message_template":"The '%s' service is successfully installed.","reason":"Informational message indicating successful service installation.","resolution":"Informational message, no resolution required."},{"function":"mpm_service_uninstall","message_template":"Removing the '%s' service","reason":"Informational message shown when removing a service.","resolution":"Informational message, no resolution required."},{"function":"mpm_service_uninstall","message_template":"Failed to open the Windows service manager, perhaps you forgot to log in as Administrator?","reason":"Occurs when OpenSCManager fails during service uninstallation, typically due to insufficient privileges.","resolution":"Ensure you're running the command with administrator privileges. Try right-clicking the command prompt and selecting 'Run as administrator'."},{"function":"mpm_service_uninstall","message_template":"Failed to open the '%s' service","reason":"Occurs when attempting to open an existing service for deletion but the operation fails, usually because the service doesn't exist or due to insufficient privileges.","resolution":"Verify the service name is correct and that the service exists. Check if you have sufficient permissions to manage services."},{"function":"mpm_service_uninstall","message_template":"Failed to delete the '%s' service","reason":"Occurs when DeleteService fails during service uninstallation, possibly because the service is still running or due to insufficient privileges.","resolution":"Stop the service before attempting to delete it. Ensure you have administrator rights. Try using the Services management console to stop and then delete the service."},{"function":"mpm_service_uninstall","message_template":"The '%s' service has been removed successfully.","reason":"Informational message indicating successful service removal.","resolution":"Informational message, no resolution required."},{"function":"mpm_service_start","message_template":"Starting the '%s' service","reason":"Informational message shown when starting a service.","resolution":"Informational message, no resolution required."},{"function":"mpm_service_start","message_template":"Failed to open the Windows service manager, perhaps you forgot to log in as Administrator?","reason":"Occurs when OpenSCManager fails during service startup, typically due to insufficient privileges.","resolution":"Ensure you're running the command with administrator privileges. Try right-clicking the command prompt and selecting 'Run as administrator'."},{"function":"mpm_service_start","message_template":"Failed to open the '%s' service","reason":"Occurs when attempting to open an existing service for starting but the operation fails, usually because the service doesn't exist or due to insufficient privileges.","resolution":"Verify the service name is correct and that the service exists. Check if you have sufficient permissions to manage services."},{"function":"mpm_service_start","message_template":"The '%s' service is already started!","reason":"Displayed when attempting to start a service that is already running.","resolution":"No action needed since the service is already running. If the service seems unresponsive, try restarting it instead."},{"function":"mpm_service_start","message_template":"The '%s' service is running.","reason":"Informational message indicating the service has successfully started.","resolution":"Informational message, no resolution required."},{"function":"mpm_service_start","message_template":"Failed to start the '%s' service","reason":"Occurs when StartService fails, possibly due to invalid startup parameters, service dependencies not being available, or the service executable having issues.","resolution":"Check the system event log for more specific error messages. Verify all service dependencies are available. Ensure the service executable path is correct and the file exists."},{"function":"mpm_signal_service","message_template":"Failed to open the Windows service manager, perhaps you forgot to log in as Administrator?","reason":"Occurs when attempting to open the service manager to send signals to a service but lacking sufficient privileges.","resolution":"Ensure you're running the command with administrator privileges. Try right-clicking the command prompt and selecting 'Run as administrator'."},{"function":"mpm_signal_service","message_template":"Failed to open the '%s' service","reason":"Occurs when attempting to open a service to send signals but the operation fails, usually because the service doesn't exist or due to insufficient privileges.","resolution":"Verify the service name is correct and that the service exists. Check if you have sufficient permissions to manage services."},{"function":"mpm_signal_service","message_template":"Query of the '%s' service failed","reason":"Occurs when QueryServiceStatus fails, preventing the code from determining the current state of the service.","resolution":"Check if the service exists and is properly registered. Verify you have sufficient permissions to query service status."},{"function":"mpm_signal_service","message_template":"The '%s' service is not started.","reason":"Informational message shown when attempting to stop a service that is already stopped.","resolution":"No action needed since the service is already stopped. If you expected the service to be running, check why it might have stopped unexpectedly."},{"function":"mpm_signal_service","message_template":"The '%s' service is restarting.","reason":"Informational message indicating the service is being restarted.","resolution":"Informational message, no resolution required."},{"function":"mpm_signal_service","message_template":"The '%s' service is stopping.","reason":"Informational message indicating the service is being stopped.","resolution":"Informational message, no resolution required."},{"function":"mpm_signal_service","message_template":"The '%s' service has restarted.","reason":"Informational message indicating the service has successfully restarted.","resolution":"Informational message, no resolution required."},{"function":"mpm_signal_service","message_template":"The '%s' service has stopped.","reason":"Informational message indicating the service has successfully stopped.","resolution":"Informational message, no resolution required."},{"function":"mpm_signal_service","message_template":"Failed to restart the '%s' service.","reason":"Occurs when service restart fails, possibly due to issues during shutdown or startup phases.","resolution":"Check the system event log for more specific error messages. Verify the service executable is functioning correctly. Try stopping the service completely before starting it again."},{"function":"mpm_signal_service","message_template":"Failed to stop the '%s' service.","reason":"Occurs when service stop operation fails, possibly because the service is hanging or has dependent services that must be stopped first.","resolution":"Check if the service has dependencies that need to be stopped first. Try using Task Manager to end the process if necessary. Reboot the system if the service cannot be stopped normally."}],"project":"apache\/httpd"}