{"module":"mod_ssl_ct.c","summary":"This module implements Certificate Transparency (CT) for Apache HTTP Server. It manages the retrieval, storage, validation, and serving of Signed Certificate Timestamps (SCTs) to clients. It includes functionality for interacting with CT logs, validating certificates, and maintaining an audit trail.","logs":[{"function":"collate_scts","message_template":"can't create %s","reason":"Failed to create a temporary file for collating SCTs. This occurs when the process doesn't have write permissions or there are resource constraints.","resolution":"Check permissions on the CTSCTStorage directory and ensure the Apache process has write access."},{"function":"collate_scts","message_template":"Adding SCT from file %s","reason":"Informational message indicating an SCT from the specified file is being added to the collated list.","resolution":"Information log, no resolution required."},{"function":"collate_scts","message_template":"SCT in file %s has timestamp in future (%s), skipping","reason":"An SCT with a timestamp in the future was found and is being skipped. This could happen with newly created SCTs from a log with clock skew.","resolution":"If this persists, check time synchronization between your server and the CT logs."},{"function":"collate_scts","message_template":"can't write %hu bytes to %s","reason":"Failed to write SCT data to the target file. This could be due to disk space issues or permissions.","resolution":"Check for disk space problems or permission issues on the storage directory."},{"function":"collate_scts","message_template":"SCTs sent in ServerHello are limited to %d by CTServerHelloSCTLimit (ignoring %d)","reason":"The number of SCTs exceeds the configured limit for ServerHello, so some SCTs are being ignored.","resolution":"If all SCTs are needed, increase the CTServerHelloSCTLimit directive value."},{"function":"collate_scts","message_template":"could not write the SCT list length at the start of the file","reason":"Failed to write the SCT list length to the beginning of the file after seeking to position 0.","resolution":"Check for file system problems or disk space issues."},{"function":"collate_scts","message_template":"error flushing and closing %s","reason":"Failed to properly close the SCT file, which could indicate I\/O problems.","resolution":"Check system resources and disk health."},{"function":"collate_scts","message_template":"global mutex lock failed","reason":"Failed to acquire the global SCT update mutex, which prevents safe updates to the SCT files.","resolution":"Check system resources for mutex issues; may require Apache restart if persistent."},{"function":"collate_scts","message_template":"couldn't rename %s to %s, no SCTs to send for now","reason":"Failed to rename the temporary SCT file to the permanent one, resulting in SCTs not being available.","resolution":"Check for file system issues or permissions in the CTSCTStorage directory."},{"function":"collate_scts","message_template":"global mutex unlock failed","reason":"Failed to release the global SCT update mutex, which could prevent other processes from updating SCTs.","resolution":"The server may need to be restarted if this persists."},{"function":"fetch_sct","message_template":"Found SCT for %s in %s","reason":"Successfully found an existing SCT for the certificate in the specified file.","resolution":"Information log, no resolution required."},{"function":"fetch_sct","message_template":"SCT for %s is older than %d seconds, must refresh","reason":"The SCT is older than the maximum allowed age (configured by CTMaxSCTAge) and needs to be refreshed.","resolution":"No immediate action needed; the module will attempt to refresh the SCT."},{"function":"fetch_sct","message_template":"Did not find SCT for %s in %s, must fetch","reason":"No SCT was found for the certificate, so it must be obtained from a CT log.","resolution":"No immediate action needed; the module will attempt to fetch an SCT from configured logs."},{"function":"record_log_urls","message_template":"can't create %s","reason":"Failed to create a file to record the list of log URLs. This could be due to permissions or resource issues.","resolution":"Check permissions and available disk space in the SCT storage directory."},{"function":"record_log_urls","message_template":"error writing to %s","reason":"Failed to write a log URL to the list file. Could be due to disk space or I\/O issues.","resolution":"Check disk space and file system health."},{"function":"record_log_urls","message_template":"error flushing and closing %s","reason":"Failed to properly close the log URL list file after writing to it.","resolution":"Check for file system issues or disk space problems."},{"function":"update_log_list_for_cert","message_template":"unparsable log URL %s in file %s - ignoring","reason":"Found a log URL in the list file that couldn't be parsed. This could indicate corruption or manual edits.","resolution":"Check the file for invalid entries or restore from a backup."},{"function":"update_log_list_for_cert","message_template":"Log %s is no longer enabled%s","reason":"A log that was previously trusted is no longer in the active configuration.","resolution":"If this log should be active, check your CTStaticLogConfig or log configuration DB."},{"function":"update_log_list_for_cert","message_template":"can't remove SCT %s from previously trusted log %s","reason":"Failed to remove an SCT from a log that is no longer trusted. This could be due to file permissions.","resolution":"Check permissions on the SCT file and directory."},{"function":"update_log_list_for_cert","message_template":"List of previous logs doesn't exist (%s), removing previously obtained SCTs","reason":"The list file of trusted logs doesn't exist, so all automatically obtained SCTs are being removed as a precaution.","resolution":"This happens normally on first run; no action needed if expected."},{"function":"update_log_list_for_cert","message_template":"Removing %s","reason":"Removing an SCT file because its source log is no longer trusted.","resolution":"If this SCT should be kept, ensure its source log is properly configured."},{"function":"update_log_list_for_cert","message_template":"can't remove %s","reason":"Failed to remove an SCT file from a log that is no longer trusted.","resolution":"Check file permissions and system resources."},{"function":"sct_daemon_cycle","message_template":"%s - reloading config","reason":"The SCT maintenance daemon is reloading its configuration, which happens periodically.","resolution":"Information log, no resolution required."},{"function":"sct_daemon_cycle","message_template":"%s - no active configuration until log config DB is corrected","reason":"The log configuration database couldn't be read or processed, leaving the daemon without an active configuration.","resolution":"Check the CTLogConfigDB file for corruption or access issues."},{"function":"sct_daemon_cycle","message_template":"%s - refreshing SCTs as needed","reason":"The daemon is checking for and refreshing SCTs that are outdated.","resolution":"Information log, no resolution required."},{"function":"sct_daemon_cycle","message_template":"%s - SCT refresh failed; will try again later","reason":"An attempt to refresh SCTs failed, but the daemon will retry in a future cycle.","resolution":"Check earlier logs for specific failures; may resolve automatically on retry."},{"function":"daemon_maint","message_template":"DAEMON_NAME failed to initialize","reason":"The SCT maintenance daemon process failed to start properly.","resolution":"Check earlier logs for specific failures and system resources."},{"function":"daemon_maint","message_template":"DAEMON_NAME process died, restarting","reason":"The SCT maintenance daemon process terminated unexpectedly and is being restarted.","resolution":"If this repeats frequently, check system resources and logs for the cause."},{"function":"sct_daemon","message_template":"could not initialize SSL_CT_MUTEX_TYPE mutex in DAEMON_NAME","reason":"Failed to initialize the SCT update mutex in the daemon process, preventing safe updates.","resolution":"Check system resources for issues with creating mutexes."},{"function":"sct_daemon","message_template":"Couldn't change owner or group of directory %s","reason":"Failed to change ownership of a directory. This happens when running as root and dropping privileges.","resolution":"Check permissions on parent directories and file system attributes."},{"function":"sct_daemon","message_template":"Did not read any entries from %s (no server certificate?)","reason":"Couldn't find any entries in the SCT storage directory, possibly because no server certificate is configured.","resolution":"Ensure SSL is properly configured with a server certificate."},{"function":"daemon_start","message_template":"Couldn't create DAEMON_NAME process","reason":"Failed to create the SCT maintenance daemon process. This could be due to system resource constraints.","resolution":"Check system resources and limits on process creation."},{"function":"daemon_thread_start","message_template":"could not create DAEMON_THREAD_NAME in parent","reason":"Failed to create the SCT maintenance daemon thread in the parent process.","resolution":"Check system resources, particularly limits on thread creation."},{"function":"ssl_ct_post_config","message_template":"No server certificates were found.","reason":"No server certificates were found in the configuration. The module requires at least one certificate to operate.","resolution":"Configure SSL with at least one server certificate."},{"function":"ssl_ct_post_config","message_template":"mod_ssl_ct requires OpenSSL 1.0.2-beta3 or later","reason":"The version of OpenSSL is too old to support the Certificate Transparency features.","resolution":"Upgrade OpenSSL to version 1.0.2-beta3 or later."},{"function":"ssl_ct_post_config","message_template":"mod_ssl_ct only supports configurations with a TLS server.","reason":"The module is configured but no TLS server is set up. It requires a TLS server to operate.","resolution":"Configure SSL properly for the server with a certificate."},{"function":"ssl_ct_post_config","message_template":"could not create global mutex","reason":"Failed to create the global mutex needed for SCT updates, which prevents safe operation.","resolution":"Check system resources and limits on mutex creation."},{"function":"ssl_ct_post_config","message_template":"Either the static log configuration or the db log configuration must be empty","reason":"Both static log configuration and database log configuration are present, but only one should be used.","resolution":"Choose either CTStaticLogConfig or CTLogConfigDB, not both."},{"function":"ssl_ct_post_config","message_template":"No log URLs were configured; only admin-managed SCTs can be sent","reason":"No log URLs have been configured, so only manually added SCTs can be used (not automatically fetched).","resolution":"If automatic SCT fetching is needed, configure log URLs via CTStaticLogConfig or CTLogConfigDB."},{"function":"ssl_ct_post_config","message_template":"SCTs will be fetched from configured logs as needed and may not be available immediately","reason":"Informational message when running as root, indicating SCTs will be fetched after privilege drop.","resolution":"Information log, no resolution required."},{"function":"ssl_ct_post_config","message_template":"refresh_all_scts() failed","reason":"The initial attempt to refresh all SCTs failed during server startup.","resolution":"Check earlier logs for specific failures and address those issues."},{"function":"ssl_ct_check_config","message_template":"Directive CTSCTStorage is required","reason":"The CTSCTStorage directive is missing from the configuration but is required for operation.","resolution":"Add the CTSCTStorage directive to your configuration."},{"function":"ssl_ct_check_config","message_template":"Directive CTAuditStorage isn't set; proxy will not save data for off-line audit","reason":"The CTAuditStorage directive is not set, so audit data for proxied connections won't be saved.","resolution":"If proxy audit is needed, add the CTAuditStorage directive."},{"function":"ssl_ct_check_config","message_template":"Directive CTLogClient isn't set; server certificates can't be submitted to configured logs; only admin-managed SCTs can be provided to clients","reason":"The CTLogClient directive is not set, so SCTs can't be automatically fetched from logs.","resolution":"If automatic SCT fetching is needed, add the CTLogClient directive."},{"function":"ssl_ct_check_config","message_template":"Log config file %s cannot be read","reason":"The specified log configuration file can't be read, which prevents using configured logs.","resolution":"Check file permissions and ensure the file exists and is readable by Apache."},{"function":"read_scts","message_template":"global mutex lock failed","reason":"Failed to acquire the global mutex for SCT updates while reading SCTs.","resolution":"Check system resources or restart Apache if persistent."},{"function":"read_scts","message_template":"global mutex unlock failed","reason":"Failed to release the global mutex for SCT updates after reading SCTs.","resolution":"Restart Apache if this persists, as it may lead to deadlocks."},{"function":"look_for_server_certs","message_template":"can't create directory %s","reason":"Failed to create a directory for storing SCTs for a server certificate.","resolution":"Check permissions on the parent directory and file system issues."},{"function":"look_for_server_certs","message_template":"wrote server cert and chain to %s","reason":"Successfully wrote a server certificate and its chain to the specified file for SCT processing.","resolution":"Information log, no resolution required."},{"function":"look_for_server_certs","message_template":"could not find leaf certificate","reason":"Could not find the leaf certificate in the server's SSL configuration.","resolution":"Check your SSL certificate configuration for errors."},{"function":"ssl_ct_ssl_proxy_verify","message_template":"odd chain size %d -- cannot proceed","reason":"The certificate chain from the backend server has an unexpected size, making validation impossible.","resolution":"Check the backend server's certificate configuration for issues."},{"function":"ssl_ct_ssl_proxy_verify","message_template":"Could not retrieve SCT list from certificate (unexpected)","reason":"Failed to extract the SCT list from a certificate extension that was detected.","resolution":"This may indicate a malformed SCT extension; check the backend server's certificate."},{"function":"validate_server_data","message_template":"couldn't deserialize SCT list from certificate","reason":"Failed to parse the SCT list from a certificate due to format issues.","resolution":"This may indicate a malformed SCT extension; check the certificate."},{"function":"validate_server_data","message_template":"couldn't deserialize SCT list from ServerHello","reason":"Failed to parse the SCT list from the ServerHello TLS extension.","resolution":"This may indicate a protocol error or backend server issue."},{"function":"validate_server_data","message_template":"couldn't deserialize SCT list from stapled OCSP response","reason":"Failed to parse the SCT list from a stapled OCSP response.","resolution":"This may indicate an issue with the OCSP responder or the response format."},{"function":"validate_server_data","message_template":"SNAFU: No deserialized SCTs found in validate_server_data()","reason":"An unexpected situation where validate_server_data() was called but no SCTs were found.","resolution":"This is an internal error; report to module maintainers if recurring."},{"function":"validate_server_data","message_template":"%d SCTs received total","reason":"Indicates the total number of SCTs received from all sources (certificate, ServerHello, OCSP).","resolution":"Information log, no resolution required."},{"function":"validate_server_data","message_template":"Server sent SCT from unrecognized log","reason":"The server sent an SCT from a log that is not in the trusted log configuration.","resolution":"Update your log configuration to include this log if it should be trusted."},{"function":"validate_server_data","message_template":"Server sent SCT with invalid signature","reason":"The signature on an SCT from the server could not be verified, which indicates potential tampering.","resolution":"Investigate the backend server for potential security issues."},{"function":"validate_server_data","message_template":"Signature of SCT from server could not be verified (no configured log public keys)","reason":"Can't verify the SCT signature because no log public keys are configured.","resolution":"Configure log public keys via CTStaticLogConfig or CTLogConfigDB."},{"function":"validate_server_data","message_template":"Signature\/timestamp validation for %d SCTs: %d successes, %d failures, %d from unknown logs","reason":"Summary of SCT validation results, showing success and failure counts.","resolution":"If failures are high, check log configuration and backend certificate setup."},{"function":"save_server_data","message_template":"Failed to write to %s, disabling audit for this child","reason":"Failed to write to the audit file, so auditing is disabled for this child process.","resolution":"Check disk space and permissions on the audit storage directory."},{"function":"ocsp_resp_cb","message_template":"OCSP response callback called but no stapled response from server","reason":"The OCSP response callback was invoked but no OCSP response was provided by the server.","resolution":"Information log, no resolution required for most configurations."},{"function":"ocsp_resp_cb","message_template":"Error parsing OCSP response","reason":"Failed to parse the OCSP response received from the server.","resolution":"Check the backend server's OCSP responder configuration for issues."},{"function":"ocsp_resp_cb","message_template":"no OCSP basic response","reason":"The OCSP response doesn't contain a basic response structure.","resolution":"Check the OCSP responder configuration on the backend server."},{"function":"ssl_ct_proxy_post_handshake","message_template":"bad cached validation result","reason":"The cached validation result for a server's SCTs is invalid.","resolution":"This is likely a transient issue; check for recurring patterns if persistent."},{"function":"ssl_ct_proxy_post_handshake","message_template":"Forbidding access to backend server; no valid SCTs","reason":"Access to a backend server is being blocked because no valid SCTs were provided (when proxy_awareness=require).","resolution":"Ensure the backend server provides valid SCTs or change CTProxyAwareness setting."},{"function":"ssl_ct_proxy_post_handshake","message_template":"No backend connection available in ssl_ct_detach_backend()","reason":"An unexpected condition where no backend connection is available in the detach function.","resolution":"This is an internal error; report to module maintainers if recurring."},{"function":"ssl_ct_init_server","message_template":"Unable to initialize Certificate Transparency client extension callbacks (callback for %d already registered?)","reason":"Failed to register the TLS extension callback for Certificate Transparency client mode.","resolution":"Check for conflicts with other modules that might register the same extension."},{"function":"ssl_ct_init_server","message_template":"Unable to initialize Certificate Transparency server extension callback (callbacks for %d already registered?)","reason":"Failed to register the TLS extension callback for Certificate Transparency server mode.","resolution":"Check for conflicts with other modules that might register the same extension."},{"function":"ssl_ct_child_init","message_template":"could not initialize SSL_CT_MUTEX_TYPE mutex in child","reason":"Failed to initialize the SCT update mutex in a child process.","resolution":"Check system resources for issues with mutex allocation."},{"function":"ssl_ct_child_init","message_template":"could not create rwlock in child","reason":"Failed to create a read-write lock in the child process for log configuration protection.","resolution":"Check system resources for issues with lock creation."},{"function":"ssl_ct_child_init","message_template":"could not create SERVICE_THREAD_NAME in child","reason":"Failed to create the service thread in a child process.","resolution":"Check system resources, particularly limits on thread creation."},{"function":"ssl_ct_child_init","message_template":"could not allocate a thread mutex","reason":"Failed to create a thread mutex for data protection in a child process.","resolution":"Check system resources for mutex allocation issues."},{"function":"ssl_ct_child_init","message_template":"Pid-specific file %s was reused before audit grabbed it! (removing)","reason":"A pid-specific audit file already exists, indicating potential file reuse.","resolution":"This should be a transient issue; if persistent, check for process ID reuse patterns."},{"function":"ssl_ct_child_init","message_template":"can't create %s","reason":"Failed to create the audit file in a child process.","resolution":"Check permissions and disk space in the audit storage directory."},{"function":"inactivate_audit_file","message_template":"error flushing\/closing %s or renaming it to %s","reason":"Failed to properly close or rename the audit file during child shutdown.","resolution":"Check for file system issues or permission problems in the audit directory."},{"function":"ct_static_log_config","message_template":"CTStaticLogConfig: 6 arguments are required","reason":"The CTStaticLogConfig directive was used with an incorrect number of arguments.","resolution":"Provide all 6 required arguments to the CTStaticLogConfig directive."},{"function":"ct_static_log_config","message_template":"Error processing static log configuration","reason":"Failed to process a static log configuration entry due to formatting or content issues.","resolution":"Check the format of the CTStaticLogConfig directive arguments."},{"function":"ct_static_scts","message_template":"could not open certificate file %s (%pm)","reason":"Failed to open the certificate file specified in the CTStaticSCTs directive.","resolution":"Ensure the certificate file exists and is readable by Apache."},{"function":"ct_static_scts","message_template":"could not read certificate from file %s","reason":"Failed to parse the certificate from the file specified in CTStaticSCTs.","resolution":"Ensure the file contains a valid PEM-encoded certificate."},{"function":"ct_static_scts","message_template":"CTStaticSCTs: Directory %s does not exist","reason":"The directory specified for static SCTs in CTStaticSCTs doesn't exist.","resolution":"Create the directory or provide a valid path to an existing directory."},{"function":"ct_log_client","message_template":"CTLogClient: File %s does not exist","reason":"The log client executable specified in the CTLogClient directive doesn't exist.","resolution":"Install the log client tool or correct the path in the CTLogClient directive."},{"function":"ct_audit_storage","message_template":"CTAuditStorage: Directory %s does not exist","reason":"The directory specified for audit storage in CTAuditStorage doesn't exist.","resolution":"Create the directory or provide a valid path to an existing directory."},{"function":"ct_sct_storage","message_template":"CTSCTStorage: Directory %s does not exist","reason":"The directory specified for SCT storage in CTSCTStorage doesn't exist.","resolution":"Create the directory or provide a valid path to an existing directory."},{"function":"ct_proxy_awareness","message_template":"CTProxyAwareness: Invalid argument \"%s\"","reason":"An invalid value was provided for the CTProxyAwareness directive.","resolution":"Use one of the valid values: 'oblivious', 'aware', or 'require'."},{"function":"parse_num","message_template":"%s must be between %ld and %ld (was '%s')","reason":"A numeric directive value is outside the allowed range or invalid.","resolution":"Provide a valid numeric value within the specified range."},{"function":"run_service_thread","message_template":"SERVICE_THREAD_NAME started","reason":"The service thread for SCT maintenance has started successfully.","resolution":"Information log, no resolution required."},{"function":"run_service_thread","message_template":"SERVICE_THREAD_NAME - reloading config","reason":"The service thread is reloading the log configuration from the database.","resolution":"Information log, no resolution required."},{"function":"run_service_thread","message_template":"SERVICE_THREAD_NAME - no active configuration until log config DB is corrected","reason":"The service thread couldn't read the log configuration database, so there's no active configuration.","resolution":"Check the log configuration database for issues and correct them."},{"function":"run_service_thread","message_template":"SERVICE_THREAD_NAME exiting","reason":"The service thread is shutting down as part of normal server shutdown.","resolution":"Information log, no resolution required."},{"function":"sct_daemon_thread","message_template":"DAEMON_THREAD_NAME started","reason":"The SCT maintenance daemon thread has started successfully.","resolution":"Information log, no resolution required."},{"function":"sct_daemon_thread","message_template":"DAEMON_THREAD_NAME - exiting","reason":"The SCT maintenance daemon thread is shutting down as part of normal server shutdown.","resolution":"Information log, no resolution required."}],"project":"apache\/httpd"}