{"module":"mod_ssl.c","summary":"Core Apache module for SSL\/TLS support that handles configuration, initialization, and management of secure connections. It implements SSL protocol setup, certificate handling, and secure communication between clients and the web server.","logs":[{"function":"ssl_hook_ssl_bind_outgoing","message_template":"SSL Proxy requested for %s but not enabled for us.","reason":"A proxy connection is requesting SSL\/TLS, but the server is not configured to enable SSL for this virtual host.","resolution":"Enable SSL for the specified virtual host by setting SSLProxyEngine On in the virtual host configuration."},{"function":"ssl_init_ssl_connection","message_template":"Unable to create a new SSL connection from the SSL context","reason":"Failed to create an SSL connection object, likely due to memory issues or OpenSSL configuration problems.","resolution":"Check OpenSSL configuration, ensure sufficient system resources, and verify SSL certificates and keys are properly configured."},{"function":"ssl_init_ssl_connection","message_template":"Unable to set session id context to '%s'","reason":"Failed to set the SSL session ID context, which identifies the server instance for session caching.","resolution":"Check for memory issues or OpenSSL configuration problems. May require upgrading OpenSSL if there's a bug in the library."},{"function":"ssl_hook_pre_connection","message_template":"Connection to child %ld established (server %s)","reason":"Informational message indicating a successful connection established to a child process for a particular server virtual host.","resolution":"Information log, no resolution required."},{"function":"ssl_hook_process_connection","message_template":"SSL handshake was not completed, closing connection","reason":"The SSL\/TLS handshake process failed to complete successfully, causing the connection to be closed.","resolution":"Check client SSL configuration, verify server certificates are valid and trusted, ensure cipher compatibility between client and server, and check for network issues preventing handshake completion."}],"project":"apache\/httpd"}