{"module":"ssl_engine_pphrase.c","summary":"This module handles passphrase retrieval for encrypted private keys used by mod_ssl. It supports multiple dialog mechanisms (builtin terminal, pipe, filter) and integrates with OpenSSL ENGINE API and STORE API for hardware-backed keys and PKCS#11 devices.","logs":[{"function":"ssl_load_encrypted_pkey","message_template":"Init: No private key specified for %s","reason":"Logs an error when no private key file is specified for a virtual host","resolution":"Configure SSLCertificateKeyFile directive in the virtual host configuration"},{"function":"ssl_load_encrypted_pkey","message_template":"Init: Can't open server private key file %s","reason":"Logs an error when the specified private key file cannot be opened or read","resolution":"Check file permissions and ensure the file exists at the specified path"},{"function":"ssl_load_encrypted_pkey","message_template":"Reusing existing private key from %s on restart","reason":"Informational message when a previously loaded private key is reused after server restart","resolution":"Information log, no resolution required"},{"function":"ssl_load_encrypted_pkey","message_template":"Attempting to load encrypted (?) private key %s","reason":"Informational message indicating an attempt to load a potentially encrypted private key","resolution":"Information log, no resolution required"},{"function":"ssl_pphrase_Handle_CB","message_template":"Apache:mod_ssl:Error: Pass phrase incorrect (%d more retr%s permitted).","reason":"Indicates that an incorrect passphrase was provided for an encrypted private key","resolution":"Provide the correct passphrase for the private key. If you've forgotten it, you'll need to regenerate the key"},{"function":"ssl_load_encrypted_pkey","message_template":"Init: SSLPassPhraseDialog builtin is not supported on Win32 (key file %s)","reason":"The builtin passphrase dialog mechanism is not supported on Windows platforms","resolution":"On Windows servers, use SSLPassPhraseDialog with 'exec:' or 'pipe:' instead of 'builtin'"},{"function":"ssl_load_encrypted_pkey","message_template":"Init: Unable to read pass phrase [Hint: key introduced or changed before restart?]","reason":"Failed to get a passphrase for an encrypted key, possibly because the key was added or changed after the server was started","resolution":"Restart the server completely rather than using a graceful restart, or configure a more reliable passphrase dialog mechanism"},{"function":"ssl_load_encrypted_pkey","message_template":"Init: Private key not found","reason":"The specified private key file could not be found or opened","resolution":"Check that the path to the private key file is correct and that the Apache process has read permission for the file"},{"function":"ssl_load_encrypted_pkey","message_template":"Apache:mod_ssl:Error: Private key not found.\n**Stopped\n","reason":"Terminal output indicating that the server is stopping due to a missing private key","resolution":"Check that the private key file exists and is accessible to the Apache process"},{"function":"ssl_load_encrypted_pkey","message_template":"Init: Pass phrase incorrect for key %s","reason":"The passphrase provided for the encrypted private key is incorrect","resolution":"Provide the correct passphrase or regenerate the key if the passphrase is forgotten"},{"function":"ssl_load_encrypted_pkey","message_template":"Apache:mod_ssl:Error: Pass phrase incorrect.\n**Stopped\n","reason":"Terminal output indicating that the server is stopping due to an incorrect passphrase","resolution":"Provide the correct passphrase for the private key file"},{"function":"ssl_load_encrypted_pkey","message_template":"Init: Unable to read server private key from file %s","reason":"The server was unable to read or parse the private key file, possibly due to file corruption or an incorrect format","resolution":"Check that the key file is valid and in the correct format (PEM or DER). Try regenerating the key if necessary"},{"function":"ssl_load_encrypted_pkey","message_template":"unencrypted %s private key - pass phrase not required","reason":"Informational message indicating that the private key is not encrypted","resolution":"Information log, no resolution required. Consider encrypting the key for improved security"},{"function":"ssl_load_encrypted_pkey","message_template":"encrypted %s private key - pass phrase requested","reason":"Informational message indicating that a passphrase was requested for an encrypted key","resolution":"Information log, no resolution required"},{"function":"ssl_load_encrypted_pkey","message_template":"encrypted %s private key - pass phrase reused","reason":"Informational message indicating that a previously entered passphrase is being reused","resolution":"Information log, no resolution required"},{"function":"ssl_load_encrypted_pkey","message_template":"OK: Pass Phrase Dialog successful.","reason":"Informational message indicating that the passphrase was successfully obtained","resolution":"Information log, no resolution required"},{"function":"ssl_pipe_child_create","message_template":"Init: Creating pass phrase dialog pipe child '%s'","reason":"Informational message when setting up a child process to handle passphrase dialog via a pipe","resolution":"Information log, no resolution required"},{"function":"ssl_pipe_child_create","message_template":"Init: Failed to create pass phrase pipe '%s'","reason":"Error message when the pipe for passphrase dialog could not be created","resolution":"Check that the specified program exists and is executable. Verify the command syntax in the SSLPassPhraseDialog directive"},{"function":"ssl_pphrase_Handle_CB","message_template":"Init: Requesting pass phrase via piped dialog","reason":"Informational message indicating a passphrase is being requested through a pipe to an external program","resolution":"Information log, no resolution required"},{"function":"ssl_pphrase_Handle_CB","message_template":"Init: Requesting pass phrase via builtin terminal dialog","reason":"Informational message indicating a passphrase is being requested through the built-in terminal dialog","resolution":"Information log, no resolution required"},{"function":"ssl_pphrase_Handle_CB","message_template":"%s mod_ssl (Pass Phrase Dialog)","reason":"Header message for the built-in passphrase dialog","resolution":"Information log, no resolution required"},{"function":"ssl_pphrase_Handle_CB","message_template":"Apache:mod_ssl:Error: Pass phrase empty (needs to be at least 1 character).","reason":"Error message when an empty passphrase is provided","resolution":"Enter a non-empty passphrase when prompted"},{"function":"ssl_pphrase_Handle_CB","message_template":"Init: Requesting pass phrase from dialog filter program (%s)","reason":"Informational message indicating a passphrase is being requested from an external filter program","resolution":"Information log, no resolution required"},{"function":"modssl_load_keypair_engine","message_template":"Init: Unrecognized private key identifier `%s'","reason":"Error when the format of a private key identifier for an OpenSSL engine is not recognized","resolution":"Check the format of the key identifier. It should be in the form 'engine:keyid'"},{"function":"modssl_load_keypair_engine","message_template":"Init: Failed to load engine for private key %s","reason":"Error when the specified OpenSSL engine could not be loaded","resolution":"Verify that the engine is properly installed and configured. Check OpenSSL engine configuration"},{"function":"modssl_load_keypair_engine","message_template":"Init: Failed to initialize engine %s for private key %s","reason":"Error when the OpenSSL engine was loaded but failed to initialize","resolution":"Check engine-specific configuration. Ensure any required hardware tokens or smart cards are properly connected"},{"function":"modssl_load_keypair_engine","message_template":"Init: Initialized engine %s for private key %s","reason":"Informational message indicating successful initialization of an OpenSSL engine","resolution":"Information log, no resolution required"},{"function":"modssl_load_keypair_engine","message_template":"Init: Unable to get the certificate","reason":"Error when unable to retrieve a certificate from an OpenSSL engine","resolution":"Check that the certificate identifier is correct. Verify that the certificate is available in the engine or token"},{"function":"modssl_load_keypair_engine","message_template":"Init: Unable to get the private key","reason":"Error when unable to retrieve a private key from an OpenSSL engine","resolution":"Check that the private key identifier is correct. Verify that the key is available in the engine or token"},{"function":"modssl_load_keypair_store","message_template":"Init: OSSL_STORE_open failed for PKCS#11 URI `%s'","reason":"Error when attempting to open a PKCS#11 URI with the OpenSSL STORE API","resolution":"Verify the URI format. Check that the PKCS#11 module is properly installed and that the token is available"},{"function":"modssl_load_keypair_store","message_template":"Init: OSSL_STORE_INFO_PKEY lookup failed for private key identifier `%s'","reason":"Error when the STORE API failed to find the private key with the given identifier","resolution":"Check that the key identifier is correct. Verify that the token is properly initialized and the key is available"},{"function":"modssl_load_keypair_store","message_template":"Init: OSSL_STORE_INFO_CERT lookup failed for certificate identifier `%s'","reason":"Error when the STORE API failed to find the certificate with the given identifier","resolution":"Check that the certificate identifier is correct. Verify that the token is properly initialized and the certificate is available"},{"function":"modssl_load_engine_keypair","message_template":"Init: no method for loading keypair for %s (%s | %s)","reason":"Error when no suitable method (ENGINE or STORE) is available for loading the specified keypair","resolution":"Check that either OpenSSL ENGINE support or STORE support is compiled in. Verify key identifier format"}],"project":"apache\/httpd"}