{"module":"ssl_stapling.c","summary":"This module implements OCSP stapling functionality in Apache's mod_ssl. It handles retrieving, validating, caching, and serving OCSP responses to clients for certificate validation, reducing the need for clients to perform separate OCSP checks.","logs":[{"function":"ssl_stapling_init_cert","message_template":"ssl_stapling_init_cert: can't retrieve issuer certificate!","reason":"Failed to obtain the issuer certificate for a server certificate. The stapling process requires the issuer certificate to create proper OCSP requests.","resolution":"Ensure the certificate chain is complete and properly configured. Check that the server has access to the issuer certificate, either in the configured certificate chain or in the trusted certificate store."},{"function":"ssl_stapling_init_cert","message_template":"OCSP stapling added via hook","reason":"OCSP stapling functionality has been successfully added through a module hook rather than direct mod_ssl implementation.","resolution":"Information log, no resolution required. This indicates another module is providing OCSP stapling support."},{"function":"ssl_stapling_init_cert","message_template":"ssl_stapling_init_cert: no OCSP URI in certificate and no SSLStaplingForceURL configured for server %s","reason":"The certificate doesn't contain an OCSP URI and no alternative URL was configured via SSLStaplingForceURL directive.","resolution":"Either use a certificate that includes an OCSP responder URI or configure a specific responder URL using the SSLStaplingForceURL directive in the server configuration."},{"function":"ssl_stapling_init_cert","message_template":"ssl_stapling_init_cert: can't create CertID for OCSP request","reason":"Failed to create a certificate ID required for OCSP querying. This is a critical step in the OCSP stapling process.","resolution":"This likely indicates a problem with certificate format or incompatibility. Try regenerating the server certificate or check OpenSSL library compatibility."},{"function":"ssl_stapling_init_cert","message_template":"ssl_stapling_init_cert: no OCSP URI in certificate and no SSLStaplingForceURL set","reason":"The certificate doesn't contain an OCSP URI and no alternative URL was configured.","resolution":"Either use a certificate that includes an OCSP responder URI or configure a specific responder URL using the SSLStaplingForceURL directive."},{"function":"ssl_stapling_init_cert","message_template":"ssl_stapling_init_cert: storing certinfo for server %s","reason":"Successfully storing certificate information for OCSP stapling for the specified server.","resolution":"Information log, no resolution required. This indicates proper functioning of the OCSP stapling initialization."},{"function":"stapling_get_certinfo","message_template":"stapling_get_certinfo: stapling not supported for certificate","reason":"OCSP stapling cannot be performed for this certificate, likely because certificate info couldn't be found in the cache.","resolution":"Ensure the certificate is properly configured and that stapling initialization has been performed for this certificate. Check for other errors occurring during initialization."},{"function":"stapling_cache_response","message_template":"OCSP stapling response encode error??","reason":"Failed to encode the OCSP response for caching. The response may be malformed or corrupted.","resolution":"This is likely an internal error with the OCSP response received. Check the OCSP responder health and consider validating responses manually. May require OpenSSL library updates if it's a known issue."},{"function":"stapling_cache_response","message_template":"OCSP stapling response too big (%u bytes)","reason":"The OCSP response exceeds the maximum allowed size (10240 bytes) and cannot be cached.","resolution":"Contact your Certificate Authority to investigate why the OCSP response is unusually large. It may contain unnecessary certificate chains or other data that could be omitted."},{"function":"stapling_cache_response","message_template":"stapling_cache_response: OCSP response session store error!","reason":"Failed to store the OCSP response in the cache. The cache storage mechanism may be unavailable or misconfigured.","resolution":"Check the stapling cache configuration and ensure the cache backend is functioning properly. Look for other error messages related to the cache subsystem."},{"function":"stapling_get_cached_response","message_template":"stapling_get_cached_response: cache miss","reason":"No cached OCSP response was found for the certificate. A fresh response will need to be obtained.","resolution":"Information log, no resolution required. This is normal on the first request for a certificate or when cached responses expire."},{"function":"stapling_get_cached_response","message_template":"stapling_get_cached_response: response length invalid??","reason":"The cached OCSP response has an invalid length, possibly due to cache corruption.","resolution":"Clear the stapling cache to remove potentially corrupted entries. The system will automatically fetch a fresh response. If this occurs frequently, check for memory issues or cache backend problems."},{"function":"stapling_get_cached_response","message_template":"stapling_get_cached_response: response parse error??","reason":"Failed to parse the retrieved cached OCSP response. The cache entry may be corrupted.","resolution":"Clear the stapling cache to remove potentially corrupted entries. The system will automatically fetch a fresh response. If this occurs frequently, check for memory issues or cache backend problems."},{"function":"stapling_get_cached_response","message_template":"stapling_get_cached_response: cache hit","reason":"Successfully retrieved a cached OCSP response for the certificate.","resolution":"Information log, no resolution required. This indicates normal operation of the OCSP stapling cache."},{"function":"stapling_check_response","message_template":"stapling_check_response: Error Parsing Response!","reason":"Failed to parse the OCSP response as a valid basic OCSP response structure.","resolution":"This may indicate issues with the OCSP responder sending malformed responses. Check the OCSP responder health and possibly report the issue to your Certificate Authority."},{"function":"stapling_check_response","message_template":"stapling_check_response: certificate ID not present in response!","reason":"The OCSP response does not contain status information for the requested certificate ID.","resolution":"The OCSP responder may not be correctly configured for your certificate. Contact your Certificate Authority to ensure the certificate is properly registered with their OCSP service."},{"function":"stapling_check_response","message_template":"stapling_check_response: response times invalid","reason":"The OCSP response contains invalid timestamps for this update and next update fields.","resolution":"This could indicate clock synchronization issues either on your server or at the OCSP responder. Check server time synchronization and possibly contact your Certificate Authority about responder time issues."},{"function":"stapling_check_response","message_template":"stapling_check_response: cached response expired","reason":"The cached OCSP response has expired according to its nextUpdate field.","resolution":"Information log, no resolution required. The system will automatically fetch a fresh response."},{"function":"stapling_check_response","message_template":"stapling_check_response: response has certificate status %s (reason: %s) for serial number %s","reason":"The OCSP response indicates a non-good status for the certificate. This may indicate the certificate is revoked or under an unknown status.","resolution":"If the certificate shows as revoked, you must replace it immediately. Contact your Certificate Authority to understand why the certificate was revoked and obtain a new one if necessary."},{"function":"stapling_renew_response","message_template":"stapling_renew_response: querying responder","reason":"Initiating a query to the OCSP responder to obtain a fresh response.","resolution":"Information log, no resolution required. This indicates normal operation of OCSP response renewal."},{"function":"stapling_renew_response","message_template":"stapling_renew_response: no uri for responder","reason":"Cannot renew the OCSP response because no responder URI is available.","resolution":"Either use a certificate that includes an OCSP responder URI or configure a specific responder URL using the SSLStaplingForceURL directive."},{"function":"stapling_renew_response","message_template":"stapling_renew_response: Error parsing uri %s","reason":"The OCSP responder URI could not be parsed. The URI may be malformed.","resolution":"If using SSLStaplingForceURL, check the URL format. If the URI comes from the certificate, the certificate may have a malformed OCSP URI. Contact your Certificate Authority to fix the certificate."},{"function":"stapling_renew_response","message_template":"stapling_renew_response: Unsupported uri %s","reason":"The OCSP responder URI uses an unsupported protocol. Only HTTP is supported.","resolution":"Configure an HTTP-based OCSP responder URI using SSLStaplingForceURL or obtain a certificate with an HTTP-based OCSP responder URI."},{"function":"stapling_renew_response","message_template":"stapling_renew_response: responder error","reason":"Failed to obtain a response from the OCSP responder. The responder may be unavailable or network issues may be preventing connection.","resolution":"Check network connectivity to the OCSP responder. Verify the responder is operational by testing manually. If using SSLStaplingForceURL, ensure the URL is correct."},{"function":"stapling_renew_response","message_template":"stapling_renew_response: query response received","reason":"Successfully received a response from the OCSP responder.","resolution":"Information log, no resolution required. This indicates normal operation of OCSP response renewal."},{"function":"stapling_renew_response","message_template":"stapling_renew_response: error in retrieved response!","reason":"The response received from the OCSP responder is invalid or indicates an error.","resolution":"This may indicate issues with the OCSP responder. Check if similar issues occur with other certificates. Consider contacting your Certificate Authority to report responder issues."},{"function":"stapling_renew_response","message_template":"stapling_renew_response: responder error %s","reason":"The OCSP responder returned an error status rather than a successful status.","resolution":"The error message provides details about the specific responder error. Contact your Certificate Authority with this information to resolve issues with their OCSP service."},{"function":"stapling_renew_response","message_template":"stapling_renew_response: error caching response!","reason":"Failed to cache the renewed OCSP response. The cache storage mechanism may be unavailable or misconfigured.","resolution":"Check the stapling cache configuration and ensure the cache backend is functioning properly. Look for other error messages related to the cache subsystem."},{"function":"stapling_mutex_reinit_helper","message_template":"Cannot reinit %s mutex with file `%s'","reason":"Failed to reinitialize a mutex used for stapling operations with the specified lock file.","resolution":"Check file permissions and directory write access for the lock file path. Ensure the process has sufficient permissions to create and write to lock files."},{"function":"stapling_mutex_reinit_helper","message_template":"Cannot reinit %s mutex","reason":"Failed to reinitialize a mutex used for stapling operations (no lock file specified).","resolution":"Check server configuration and system resources. The error may be related to memory issues or process privileges."},{"function":"stapling_mutex_on","message_template":"Failed to acquire OCSP %s lock","reason":"Failed to acquire a mutex lock needed for stapling operations. This could prevent proper caching of OCSP responses.","resolution":"Check for system resource issues such as too many open files or excessive lock contention. Look for stale lock files if using file-based locks."},{"function":"stapling_mutex_off","message_template":"Failed to release OCSP %s lock","reason":"Failed to release a mutex lock after stapling operations. This could lead to deadlocks.","resolution":"Check for system resource issues or possible bugs in the mutex handling. If persistent, restart the server to clear potentially stuck locks."},{"function":"stapling_cb","message_template":"stapling_cb: OCSP Stapling callback called","reason":"The OCSP stapling callback has been invoked due to a client requesting certificate status.","resolution":"Information log, no resolution required. This indicates normal operation of OCSP stapling."},{"function":"stapling_cb","message_template":"stapling_cb: OCSP Stapling disabled","reason":"OCSP stapling callback was called but stapling is disabled for this server.","resolution":"Information log, no resolution required. If you want to enable OCSP stapling, use the SSLUseStapling directive."},{"function":"stapling_cb","message_template":"stapling_cb: retrieved cached certificate data","reason":"Successfully retrieved cached certificate information needed for stapling.","resolution":"Information log, no resolution required. This indicates normal operation of OCSP stapling."},{"function":"stapling_cb","message_template":"stapling_cb: retrieved cached response","reason":"Successfully retrieved a cached OCSP response.","resolution":"Information log, no resolution required. This indicates normal operation of OCSP stapling."},{"function":"stapling_cb","message_template":"stapling_cb: renewing cached response","reason":"Initiating renewal of the cached OCSP response because it's missing or invalid.","resolution":"Information log, no resolution required. This indicates normal operation of OCSP stapling."},{"function":"stapling_cb","message_template":"stapling_cb: error checking for cached response after obtaining refresh mutex","reason":"Failed to check for a cached response after acquiring the refresh mutex.","resolution":"This could indicate internal errors or resource issues. Check for other error messages that might provide more context. If persistent, restart the server."},{"function":"stapling_cb","message_template":"stapling_cb: don't need to refresh cached response after obtaining refresh mutex","reason":"After acquiring the refresh mutex, found that another thread has already refreshed the response.","resolution":"Information log, no resolution required. This indicates normal concurrent operation of OCSP stapling."},{"function":"stapling_cb","message_template":"stapling_cb: still must refresh cached response after obtaining refresh mutex","reason":"After acquiring the refresh mutex, confirmed that the response still needs refreshing.","resolution":"Information log, no resolution required. This indicates normal concurrent operation of OCSP stapling."},{"function":"stapling_cb","message_template":"stapling_cb: success renewing response","reason":"Successfully renewed the OCSP response from the responder.","resolution":"Information log, no resolution required. This indicates normal operation of OCSP stapling."},{"function":"stapling_cb","message_template":"stapling_cb: fatal error renewing response","reason":"A critical error occurred while attempting to renew the OCSP response.","resolution":"Check previous error messages for specific details. This could indicate network issues, responder problems, or internal errors. Check connectivity to the OCSP responder and its operational status."},{"function":"stapling_cb","message_template":"stapling_cb: setting response","reason":"Setting the OCSP response to be sent to the client.","resolution":"Information log, no resolution required. This indicates normal operation of OCSP stapling."},{"function":"stapling_cb","message_template":"stapling_cb: no suitable response available","reason":"No valid OCSP response is available to send to the client. The client will need to check revocation status separately.","resolution":"Check previous error messages to understand why response renewal might have failed. Ensure the OCSP responder is accessible and properly configured."},{"function":"modssl_init_stapling","message_template":"SSLStapling: no stapling cache available","reason":"OCSP stapling initialization failed because no cache is configured.","resolution":"Configure a cache for OCSP stapling using the SSLStaplingCache directive. This is required for stapling to function."},{"function":"modssl_init_stapling","message_template":"SSLStapling: cannot initialise stapling mutex","reason":"Failed to initialize mutex needed for stapling operations.","resolution":"Check server permissions and resources. Ensure the server has permissions to create lock files in the configured directory."},{"function":"modssl_init_stapling","message_template":"OCSP stapling initialized","reason":"OCSP stapling has been successfully initialized and is ready to serve responses.","resolution":"Information log, no resolution required. This indicates successful configuration of OCSP stapling."}],"project":"apache\/httpd"}