{"module":"ssl_scache.c","summary":"This module implements session cache abstraction for SSL\/TLS in the Apache HTTP Server. It provides functionality for initialization, storage, retrieval, and removal of session data, along with status reporting through mod_status integration.","logs":[{"function":"ssl_scache_init","message_template":"Could not initialize stapling cache. Exiting.","reason":"Logs a critical error when the OCSP stapling cache fails to initialize, causing the server to exit. Likely due to permission issues, disk space problems, or configuration errors.","resolution":"Check directory permissions for cache storage, ensure sufficient disk space, and verify that the stapling cache configuration (SSLStaplingCache directive) is correctly set up."},{"function":"ssl_scache_init","message_template":"Init: Session Cache is not configured [hint: SSLSessionCache]","reason":"Warns that SSL session cache is not configured, which can impact SSL\/TLS performance and functionality. The server will continue to operate but without session resumption.","resolution":"Configure the SSL session cache using the SSLSessionCache directive to improve SSL\/TLS performance. Without a session cache, each new connection requires a full SSL handshake."},{"function":"ssl_scache_init","message_template":"Could not initialize session cache. Exiting.","reason":"Logs a critical error when the SSL session cache fails to initialize, causing the server to exit. This could be due to resource limitations or configuration issues.","resolution":"Check the session cache configuration (SSLSessionCache directive), ensure the specified cache mechanism is available, and verify permissions for cache storage locations."},{"function":"ssl_scache_store","message_template":"session is too big (%u bytes)","reason":"Logs an error when an SSL session being stored exceeds the maximum allowed size (MODSSL_SESSION_MAX_DER). This prevents the session from being cached.","resolution":"This is usually a rare condition that may indicate unusual SSL session characteristics. If it occurs frequently, investigate what might be causing abnormally large sessions, such as unusual cipher configurations or client behavior."},{"function":"ssl_ext_status_hook","message_template":"SSL\/TLS Session Cache Status:","reason":"Part of the status output to display SSL\/TLS session cache information in the server status page. This is informational content, not an error.","resolution":"Information only, no resolution required. This is part of the mod_status output."},{"function":"ssl_ext_status_hook","message_template":"TLSSessionCacheStatus","reason":"Short format label for the SSL\/TLS session cache status information in the server status page.","resolution":"Information only, no resolution required. This is part of the mod_status output in short format."}],"project":"apache\/httpd"}