{"module":"ssl_engine_init.c","summary":"This module handles SSL\/TLS initialization for Apache server instances, configuring SSL contexts, loading certificates and private keys, setting up security parameters, and validating configurations. It is a core component of mod_ssl, providing the interface between Apache and OpenSSL.","logs":[{"function":"ssl_init_Module","message_template":"Init: this version of mod_ssl was compiled against a newer library (%s (%s), version currently loaded is 0x%lX) - may result in undefined or erroneous behavior","reason":"The loaded OpenSSL library version is older than the version mod_ssl was compiled against, which might cause compatibility issues.","resolution":"Update the installed OpenSSL library to match or exceed the version used during compilation of mod_ssl."},{"function":"ssl_init_Engine","message_template":"Init: Failed to load Crypto Device API `%s'","reason":"The specified crypto device\/engine failed to load, usually related to hardware acceleration modules.","resolution":"Verify that the crypto device is properly installed and the module is available in the OpenSSL configuration."},{"function":"ssl_init_Engine","message_template":"Init: Failed to enable Crypto Device API `%s'","reason":"The crypto device was found but could not be enabled for use by OpenSSL.","resolution":"Check system logs for device-specific errors, ensure proper device permissions, and verify device-specific configuration."},{"function":"ssl_init_Engine","message_template":"Init: loaded Crypto Device API `%s'","reason":"Successfully loaded and enabled the specified crypto engine or device.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_Module","message_template":"Init: Initialized %s library","reason":"Successfully initialized the SSL library (likely OpenSSL).","resolution":"Informational log, no resolution required."},{"function":"ssl_init_Module","message_template":"PRNG does not contain sufficient randomness. Build the SSL library with a suitable entropy source configured.","reason":"The Pseudo Random Number Generator doesn't have enough entropy, which is critical for security.","resolution":"Ensure the system has proper entropy sources (hardware random number generator, haveged, rngd) and rebuild OpenSSL with appropriate entropy source configuration."},{"function":"ssl_init_Module","message_template":"Could not enable FIPS mode","reason":"Failed to enable FIPS (Federal Information Processing Standard) mode in OpenSSL.","resolution":"Verify that OpenSSL was built with FIPS support and that the FIPS module has been properly installed and validated."},{"function":"ssl_init_Module","message_template":"has FIPS mode enabled","reason":"OpenSSL is running with FIPS mode enabled, ensuring compliance with U.S. government security standards.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_Module","message_template":"has FIPS mode disabled","reason":"OpenSSL is running with FIPS mode disabled.","resolution":"Informational log, no resolution required. Enable FIPS mode if compliance with U.S. government security standards is required."},{"function":"ssl_init_Module","message_template":"Init: Initializing (virtual) servers for SSL","reason":"Starting the initialization process for SSL-enabled virtual hosts.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_Module","message_template":"Init: Wiped out the queried pass phrases from memory","reason":"Successfully cleared SSL certificate pass phrases from memory for security purposes.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_Module","message_template":"Could not open log file '%s' configured via SSLKEYLOGFILE","reason":"Failed to open the specified file for logging SSL\/TLS key material. This feature is used for debugging TLS connections.","resolution":"Check file path permissions and ensure the directory exists for the SSLKEYLOGFILE path."},{"function":"ssl_init_Module","message_template":"Init: Logging SSL private key material to %s","reason":"SSL\/TLS key material is being logged to the specified file, which is a security risk in production environments.","resolution":"This should be disabled in production environments as it compromises connection security. Only use for debugging purposes."},{"function":"ssl_init_ctx_tls_extensions","message_template":"Configuring TLS extension handling","reason":"Initializing TLS extensions like SNI, OCSP stapling, etc.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_ctx_tls_extensions","message_template":"Unable to initialize TLS servername extension callback (incompatible OpenSSL version?)","reason":"Server Name Indication (SNI) callback could not be initialized, likely due to OpenSSL version incompatibility.","resolution":"Upgrade to a version of OpenSSL that supports TLS extensions (1.0.1 or later for SNI)."},{"function":"ssl_init_ctx_tls_extensions","message_template":"Using SRP verifier file [%s]","reason":"Using the specified SRP (Secure Remote Password) verifier file for authentication.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_ctx_tls_extensions","message_template":"Unable to initialize SRP verifier structure [%s seed]","reason":"Failed to initialize the SRP verification structure needed for SRP authentication.","resolution":"Check the SRP configuration, ensure the verifier file is properly formatted, and verify OpenSSL was built with SRP support."},{"function":"ssl_init_ctx_tls_extensions","message_template":"Unable to load SRP verifier file [error %d]","reason":"Could not load the SRP verifier database from the specified file.","resolution":"Verify the SRP file exists, has correct permissions, and is properly formatted."},{"function":"ssl_init_ctx_protocol","message_template":"Allowing SSLProtocol %s even though it is disabled by OpenSSL by default on this system","reason":"Enabling a protocol that OpenSSL considers insecure by default, which may present a security risk.","resolution":"Consider using more secure protocol versions unless compatibility with older clients is absolutely necessary."},{"function":"ssl_init_ctx_protocol","message_template":"No SSL protocols available [hint: SSLProtocol]","reason":"No SSL\/TLS protocols are enabled in the current configuration.","resolution":"Configure at least one protocol using SSLProtocol directive (e.g., TLSv1.2) in the Apache configuration."},{"function":"ssl_init_ctx_protocol","message_template":"Creating new SSL context (protocols: %s)","reason":"Creating a new SSL context with the specified protocol versions enabled.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_ctx_verify","message_template":"Configuring client authentication","reason":"Setting up certificate-based client authentication.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_ctx_verify","message_template":"Unable to configure verify locations for client authentication","reason":"Failed to set up certificate verification locations (CA certificates) for client authentication.","resolution":"Ensure the CA certificate file\/path exists, has correct permissions, and contains valid certificates in PEM format."},{"function":"ssl_init_ctx_verify","message_template":"Unable to determine list of acceptable CA certificates for client authentication","reason":"Failed to build a list of CA names for client certificate requests.","resolution":"Check that the CA certificate files exist, are readable, and contain valid CA certificates."},{"function":"ssl_init_ctx_verify","message_template":"Init: Oops, you want to request client authentication, but no CAs are known for verification!? [Hint: SSLCACertificate*]","reason":"Client authentication is enabled but no CA certificates are configured to verify client certificates.","resolution":"Configure SSLCACertificateFile or SSLCACertificatePath to specify the trusted CA certificates for client verification."},{"function":"ssl_init_ctx_cipher_suite","message_template":"Configuring permitted SSL ciphers [%s]","reason":"Setting up the allowed cipher suites for SSL\/TLS connections.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_ctx_cipher_suite","message_template":"Unable to configure permitted SSL ciphers","reason":"Failed to set the cipher list for SSL connections, often because none of the specified ciphers are supported by OpenSSL.","resolution":"Check the SSLCipherSuite directive and ensure at least some of the specified ciphers are supported by the installed OpenSSL version."},{"function":"ssl_init_ctx_cipher_suite","message_template":"Unable to configure permitted TLSv1.3 ciphers","reason":"Failed to set TLSv1.3 specific ciphersuites.","resolution":"Verify that the OpenSSL version supports TLSv1.3 (1.1.1 or later) and that the ciphersuites specified are valid TLSv1.3 ciphersuites."},{"function":"ssl_init_ctx_crl","message_template":"Host %s: CRL checking has been enabled, but neither %sCARevocationFile nor %sCARevocationPath is configured","reason":"Certificate Revocation List (CRL) checking is enabled but no CRL sources are configured.","resolution":"Configure SSLCARevocationFile or SSLCARevocationPath to specify where CRLs should be loaded from."},{"function":"ssl_init_ctx_crl","message_template":"Configuring certificate revocation facility","reason":"Setting up the CRL checking mechanism.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_ctx_crl","message_template":"Host %s: unable to configure X.509 CRL storage for certificate revocation","reason":"Failed to initialize the CRL storage, usually because the specified CRL files or paths could not be loaded.","resolution":"Verify that the CRL files exist, have correct permissions, and are in the correct format (PEM)."},{"function":"ssl_init_ctx_crl","message_template":"Host %s: X.509 CRL storage locations configured, but CRL checking (%sCARevocationCheck) is not enabled","reason":"CRL sources are configured but CRL checking is not enabled in the configuration.","resolution":"Enable CRL checking with the SSLCARevocationCheck directive if CRL verification is desired."},{"function":"ssl_init_ctx_cert_chain","message_template":"Failed to configure CA certificate chain!","reason":"Failed to load or configure the CA certificate chain for the server certificate.","resolution":"Verify that the certificate chain file exists, has correct permissions, and contains valid PEM-formatted certificates."},{"function":"ssl_init_ctx_cert_chain","message_template":"Configuring server certificate chain (%d CA certificate%s)","reason":"Successfully configured the certificate chain for the server with the specified number of CA certificates.","resolution":"Informational log, no resolution required."},{"function":"ssl_check_public_cert","message_template":"%s server certificate is a CA certificate (BasicConstraints: CA == TRUE !?)","reason":"The server certificate is marked as a CA certificate, which is not recommended for server authentication.","resolution":"Use a proper end-entity (non-CA) certificate for the server. CA certificates should only be used for signing other certificates."},{"function":"ssl_check_public_cert","message_template":"%s server certificate is not a leaf certificate (BasicConstraints: pathlen == %d > 0 !?)","reason":"The server certificate has a non-zero path length constraint, indicating it's designed to be an intermediate CA rather than an end-entity certificate.","resolution":"Use a proper end-entity (leaf) certificate for the server that doesn't have CA capabilities."},{"function":"ssl_check_public_cert","message_template":"%s server certificate does NOT include an ID which matches the server name","reason":"The server certificate's Subject Alternative Name (SAN) or Common Name (CN) doesn't match the server hostname, which will cause certificate validation errors for clients.","resolution":"Use a certificate that includes the server's hostname in either the Subject Alternative Name extension or the Common Name field."},{"function":"ssl_init_server_certs","message_template":"Failed to configure certificate %s, check %s","reason":"Failed to load or configure the specified server certificate file.","resolution":"Verify the certificate file exists, has correct permissions, and contains a valid certificate in PEM format."},{"function":"ssl_init_server_certs","message_template":"Failed to configure certificate %s (with chain), check %s","reason":"Failed to load or configure the server certificate file with its certificate chain.","resolution":"Verify the certificate file exists, has correct permissions, and contains a valid certificate chain in PEM format."},{"function":"ssl_init_server_certs","message_template":"Failed to configure certificate %s from %s, check %s","reason":"Failed to load or configure a certificate from a crypto engine or provider.","resolution":"Verify the certificate identifier is correct and the crypto provider is properly configured."},{"function":"ssl_init_server_certs","message_template":"Failed to configure private key %s from %s","reason":"Failed to load or configure a private key from a crypto engine or provider.","resolution":"Verify the key identifier is correct and the crypto provider is properly configured and accessible."},{"function":"ssl_init_server_certs","message_template":"Failed to configure encrypted (?) private key %s, check %s","reason":"Failed to load or decrypt an encrypted private key file.","resolution":"Ensure the correct passphrase is provided for the encrypted key and that the key file is in the correct format."},{"function":"ssl_init_server_certs","message_template":"Certificate and private key %s from %s and %s do not match","reason":"The loaded certificate and private key don't correspond to each other.","resolution":"Ensure you're using the correct key file that matches the certificate. These must be a matching pair."},{"function":"ssl_init_server_certs","message_template":"Unable to retrieve certificate %s","reason":"Failed to retrieve the certificate from the SSL context after loading.","resolution":"This indicates an internal error. Check previous error logs for more details on why the certificate couldn't be loaded properly."},{"function":"ssl_init_server_certs","message_template":"Unable to configure certificate %s for stapling","reason":"Failed to configure OCSP stapling for the certificate.","resolution":"Verify OCSP settings, ensure the OCSP responder for the certificate is accessible, and check previous logs for specific errors."},{"function":"ssl_init_server_certs","message_template":"Certificate and private key %s configured from %s and %s","reason":"Successfully configured the certificate and private key from the specified files.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_server_certs","message_template":"Custom DH parameters (%d bits) for %s loaded from %s","reason":"Successfully loaded custom Diffie-Hellman parameters for key exchange from the specified file.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_server_certs","message_template":"ECDH curve %s for %s specified in %s","reason":"Successfully configured the specified elliptic curve for ECDH key exchange.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_ticket_key","message_template":"Failed to open ticket key file %s: (%d) %pm","reason":"Could not open the TLS session ticket key file, needed for session resumption across server restarts or load balancing.","resolution":"Verify the file exists and has correct permissions for the Apache process."},{"function":"ssl_init_ticket_key","message_template":"Failed to read %d bytes from %s: (%d) %pm","reason":"Could not read the expected data from the TLS session ticket key file.","resolution":"Verify the file contains enough data and is not corrupted."},{"function":"ssl_init_ticket_key","message_template":"Unable to initialize TLS session ticket key callback (incompatible OpenSSL version?)","reason":"Failed to set up the callback for TLS session tickets, likely due to OpenSSL version incompatibility.","resolution":"Upgrade to a version of OpenSSL that fully supports TLS session tickets or disable the SSLSessionTickets directive."},{"function":"ssl_init_ticket_key","message_template":"TLS session ticket key for %s successfully loaded from %s","reason":"Successfully loaded the TLS session ticket encryption key.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_proxy_certs","message_template":"incomplete client cert configured for SSL proxy (missing or encrypted private key?)","reason":"A client certificate for outgoing proxy connections is missing its private key or the key is encrypted.","resolution":"Ensure the proxy client certificate has its matching private key and that the key is not encrypted or provide a decryption mechanism."},{"function":"ssl_init_proxy_certs","message_template":"proxy client certificate and private key do not match","reason":"The client certificate and private key configured for proxy connections don't correspond to each other.","resolution":"Ensure you're using the correct key file that matches the proxy client certificate."},{"function":"ssl_init_proxy_certs","message_template":"no client certs found for SSL proxy","reason":"No client certificates were found for use with SSL proxy connections.","resolution":"If client authentication is required for proxied connections, configure valid client certificates using SSLProxyMachineCertificateFile or SSLProxyMachineCertificatePath."},{"function":"ssl_init_proxy_certs","message_template":"loaded %d client certs for SSL proxy","reason":"Successfully loaded the specified number of client certificates for use with SSL proxy connections.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_proxy_certs","message_template":"SSL proxy client cert initialization failed","reason":"Failed to initialize the client certificate for SSL proxy connections.","resolution":"Check previous error logs for more specific errors related to the proxy certificates or private keys."},{"function":"ssl_init_proxy_certs","message_template":"SSL proxy client cert chain verification failed: %s :","reason":"Failed to verify the certificate chain for a proxy client certificate.","resolution":"Ensure all intermediate CA certificates are properly configured using SSLProxyCACertificateFile or SSLProxyCACertificatePath."},{"function":"ssl_init_proxy_certs","message_template":"loaded %i intermediate CA%s for cert %i: ","reason":"Successfully loaded the specified number of intermediate CA certificates for a proxy client certificate.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_ConfigureServer","message_template":"Illegal attempt to re-initialise SSL for server (SSLEngine On should go in the VirtualHost, not in global scope.)","reason":"Attempted to reinitialize SSL for a server that already has SSL enabled, often due to having SSLEngine On in both global and virtual host scopes.","resolution":"Move SSLEngine On directives only into VirtualHost sections and remove from global configuration."},{"function":"ssl_init_server_ctx","message_template":"Init: %s will respond with '503 Service Unavailable' for now. There are no SSL certificates configured and no other module contributed any.","reason":"No SSL certificates have been configured for the virtual host, so it will return 503 errors to all SSL clients.","resolution":"Configure at least one certificate using SSLCertificateFile or have another module provide certificates."},{"function":"ssl_init_server_ctx","message_template":"\"SSLOpenSSLConfCmd %s %s\" failed for %s","reason":"Failed to apply a configuration command to the OpenSSL library.","resolution":"Check the syntax of the SSLOpenSSLConfCmd directive and ensure it's compatible with the installed OpenSSL version."},{"function":"ssl_init_server_ctx","message_template":"\"SSLOpenSSLConfCmd %s %s\" applied to %s","reason":"Successfully applied an OpenSSL configuration command.","resolution":"Informational log, no resolution required."},{"function":"ssl_init_server_ctx","message_template":"SSL_CONF_CTX_finish() failed","reason":"Failed to finalize OpenSSL configuration commands.","resolution":"Check previous error logs for specific OpenSSL errors and verify SSLOpenSSLConfCmd settings."},{"function":"ssl_init_server_ctx","message_template":"Failed to configure at least one certificate and key for %s","reason":"Failed to configure any valid certificate and key for the virtual host.","resolution":"Verify that all certificate and key files exist, have correct permissions, and are in valid formats. Check that private keys match their certificates."},{"function":"ssl_init_server_ctx","message_template":"Unable to configure certificate %s:%d for stapling","reason":"Failed to set up OCSP stapling for a specific certificate.","resolution":"Check OCSP responder availability, network connectivity, and previous logs for specific errors related to OCSP stapling."},{"function":"ssl_init_CheckServers","message_template":"Init: (%s) You configured HTTPS(%d) on the standard HTTP(%d) port!","reason":"SSL is enabled on a virtual host that's listening on the standard HTTP port (usually 80).","resolution":"This is usually a misconfiguration. Configure SSL on the standard HTTPS port (443) or make sure this mixed configuration is intentional."},{"function":"ssl_init_CheckServers","message_template":"Init: (%s) You configured HTTP(%d) on the standard HTTPS(%d) port!","reason":"SSL is disabled on a virtual host that's listening on the standard HTTPS port (usually 443).","resolution":"This is usually a misconfiguration. Either enable SSL for this host or change the port to the standard HTTP port (80)."},{"function":"ssl_init_CheckServers","message_template":"Init: SSL server IP\/port conflict: %s (%s:%d) vs. %s (%s:%d)","reason":"Multiple SSL-enabled virtual hosts are using the same IP address and port, but OpenSSL doesn't support TLS extensions (SNI).","resolution":"Either use different IP addresses for each SSL virtual host, upgrade to an OpenSSL version that supports SNI, or ensure all virtual hosts on the same IP:port have matching SSL configurations."},{"function":"ssl_init_CheckServers","message_template":"Init: Name-based SSL virtual hosts require an OpenSSL version with support for TLS extensions (RFC 6066 - Server Name Indication \/ SNI), but the currently used library version (%s) is lacking this feature","reason":"The configuration uses name-based virtual hosting for SSL but the OpenSSL library doesn't support SNI.","resolution":"Upgrade to an OpenSSL version that supports SNI (0.9.8f or later), or use IP-based virtual hosting for SSL sites."},{"function":"ssl_init_FindCAList","message_template":"Failed to load SSLCACertificateFile: %s","reason":"Could not load the specified CA certificate file for client authentication.","resolution":"Verify the file exists, has correct permissions, and contains PEM-formatted CA certificates."},{"function":"ssl_init_FindCAList","message_template":"Failed to open Certificate Path `%s'","reason":"Could not open the specified directory containing CA certificates.","resolution":"Verify the directory exists and has correct permissions for the Apache process."},{"function":"ssl_log_ssl_error","message_template":"OpenSSL internal error messages","reason":"Logs detailed OpenSSL error messages from the error queue to help diagnose SSL issues.","resolution":"Address the specific OpenSSL errors reported in the log message. The resolution depends on the particular error."},{"function":"ssl_add_version_components","message_template":"%s compiled against Server: %s, Library: %s","reason":"Reports the mod_ssl version and the versions of Apache and OpenSSL it was compiled against.","resolution":"Informational log, no resolution required."}],"project":"apache\/httpd"}