{"module":"ssl_engine_log.c","summary":"This module provides logging facilities for Apache's mod_ssl, handling SSL library errors, adding user-friendly annotations to common SSL errors, and formatting certificate details for inclusion in log messages.","logs":[{"function":"ssl_die","message_template":"Fatal error initialising mod_ssl, exiting. See %s for more information","reason":"A fatal error occurred during the initialization of mod_ssl that prevents Apache from starting. The error log file contains more details.","resolution":"Check the error log file specified in the message for specific error details. Usually requires fixing SSL configuration issues such as incorrect certificate paths, invalid certificate formats, or permission problems."},{"function":"ssl_die","message_template":"Fatal error initialising mod_ssl, exiting.","reason":"A fatal error occurred during mod_ssl initialization, but no specific error log was available.","resolution":"Check the main server error log for more details. Look for SSL configuration issues, especially incorrect paths to certificates, keys, or CA files."},{"function":"ssl_log_ssl_error","message_template":"SSL Library Error: %s%s%s%s%s%s","reason":"OpenSSL reported an error during SSL operation, which includes the error details, associated data, and a user-friendly annotation.","resolution":"Resolution depends on the specific error, but the annotation provides guidance. Check SSL configuration, especially certificate files, private keys, and cipher specifications."},{"function":"ssl_log_annotation","message_template":"wrong pass phrase!?","reason":"The system could not decrypt an envelope (likely a private key) because the provided passphrase was incorrect.","resolution":"Provide the correct passphrase for the private key. This may involve updating the passphrase in server configuration or responding correctly to the passphrase prompt during server startup."},{"function":"ssl_log_annotation","message_template":"speaking not SSL to HTTPS port!?","reason":"A client connected to the HTTPS port but didn't send SSL\/TLS traffic. This happens when clients try to use HTTP on an HTTPS port.","resolution":"Client needs to use HTTPS instead of HTTP or connect to the correct port. Server-side, ensure clients are properly redirected from HTTP to HTTPS if needed."},{"function":"ssl_log_annotation","message_template":"speaking HTTP to HTTPS port!?","reason":"A client sent plain HTTP requests to an HTTPS port instead of initiating an SSL\/TLS handshake.","resolution":"Configure the client to use HTTPS protocol. On the server side, consider implementing redirects from HTTP to HTTPS to guide users properly."},{"function":"ssl_log_annotation","message_template":"Subject CN in certificate not server name or identical to CA!?","reason":"The server rejected a client certificate because its Common Name (CN) doesn't match the expected server name or CA.","resolution":"Update the client certificate to include the correct server name in the Subject CN, or configure the server to accept the current certificate if appropriate."},{"function":"ssl_log_annotation","message_template":"Client certificate signed by CA not known to server?","reason":"The client presented a certificate signed by a CA that the server doesn't recognize or trust.","resolution":"Install the appropriate CA certificate in the server's trusted CA store. Update SSLCACertificateFile or SSLCACertificatePath directives to include the required CA certificates."},{"function":"ssl_log_annotation","message_template":"No CAs known to server for verification?","reason":"The server requires client certificates but has no configured CAs to verify them.","resolution":"Configure the server with appropriate CA certificates using SSLCACertificateFile or SSLCACertificatePath. Otherwise, if client verification isn't required, adjust the SSLVerifyClient directive."},{"function":"ssl_log_annotation","message_template":"Too restrictive SSLCipherSuite or using DSA server certificate?","reason":"The SSL handshake failed because the client and server couldn't agree on a cipher to use, either due to restrictive cipher settings or certificate type issues.","resolution":"Broaden the SSLCipherSuite directive to include more ciphers or update to an RSA certificate if using DSA. Check compatibility between server cipher configuration and client capabilities."},{"function":"ssl_log_annotation","message_template":"Bad file contents or format - or even just a forgotten SSLCertificateKeyFile?","reason":"OpenSSL couldn't find the expected start line in a certificate or key file, suggesting format issues or missing files.","resolution":"Verify all certificate and key files exist, have the correct format (PEM or specified format), and are readable by the server. Ensure SSLCertificateKeyFile is correctly specified in the configuration."},{"function":"ssl_log_annotation","message_template":"You entered an incorrect pass phrase!?","reason":"The system explicitly detected an incorrect password while reading a protected key or certificate file.","resolution":"Enter the correct passphrase when prompted, or ensure the correct passphrase is provided in any automated startup scripts or configuration."},{"function":"ssl_log_annotation","message_template":"Browser still remembered details of a re-created server certificate?","reason":"A MAC (Message Authentication Code) decoding error occurred, possibly because the client has cached details of a server certificate that has been replaced.","resolution":"Clear the browser's cache and SSL state, or restart the browser. On the server side, when replacing certificates, considering implementing proper certificate rotation practices."},{"function":"ssl_log_cert_error","message_template":" [subject: %s]","reason":"Provides information about the subject Distinguished Name from the certificate involved in an error.","resolution":"Informational component of a larger error message. The resolution depends on the specific error being reported along with this certificate information."},{"function":"ssl_log_cert_error","message_template":" [certificate: -not available-]","reason":"A certificate-related error occurred, but the certificate itself wasn't available for logging detailed information.","resolution":"Troubleshoot why the certificate is not available. Check that certificate files exist and are readable, and that the SSL\/TLS connection is properly established before certificate operations."}],"project":"apache\/httpd"}