{"module":"ssl_ct_log_config.c","summary":"This module manages Certificate Transparency (CT) log configurations for Apache's SSL\/TLS implementation. It handles reading CT log data from SQLite databases, validating log URLs, managing public keys, and determining log validity for Signed Certificate Timestamps (SCTs).","logs":[{"function":"log_config_readable","message_template":"SQLite3 driver cannot be loaded","reason":"The system could not load the SQLite3 database driver required to read the CT log configuration database. This prevents access to the CT log configuration.","resolution":"Ensure the SQLite3 driver is properly installed and available to Apache. Check that the APR-util was compiled with SQLite3 support."},{"function":"read_public_key","message_template":"could not open log public key file %s","reason":"The system failed to open the specified public key file. This key is needed to verify SCTs from the corresponding log.","resolution":"Check that the specified public key file exists and has appropriate permissions for the web server to read it."},{"function":"read_public_key","message_template":"PEM_read_PUBKEY() failed to process public key file %s","reason":"The system could not parse or interpret the public key file, possibly due to an invalid format or corrupted file.","resolution":"Verify that the public key file is a valid PEM-encoded public key. Try re-downloading or regenerating the key file."},{"function":"parse_log_url","message_template":"Error in log url \"%s\": URL can't be parsed or is missing required elements","reason":"The CT log URL is invalid, malformed, or missing required components like scheme, hostname, or path.","resolution":"Correct the log URL configuration. Ensure it includes a valid scheme (http), hostname, and path."},{"function":"parse_log_url","message_template":"Error in log url \"%s\": Only scheme \"http\" (instead of \"%s\") is currently accepted","reason":"The CT log URL uses a scheme other than HTTP, which is not supported by this implementation.","resolution":"Change the log URL to use the HTTP scheme. This module currently only supports HTTP for communicating with CT logs."},{"function":"parse_log_url","message_template":"Error in log url \"%s\": Only path \"\/\" (instead of \"%s\") is currently accepted","reason":"The CT log URL contains a path other than the root path (\/), which is not supported by this implementation.","resolution":"Modify the log URL to use the root path \"\/\". This module currently only supports the root path for CT log endpoints."},{"function":"save_log_config_entry","message_template":"Trusted status \"%s\" not valid","reason":"The trusted status for a CT log is invalid. Valid values are \"0\" (trusted) or \"1\" (distrusted).","resolution":"Correct the trusted status in the CT log configuration to either \"0\" or \"1\"."},{"function":"save_log_config_entry","message_template":"Log id \"%s\" not valid","reason":"The log ID has an invalid format. Log IDs must be 32 bytes in hex-encoded format.","resolution":"Correct the log ID format. Log IDs should be 64 hex characters representing a 32-byte value, typically a SHA-256 hash of the log's public key."},{"function":"save_log_config_entry","message_template":"Invalid min time \"%s\"","reason":"The minimum valid time specified for the CT log has an invalid format. It should be a number representing milliseconds since epoch.","resolution":"Correct the minimum time value to be a valid integer representing milliseconds since epoch."},{"function":"save_log_config_entry","message_template":"Invalid max time \"%s\"","reason":"The maximum valid time specified for the CT log has an invalid format. It should be a number representing milliseconds since epoch.","resolution":"Correct the maximum time value to be a valid integer representing milliseconds since epoch."},{"function":"save_log_config_entry","message_template":"Provided log id doesn't match digest of public key","reason":"The specified log ID doesn't match the SHA-256 hash of the log's public key, suggesting a configuration error or mismatch.","resolution":"Either correct the log ID to match the public key's hash, or update the public key file to match the specified log ID. Ensure you're using the correct public key for the given log."},{"function":"read_config_db","message_template":"APR SQLite3 driver can't be loaded","reason":"The system failed to load the APR SQLite3 database driver, which is required to read the CT log configuration.","resolution":"Ensure the APR SQLite3 driver is properly installed and configured. Check that APR-util was compiled with SQLite3 support."},{"function":"read_config_db","message_template":"Can't open SQLite3 db %s","reason":"The system could not open the specified SQLite3 database file containing CT log configurations.","resolution":"Verify that the database file exists, has correct permissions, and is not corrupted. Check the path in the configuration."},{"function":"read_config_db","message_template":"SELECT of loginfo records failed","reason":"The database query to retrieve CT log information from the database failed.","resolution":"Check that the database schema is correct and includes a 'loginfo' table with the expected columns. Ensure the database is not corrupted."},{"function":"read_config_db","message_template":"Unexpected asynchronous result reading %s","reason":"The database returned an unexpected asynchronous result when trying to read CT log configuration.","resolution":"This is likely a SQLite3 driver issue or database corruption problem. Try rebuilding the database or checking for concurrent access issues."},{"function":"read_config_db","message_template":"Log configuration in %s is empty","reason":"The CT log configuration database exists but contains no log entries. This might be intentional or a configuration error.","resolution":"If you intended to use Certificate Transparency, add log entries to the configuration database. If CT is not needed, this warning can be ignored."},{"function":"read_config_db","message_template":"Log config: Record %s, log id %s, public key file %s, distrusted %s, URL %s, time %s->%s","reason":"This is a debug-level log message showing the details of a CT log configuration entry that was successfully loaded.","resolution":"This is an informational message that requires no action. It can be used to verify that the correct CT log configurations were loaded."}],"project":"apache\/httpd"}