{"module":"ssl_engine_ocsp.c","summary":"This module implements OCSP (Online Certificate Status Protocol) validation for SSL\/TLS certificates in Apache HTTP Server. It extracts OCSP responder URIs from certificates, creates and sends OCSP requests, verifies responses, and determines certificate revocation status.","logs":[{"function":"determine_responder_uri","message_template":"no OCSP responder specified in certificate and no default configured","reason":"Unable to determine an OCSP responder because the certificate does not specify one and no default responder is configured. Likely due to misconfiguration or a certificate without OCSP capabilities.","resolution":"Configure a default OCSP responder in the Apache configuration or obtain certificates that include OCSP responder information."},{"function":"determine_responder_uri","message_template":"failed to parse OCSP responder URI '%s'","reason":"The OCSP responder URI found in the certificate or configuration is malformed and cannot be parsed correctly. This could be due to a corrupted certificate or misconfigured server.","resolution":"Check the responder URI in the SSLOCSPDefaultResponder directive if one is specified. If the URI comes from the certificate, the certificate may need to be reissued."},{"function":"determine_responder_uri","message_template":"cannot handle OCSP responder URI '%s'","reason":"The OCSP responder URI uses a scheme other than HTTP, which is not supported. Apache's OCSP implementation only supports HTTP responders.","resolution":"Configure an HTTP-based OCSP responder or update the certificate to specify an HTTP responder URI."},{"function":"create_request","message_template":"could not retrieve certificate id","reason":"Failed to generate a certificate ID needed for OCSP verification. This could be due to cryptographic library failures or issues with the certificate chain.","resolution":"Check the certificate chain integrity. Ensure that you have the full chain including the issuer certificate. May require updating OpenSSL libraries."},{"function":"verify_ocsp_status","message_template":"Skipping OCSP check for certificate cos no OCSP URL found and no_ocsp_for_cert_ok is set","reason":"No OCSP responder URL found for the certificate, but the configuration allows certificates without OCSP information to pass validation.","resolution":"Informational log only. If stricter validation is required, disable the SSLOCSPNoOCSPForCertOk directive."},{"function":"verify_ocsp_status","message_template":"OCSP response not successful: %d","reason":"The OCSP responder returned a response with a non-successful status code. This may indicate a problem with the OCSP responder service.","resolution":"Check if the OCSP responder service is operational. The error code can provide more specific details about the failure. May require contacting the certificate authority."},{"function":"verify_ocsp_status","message_template":"could not retrieve OCSP basic response","reason":"Failed to extract the basic response from the OCSP response. This suggests a malformed or corrupted response from the OCSP responder.","resolution":"Check if the OCSP responder is functioning correctly. May be a temporary network issue or a problem with the responder. Retry the connection or contact the certificate authority."},{"function":"verify_ocsp_status","message_template":"Bad OCSP responder answer (bad nonce)","reason":"The nonce in the OCSP response does not match the one sent in the request. This could indicate a replay attack or a caching issue with the responder.","resolution":"This is a security issue. Check if the OCSP responder supports nonces. If it doesn't, consider disabling nonce validation with SSLOCSPUseRequestNonce Off."},{"function":"verify_ocsp_status","message_template":"failed to verify the OCSP response","reason":"The OCSP response signature verification failed. This could mean the response is forged or the responder's certificate is not trusted.","resolution":"Ensure the OCSP responder's certificate is trusted. Add responder certificates to the SSLOCSPResponderCertificateFile or consider enabling SSLOCSPNoVerify if in a trusted environment."},{"function":"verify_ocsp_status","message_template":"failed to retrieve OCSP response status","reason":"Could not extract the status of the certificate from the OCSP response. The response may be incomplete or not containing information about the requested certificate.","resolution":"Check if the OCSP responder is configured correctly for the certificate chain. May require contacting the certificate authority for support."},{"function":"verify_ocsp_status","message_template":"OCSP response outside validity period","reason":"The OCSP response is either too old or has a validity period that doesn't match the current time. This could be due to clock skew or an expired response.","resolution":"Check the time synchronization on the server. Adjust SSLOCSPTimeSkew and SSLOCSPMaxAge directives if needed to accommodate responder behavior."},{"function":"verify_ocsp_status","message_template":"OCSP validation completed, certificate status: %s (%d, %d)","reason":"OCSP validation has completed with the reported status for the certificate (good, revoked, or unknown). This is an informational message showing the result of validation.","resolution":"If status is 'revoked', the certificate should not be trusted. If 'unknown', additional verification methods may be needed. If 'good', no action is required."},{"function":"modssl_verify_ocsp","message_template":"No cert available to check with OCSP","reason":"The function was called to verify a certificate with OCSP, but no certificate was available in the verification context. This is a rare condition that can occur with certain OpenSSL versions.","resolution":"This is usually an internal state that shouldn't affect normal operation. If persistent, check OpenSSL version compatibility or server configuration."},{"function":"modssl_verify_ocsp","message_template":"Skipping OCSP check for valid self-issued cert","reason":"OCSP verification is skipped for a self-issued (self-signed) certificate. Self-issued certificates are not typically validated via OCSP.","resolution":"Informational log only. Self-signed certificates should not be used in production environments for public-facing services."}],"project":"apache\/httpd"}