{"module":"ajp.h","summary":"Header file defining the Apache JServ Protocol (AJP) interface for communication between Apache web server and backend servlet containers like Tomcat. It provides constants, structures, and function declarations for handling AJP messages, including error conditions and protocol operations.","logs":[{"function":"ajp_msg_check_header","message_template":"Buffer overflow exception (AJP_EOVERFLOW)","reason":"The AJP message buffer has overflowed its boundaries during header checking. This typically occurs when processing malformed AJP packets.","resolution":"Check for misconfigured backend servers or potential security attacks. Ensure the AJP packet size configuration matches between Apache and the backend server."},{"function":"ajp_msg_check_header","message_template":"Bad message signature (AJP_EBAD_SIGNATURE)","reason":"The AJP message contains an invalid signature value (not 0x1234) indicating a protocol violation or corrupted data.","resolution":"Verify the backend server is properly implementing the AJP protocol. Check for network issues or proxy misconfiguration that might corrupt data."},{"function":"ajp_msg_append_string_ex","message_template":"Destination Buffer is too small (AJP_ETOSMALL)","reason":"Attempt to append a string to an AJP message but the destination buffer is too small to hold it.","resolution":"Increase the AJP buffer size configuration or ensure that message construction doesn't exceed the maximum allowed size (typically 8K or 64K depending on configuration)."},{"function":"ajp_ilink_receive","message_template":"Incoming message too big (AJP_ETOBIG)","reason":"Received an AJP message that exceeds the maximum allowed size, possibly indicating a misconfigured backend or an attack.","resolution":"Check backend server configuration. If legitimate large responses are expected, increase buffer sizes in proxy configuration. Otherwise, investigate for potential security issues."},{"function":"ajp_parse_header","message_template":"Missing message header (AJP_ENO_HEADER)","reason":"An AJP message was received without the required header, indicating protocol violation or data corruption.","resolution":"Verify backend server AJP implementation. Check for network issues or firewalls that might be affecting traffic integrity."},{"function":"ajp_parse_header","message_template":"Bad message header (AJP_EBAD_HEADER)","reason":"An AJP message contained a malformed header that couldn't be properly parsed.","resolution":"This may indicate incompatible protocol versions or a corrupted message. Check backend server configuration and network quality between servers."},{"function":"ajp_msg_log","message_template":"AJP Error: [error message]","reason":"Generic function used to log information about AJP messages with custom error text. The specific error depends on the caller.","resolution":"Examine the specific error message for details. This is a general logging mechanism for any AJP-related issues."},{"function":"ajp_handle_cping_cpong","message_template":"Can't log via AJP14 (AJP_ELOGFAIL)","reason":"Failed to perform logging operations during CPING\/CPONG (health check) communications.","resolution":"This may indicate backend server connectivity issues. Check that the backend server is responding correctly to health checks and verify network connectivity."},{"function":"ajp_send_header","message_template":"Invalid input parameters (AJP_EINVAL)","reason":"Invalid parameters were provided when attempting to send an AJP header, such as NULL values or invalid URI.","resolution":"This is likely a programming error in the module using this API. Check the configuration and make sure all required parameters are provided correctly."},{"function":"ajp_parse_type","message_template":"Bad message (AJP_EBAD_MESSAGE)","reason":"Received an AJP message that doesn't conform to the protocol structure or contains invalid data.","resolution":"Verify backend server compatibility. This may indicate different protocol versions or a backend server that's not properly implementing the AJP protocol."},{"function":"ajp_read_header","message_template":"Using default host: 127.0.0.1","reason":"The system is using the default AJP host (127.0.0.1) because no specific host was configured.","resolution":"If connecting to a remote backend server, explicitly configure the correct host address in your AJP configuration."},{"function":"ajp_send_header","message_template":"SSL Environment: HTTPS=ON","reason":"The request is being processed over HTTPS, and this information is being passed to the backend server via AJP.","resolution":"Informational only. No action required unless SSL information is not being correctly passed to backend applications."},{"function":"ajp_send_header","message_template":"SSL_PROTOCOL information","reason":"Information about the SSL protocol version used for the current request is being passed to the backend.","resolution":"Informational only. Useful for debugging SSL-related issues between proxy and backend servers."},{"function":"ajp_send_header","message_template":"SSL_CLIENT_CERT information","reason":"Client certificate information from an SSL connection is being passed to the backend server.","resolution":"Informational only. If client certificates are required but not being received by the backend application, check both Apache and backend server SSL configuration."},{"function":"ajp_send_header","message_template":"SSL_CIPHER information","reason":"Information about the SSL cipher being used is passed to the backend server.","resolution":"Informational only. Useful for security auditing and ensuring strong cipher usage across the connection chain."},{"function":"ajp_send_header","message_template":"SSL_SESSION_ID information","reason":"SSL session identifier information is being passed to the backend server.","resolution":"Informational only. Useful for debugging session persistence issues in SSL connections."},{"function":"ajp_send_header","message_template":"SSL_CIPHER_USEKEYSIZE information","reason":"Information about the SSL cipher key size is being passed to the backend server.","resolution":"Informational only. Useful for security compliance to ensure adequate encryption strength is being used."}],"project":"apache\/httpd"}