{"module":"ajp_header.c","summary":"This module implements the AJP (Apache JServ Protocol) protocol handling for Apache's mod_proxy_ajp. It provides functions for marshaling HTTP requests into AJP format, unmarshaling AJP responses back to HTTP, and handling protocol-specific details for communication with AJP backends like Tomcat.","logs":[{"function":"ajp_marshal_into_msgb","message_template":"Into ajp_marshal_into_msgb","reason":"Trace log indicating the start of marshaling an HTTP request into an AJP message","resolution":"Informational log, no resolution required"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb - Sending unknown method %s as request attribute","reason":"The HTTP method in the request is not one of the methods directly supported by the AJP protocol, so it will be sent as a request attribute instead","resolution":"Informational log, no resolution required unless an uncommon HTTP method is causing issues with the backend"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending the message beginning","reason":"Failed to write the initial data of the AJP message, likely due to buffer overflow","resolution":"May indicate a configuration issue with buffer sizes or a very large request. Check ProxyIOBufferSize directive and increase it if necessary"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending the header name","reason":"Failed to add a header name to the AJP message, likely due to buffer overflow","resolution":"May indicate a very long or malformed header. Check ProxyIOBufferSize directive and increase it if necessary. Also check for malicious requests with extremely long headers"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending the header value","reason":"Failed to add a header value to the AJP message, likely due to buffer overflow","resolution":"May indicate a very long header value. Check ProxyIOBufferSize directive and increase it if necessary. Also check for malicious requests with extremely long header values"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Header[%d] [%s] = [%s]","reason":"Trace log showing the successful marshaling of an HTTP header into the AJP message","resolution":"Informational log, no resolution required"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending secret","reason":"Failed to add the AJP secret to the message, likely due to buffer overflow or memory issue","resolution":"Check the 'secret' parameter in your AJP configuration. If it's very long, consider using a shorter one. Also verify ProxyIOBufferSize is sufficient"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending the remote user","reason":"Failed to add the authenticated user information to the AJP message","resolution":"Check if authentication is generating extremely long usernames, or if there are other issues with the authentication system"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending the auth type","reason":"Failed to add the authentication type to the AJP message","resolution":"Check your authentication configuration for issues, especially if using custom authentication modules or methods"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending the query string","reason":"Failed to add the query string to the AJP message, likely due to a very long query string","resolution":"Check if requests contain extremely long query strings. You might need to increase ProxyIOBufferSize or limit the allowed query string length"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending the jvm route","reason":"Failed to add the JVM route information to the AJP message","resolution":"Check your load balancer configuration, especially if using mod_jk or mod_proxy_balancer with sticky sessions. The route identifier might be too long"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending the SSL certificates","reason":"Failed to add the SSL client certificate information to the AJP message, likely due to a very large certificate or chain","resolution":"Check client SSL certificates - if they're very large or have a long chain, consider adjusting ProxyIOBufferSize or limiting the certificate size\/depth"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending the SSL ciphers","reason":"Failed to add the SSL cipher information to the AJP message","resolution":"Check your SSL configuration. If using many or unusual ciphers, this might cause buffer issues. Check ProxyIOBufferSize if this occurs regularly"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending the SSL session","reason":"Failed to add the SSL session information to the AJP message","resolution":"Verify your SSL configuration, particularly session parameters. If session IDs are very long or non-standard, this could cause issues"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending the SSL key size","reason":"Failed to add the SSL key size information to the AJP message","resolution":"Check your SSL configuration. This is usually a small piece of data, so the error might indicate memory corruption or other severe issues in the AJP module"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending the method '%s' as request attribute","reason":"Failed to add the HTTP method as a request attribute when using non-standard methods","resolution":"If you're using unusual or custom HTTP methods, ensure they're not excessively long and that your backend supports them"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending attribute %s=%s","reason":"Failed to add a request attribute to the AJP message","resolution":"Check custom attributes being passed to the AJP backend. If they're very large or numerous, increase the ProxyIOBufferSize or reduce the number of attributes"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Error appending the message end","reason":"Failed to append the message terminator to the AJP message","resolution":"This usually indicates that the buffer is completely full. Increase ProxyIOBufferSize to accommodate larger requests"},{"function":"ajp_marshal_into_msgb","message_template":"ajp_marshal_into_msgb: Done","reason":"Trace log indicating successful completion of marshaling the HTTP request into an AJP message","resolution":"Informational log, no resolution required"},{"function":"ajp_unmarshal_response","message_template":"ajp_unmarshal_response: Null status","reason":"Failed to extract the HTTP status code from the AJP response","resolution":"This indicates a malformed response from the AJP backend. Check the backend server logs for errors, and verify the backend is AJP-compliant"},{"function":"ajp_unmarshal_response","message_template":"ajp_unmarshal_response: status = %d","reason":"Trace log showing the HTTP status code received from the AJP backend","resolution":"Informational log, no resolution required unless the status indicates an error"},{"function":"ajp_unmarshal_response","message_template":"ajp_unmarshal_response: Bad number of headers","reason":"The AJP response contains an invalid number of headers","resolution":"Check the backend server for compliance with the AJP protocol. This might indicate a bug in the backend server or a protocol version mismatch"},{"function":"ajp_unmarshal_response","message_template":"ajp_unmarshal_response: Number of headers is = %d","reason":"Trace log showing the number of headers in the AJP response","resolution":"Informational log, no resolution required"},{"function":"ajp_unmarshal_response","message_template":"ajp_unmarshal_response: No such sc (%08x)","reason":"The AJP response contains an unknown header code","resolution":"This might indicate a protocol version mismatch or a backend server that doesn't fully comply with the AJP protocol. Check your backend server configuration"},{"function":"ajp_unmarshal_response","message_template":"ajp_unmarshal_response: Null header name","reason":"The AJP response contains a header with no name","resolution":"This indicates a protocol error from the backend. Verify the backend server is functioning correctly and properly implements the AJP protocol"},{"function":"ajp_unmarshal_response","message_template":"ajp_unmarshal_response: Null header value","reason":"The AJP response contains a header with no value","resolution":"This indicates a protocol error from the backend. Check the backend server logs and configuration"},{"function":"ajp_unmarshal_response","message_template":"ajp_unmarshal_response: Header[%d] [%s] = [%s]","reason":"Trace log showing a header received from the AJP backend","resolution":"Informational log, no resolution required"},{"function":"ajp_unmarshal_response","message_template":"ajp_unmarshal_response: ap_set_content_type to '%s'","reason":"Trace log showing the Content-Type header being processed from the AJP response","resolution":"Informational log, no resolution required"},{"function":"ajp_send_header","message_template":"ajp_send_header: ajp_msg_create failed","reason":"Failed to create an AJP message for sending headers to the backend","resolution":"This likely indicates a memory allocation failure. Check system resources and consider increasing available memory"},{"function":"ajp_send_header","message_template":"ajp_send_header: ajp_marshal_into_msgb failed","reason":"Failed to marshal the HTTP headers into the AJP message","resolution":"Check earlier logs for specific marshaling errors, which usually indicate buffer size issues or malformed input"},{"function":"ajp_send_header","message_template":"ajp_send_header: ajp_ilink_send failed","reason":"Failed to send the AJP message to the backend server","resolution":"This indicates a network error. Check network connectivity to the backend server, and verify the backend is running and accepting connections"},{"function":"ajp_read_header","message_template":"ajp_read_header: ajp_msg_reuse failed","reason":"Failed to reuse an existing AJP message buffer","resolution":"This might indicate memory corruption or a threading issue. Check for other errors and consider restarting the server"},{"function":"ajp_read_header","message_template":"ajp_read_header: ajp_msg_create failed","reason":"Failed to create a new AJP message buffer for reading the response","resolution":"This likely indicates a memory allocation failure. Check system resources and consider increasing available memory"},{"function":"ajp_read_header","message_template":"ajp_read_header: ajp_ilink_receive failed","reason":"Failed to receive an AJP message from the backend server","resolution":"This indicates a network error or a closed connection. Check if the backend server is running and responding properly"},{"function":"ajp_read_header","message_template":"ajp_read_header: ajp_msg_peek_uint8 failed","reason":"Failed to read the message type from the AJP response","resolution":"This indicates a malformed response or protocol error. Check the backend server for compliance with the AJP protocol"},{"function":"ajp_read_header","message_template":"ajp_read_header: ajp_ilink_received %s (0x%02x)","reason":"Trace log showing the type of AJP message received from the backend","resolution":"Informational log, no resolution required"},{"function":"ajp_parse_type","message_template":"ajp_parse_type: got %s (0x%02x)","reason":"Trace log showing the type of AJP message being parsed","resolution":"Informational log, no resolution required"},{"function":"ajp_parse_header","message_template":"ajp_parse_headers: ajp_msg_get_byte failed","reason":"Failed to read a byte from the AJP message during header parsing","resolution":"This indicates a malformed message or buffer underrun. Check the backend server for compliance with the AJP protocol"},{"function":"ajp_parse_header","message_template":"ajp_parse_headers: wrong type %s (0x%02x) expecting %s (0x%02x)","reason":"Received an unexpected message type when expecting headers","resolution":"This indicates a protocol error or message sequencing issue. Check the backend server for compliance with the AJP protocol and possible configuration mismatches"},{"function":"ajp_parse_data","message_template":"ajp_parse_data: ajp_msg_get_byte failed","reason":"Failed to read a byte from the AJP message during data parsing","resolution":"This indicates a malformed message or buffer underrun. Check the backend server for compliance with the AJP protocol"},{"function":"ajp_parse_data","message_template":"ajp_parse_data: wrong type %s (0x%02x) expecting %s (0x%02x)","reason":"Received an unexpected message type when expecting data","resolution":"This indicates a protocol error or message sequencing issue. Check the backend server for compliance with the AJP protocol and possible configuration mismatches"},{"function":"ajp_parse_data","message_template":"ajp_parse_data: Wrong chunk length. Length of chunk is %i, expected length is %i.","reason":"The length of the data chunk in the AJP message doesn't match what was expected","resolution":"This indicates a protocol error or data corruption. Check the backend server for compliance with the AJP protocol and possible network issues"},{"function":"ajp_parse_reuse","message_template":"ajp_parse_reuse: ajp_msg_get_byte failed","reason":"Failed to read a byte from the AJP message when checking connection reuse flag","resolution":"This indicates a malformed message or buffer underrun. Check the backend server for compliance with the AJP protocol"},{"function":"ajp_parse_reuse","message_template":"ajp_parse_reuse: wrong type %s (0x%02x) expecting %s (0x%02x)","reason":"Received an unexpected message type when expecting end response message","resolution":"This indicates a protocol error or message sequencing issue. Check the backend server for compliance with the AJP protocol and possible configuration mismatches"}],"project":"apache\/httpd"}