{"module":"mod_proxy_fdpass.c","summary":"This Apache module enables file descriptor passing via Unix domain sockets. It allows the Apache server to pass a connected socket to another process, facilitating efficient socket handoff for specialized handling.","logs":[{"function":"proxy_fdpass_canon","message_template":"set r->filename to %s","reason":"Debug log showing the filename being set for the proxy request. This helps in troubleshooting the URL translation process.","resolution":"This is an informational log at debug level, no resolution required."},{"function":"proxy_fdpass_handler","message_template":"Failed to connect to '%s'","reason":"Error log when the module fails to connect to the specified Unix domain socket. Likely due to the socket path being incorrect or the socket not being available.","resolution":"Verify that the Unix domain socket path exists and has correct permissions. Check if the target service is running and listening on the specified socket."},{"function":"proxy_fdpass_handler","message_template":"Unable to find configured flush provider '%s'","reason":"Error log when the specified flush method provider is not available. This happens when a custom flusher is configured but not registered.","resolution":"Check the worker configuration for the flusher setting. Either correct the name to match an available provider or ensure the custom provider is properly registered."},{"function":"proxy_fdpass_handler","message_template":"send_socket failed:","reason":"Error log when the module fails to pass the file descriptor to the target socket. Likely due to permissions issues or socket communication errors.","resolution":"Check system resource limits, socket permissions, and ensure the target process is correctly handling socket descriptor passing. May require increasing system limits for file descriptors."},{"function":"proxy_fdpass_handler","message_template":"failed to create dummy socket","reason":"Error log when the module fails to create a replacement dummy socket. This is needed to prevent the core from closing the client connection.","resolution":"Check system resources and limits. The server might be running out of available file descriptors or memory. Consider increasing system limits or reducing server load."},{"function":"standard_flush","message_template":"ap_pass_brigade failed:","reason":"Error log when the module fails to pass the brigade through the output filters. This happens when trying to flush the connection before handing it off.","resolution":"Investigate filter chain issues, check for conflicting modules, or examine client connection problems. May indicate connection was prematurely closed by the client or another module is interfering with the output filters."}],"project":"apache\/httpd"}