{"module":"mod_proxy_fcgi.c","summary":"Apache module that provides FastCGI support for the mod_proxy module, enabling Apache to communicate with FastCGI backend servers. It manages URL canonicalization, environment setup, request handling, and response processing between Apache and FastCGI applications.","logs":[{"function":"proxy_fcgi_canon","message_template":"canonicalising URL %s","reason":"Debug message generated when the module is processing a URL to prepare it for forwarding to the FastCGI server","resolution":"Informational log, no resolution required"},{"function":"proxy_fcgi_canon","message_template":"error parsing URL %s: %s","reason":"Error message when the URL format is invalid or cannot be parsed correctly","resolution":"Check the URL format and ensure it follows the expected pattern for FastCGI proxying. This typically indicates a configuration issue or a malformed request."},{"function":"proxy_fcgi_canon","message_template":"To be forwarded path contains control characters%s (%s)","reason":"Error message when the path contains invalid control characters or a question mark (when using FPM backend)","resolution":"Check the request URL for invalid characters. When using PHP-FPM, question marks are not allowed in the URL path. URLs should be properly encoded before reaching the proxy module."},{"function":"proxy_fcgi_canon","message_template":"set r->filename to %s","reason":"Debug message showing what filename is being set for the request","resolution":"Informational log, no resolution required"},{"function":"proxy_fcgi_canon","message_template":"set r->path_info to %s","reason":"Debug message showing what path_info is being set for the request","resolution":"Informational log, no resolution required"},{"function":"fix_cgivars","message_template":"fix_cgivars: Condition eval returned %d: %s","reason":"Error message when a condition expression in ProxyFCGISetEnvIf could not be evaluated properly","resolution":"Check the syntax of your ProxyFCGISetEnvIf directive conditions. The expression may contain syntax errors or refer to variables that don't exist."},{"function":"fix_cgivars","message_template":"Error evaluating expression for replacement of %s: '%s'","reason":"Error message when an expression for variable replacement in ProxyFCGISetEnvIf could not be evaluated","resolution":"Check the syntax of your ProxyFCGISetEnvIf directive value expressions. Ensure the replacement expression is valid and properly formatted."},{"function":"fix_cgivars","message_template":"fix_cgivars: override %s from '%s' to '%s'","reason":"Trace message showing that an environment variable is being changed","resolution":"Informational log, no resolution required"},{"function":"send_environment","message_template":"sending env var '%s' value '%s'","reason":"Trace message showing environment variables being sent to the FastCGI server","resolution":"Informational log, no resolution required"},{"function":"send_environment","message_template":"couldn't encode envvar '%s' in % bytes","reason":"Warning when an environment variable is too large to be encoded within buffer limits","resolution":"The environment variable value may be too large. Check for very large environment variables in your configuration. You may need to increase the buffer size or split large values across multiple variables."},{"function":"dispatch","message_template":"Failed to read FastCGI header","reason":"Error message when the module can't read the header from the FastCGI server's response","resolution":"This may indicate network issues, a crashed FastCGI process, or a misconfigured FastCGI server. Check that the FastCGI server is running properly, network connectivity is stable, and timeout settings are appropriate."},{"function":"dispatch","message_template":"Got bogus version %d","reason":"Error message when the FastCGI protocol version in the response is invalid","resolution":"This indicates a protocol incompatibility or corrupted data from the FastCGI server. Verify that the backend server is properly implementing the FastCGI protocol and is not sending corrupted data."},{"function":"dispatch","message_template":"Got bogus rid %d, expected %d","reason":"Error message when the request ID in the FastCGI response doesn't match the expected value","resolution":"This indicates a protocol error where responses don't match requests. Check that the FastCGI server is correctly handling request IDs and not mixing responses between requests."},{"function":"dispatch","message_template":"Error parsing script headers","reason":"Error message when the headers returned by the FastCGI application cannot be parsed correctly","resolution":"The FastCGI application is generating malformed HTTP headers. Check the FastCGI application code for header syntax issues. Common problems include invalid character encodings or missing line terminators."},{"function":"dispatch","message_template":"Got error '%.*s'","reason":"Error message showing stderr output from the FastCGI application","resolution":"This contains actual error messages from your FastCGI application. Fix the underlying application issue based on the specific error message shown."},{"function":"dispatch","message_template":"Got bogus record %d","reason":"Error message when receiving an unexpected record type from the FastCGI server","resolution":"The FastCGI server is sending record types that the proxy doesn't understand. This may indicate a buggy or non-compliant FastCGI implementation. Check the backend server configuration and ensure compatibility."},{"function":"dispatch","message_template":"Error occurred reading padding","reason":"Error message when unable to read the padding bytes in a FastCGI record","resolution":"This indicates network problems or premature connection termination. Check network stability and FastCGI server health. It may be related to timeouts if requests take too long to process."},{"function":"fcgi_do_request","message_template":"Failed Writing Request to %s:","reason":"Error message when the module cannot write the request to the FastCGI server","resolution":"Check that the FastCGI server is running and accepting connections. This could indicate network issues, server overload, or server crashes. Verify backend server health and connectivity."},{"function":"fcgi_do_request","message_template":"Failed writing Environment to %s:","reason":"Error message when the module cannot write environment variables to the FastCGI server","resolution":"Similar to request writing failures, check FastCGI server health, connectivity, and capacity. Large environment blocks may trigger this issue; consider reducing the number or size of environment variables."},{"function":"fcgi_do_request","message_template":"The client aborted the connection.","reason":"Trace message indicating the client disconnected during the request processing","resolution":"This is normally caused by the user canceling the request (e.g., stopping page load). No server-side resolution needed unless it happens very frequently, which could indicate slow processing issues."},{"function":"fcgi_do_request","message_template":"Error dispatching request to %s: %s%s%s","reason":"Error message when a general error occurs during request processing","resolution":"This is a general error that will include more specific details. Check the complete error message and address the underlying cause, which could be network issues, timeouts, protocol errors, or FastCGI application crashes."},{"function":"proxy_fcgi_handler","message_template":"url: %s proxyname: %s proxyport: %d","reason":"Debug message showing details of the proxy request being processed","resolution":"Informational log, no resolution required"},{"function":"proxy_fcgi_handler","message_template":"declining URL %s","reason":"Debug message indicating the module is not processing this URL because it doesn't start with 'fcgi:'","resolution":"Informational log, no resolution required"},{"function":"proxy_fcgi_handler","message_template":"serving URL %s","reason":"Debug message indicating the module is processing this URL","resolution":"Informational log, no resolution required"},{"function":"proxy_fcgi_handler","message_template":"failed to make connection to backend: %s","reason":"Error message when the module cannot connect to the FastCGI server","resolution":"Check that the FastCGI server is running and reachable. Verify network connectivity, firewall settings, and server configuration. The backend server might be down, overloaded, or misconfigured."},{"function":"cmd_servertype","message_template":"ProxyFCGIBackendType requires one of the following arguments: 'GENERIC', 'FPM'","reason":"Error message when an invalid backend type is specified in the configuration","resolution":"Correct your ProxyFCGIBackendType directive to use either 'GENERIC' or 'FPM' as the argument. This directive helps optimize the communication for specific FastCGI server types."},{"function":"cmd_setenv","message_template":"Could not parse expression \"%s\": %s","reason":"Error message when a ProxyFCGISetEnvIf expression cannot be parsed","resolution":"Check the syntax of your ProxyFCGISetEnvIf expression. The condition expression may contain syntax errors or use functions not available in Apache's expression evaluator."},{"function":"cmd_setenv","message_template":"Third argument (\"%s\") is not allowed when using ProxyFCGISetEnvIf's unset mode (%s)","reason":"Error message when trying to use a value with the unset mode of ProxyFCGISetEnvIf","resolution":"When using the unset mode (variable name prefixed with '!'), you cannot provide a value expression as the third argument. Remove the third argument from your ProxyFCGISetEnvIf directive."},{"function":"cmd_setenv","message_template":"ProxyFCGISetEnvIf: \"!\" is not a valid variable name","reason":"Error message when trying to use just '!' as a variable name in ProxyFCGISetEnvIf","resolution":"The '!' prefix is used to unset variables, but you must provide a variable name after it. Correct your configuration to specify a valid variable name after the '!', like '!PATH_INFO'."}],"project":"apache\/httpd"}