{"module":"proxy_express_module.c","summary":"This module enables dynamic hostname-to-backend URL mapping for Apache's reverse proxy using DBM files. It intercepts incoming requests, looks up the hostname in a DBM file, and if found, rewrites the request to the appropriate backend URL, effectively implementing a dynamic reverse proxy configuration.","logs":[{"function":"set_dbmfile","message_template":"ProxyExpressDBMFile: bad path to file: %s","reason":"Generated when the path to the DBM file is invalid or cannot be resolved relative to the server root. Likely occurs during server configuration parsing.","resolution":"Check the ProxyExpressDBMFile directive in your configuration and ensure the path exists and is accessible to the Apache process."},{"function":"xlate_name","message_template":"proxy_express: Enabled","reason":"Debug log indicating that the proxy_express module is enabled for the current request.","resolution":"Informational log, no resolution required."},{"function":"xlate_name","message_template":"proxy_express: Opening DBM file: %s (%s)","reason":"Debug log indicating an attempt to open the configured DBM file with the specified DBM type.","resolution":"Informational log, no resolution required."},{"function":"xlate_name","message_template":"The dbm library '%s' could not be loaded: %s (%s: %d)","reason":"Error log when the DBM driver specified in ProxyExpressDBMType cannot be loaded. Likely due to missing libraries or unsupported DBM type.","resolution":"Verify that the specified DBM type is supported and that the necessary libraries are installed. Check the error message for specific details on why the loading failed."},{"function":"xlate_name","message_template":"The '%s' file '%s' could not be loaded","reason":"Error log when the configured DBM file cannot be opened. May be due to file permissions, non-existent file, or incorrect format.","resolution":"Ensure the DBM file exists, has correct permissions, and is in the expected format for the configured DBM type. You may need to rebuild the DBM file."},{"function":"xlate_name","message_template":"proxy_express: looking for %s","reason":"Debug log showing that the module is searching for a hostname in the DBM file.","resolution":"Informational log, no resolution required."},{"function":"xlate_name","message_template":"proxy_express: found %s -> %s","reason":"Debug log indicating that a mapping was found in the DBM file for the requested hostname.","resolution":"Informational log, no resolution required."},{"function":"xlate_name","message_template":"proxy_express: rewritten as: %s","reason":"Debug log showing the rewritten URL after applying the proxy mapping.","resolution":"Informational log, no resolution required."},{"function":"xlate_name","message_template":"proxy_express: adding PPR entry","reason":"Debug log indicating that a ProxyPassReverse entry is being added for the backend URL.","resolution":"Informational log, no resolution required."}],"project":"apache\/httpd"}