{"module":"mod_serf.c","summary":"Apache module that implements a reverse proxy using the Serf HTTP client library. It supports clustering, failover, and different backend provider types including static servers and heartbeat-based dynamic backends.","logs":[{"function":"timed_cleanup_callback","message_template":"serf: request returned: %d","reason":"Logs when a request to a backend server fails with a non-OK status code. The status code is included in the message.","resolution":"Check the status code to determine the specific error. Verify connectivity to the backend server, check backend server logs, and ensure the requested resource exists and is accessible."},{"function":"closed_connection","message_template":"Closed Connection Error","reason":"Logs when a connection to a backend server unexpectedly closes or fails.","resolution":"Check network connectivity between Apache and backend servers. Verify backend server is running and not overloaded. Ensure firewalls or proxies aren't terminating connections prematurely."},{"function":"handle_response","message_template":"serf_bucket_response_status...","reason":"Logs when there's an error getting the status line from a Serf response bucket.","resolution":"This likely indicates an internal error in the Serf library or malformed response from backend. Check backend server is returning valid HTTP responses and consider updating Serf if the issue persists."},{"function":"handle_response","message_template":"serf_bucket_read(response)","reason":"Logs when there's an error reading data from a Serf response bucket.","resolution":"This may indicate network issues, premature connection termination, or memory problems. Check network connectivity, backend server health, and system resources."},{"function":"drive_serf","message_template":"SerfCluster: unable to find cluster %s","reason":"Logs when a requested cluster name isn't found in the configuration.","resolution":"Check your Apache configuration to ensure the SerfCluster directive is correctly defined with the specified cluster name. Verify spelling and ensure the configuration is being loaded."},{"function":"drive_serf","message_template":"SerfCluster: unable to find provider %s","reason":"Logs when a cluster is configured with a provider that isn't registered with the system.","resolution":"Ensure the provider name is spelled correctly and that the module implementing that provider is loaded. Built-in providers are 'static' and 'heartbeat'."},{"function":"drive_serf","message_template":"SerfCluster: %s is missing list servers provider.","reason":"Logs when a cluster provider doesn't implement the list_servers function, which is required for cluster functionality.","resolution":"Use a different cluster provider or update the current provider to implement the list_servers function. This might indicate an incompatible or incomplete provider module."},{"function":"drive_serf","message_template":"SerfCluster: %s list servers returned failure","reason":"Logs when a cluster provider's list_servers function returns an error code.","resolution":"Check the specific provider's logs for more details. Ensure the provider's configuration is correct and that any external services it depends on are available."},{"function":"drive_serf","message_template":"SerfCluster: %s failed to provide a list of servers","reason":"Logs when a cluster provider's list_servers function succeeds but returns an empty list of servers.","resolution":"Verify the provider configuration. For 'static' provider, check the 'hosts' parameter. For 'heartbeat', ensure the heartbeat file exists and contains valid entries."},{"function":"drive_serf","message_template":"Unable to resolve: %s","reason":"Logs when DNS resolution for a backend server hostname fails.","resolution":"Verify the hostname is correct and resolvable by the Apache server. Check DNS configuration, \/etc\/hosts file, or network connectivity to DNS servers."},{"function":"drive_serf","message_template":"mpm lied to us about supporting serf.","reason":"Logs when the MPM (Multi-Processing Module) reports support for Serf but doesn't provide the necessary implementation.","resolution":"This is an internal consistency error. Ensure you're using a compatible MPM and Apache version. Consider updating Apache or switching to a different MPM that properly supports Serf."},{"function":"drive_serf","message_template":"Unable to create temp request body buffer file.","reason":"Logs when the module fails to create a temporary file to buffer the request body.","resolution":"Check file system permissions and available disk space in the system's temporary directory. Ensure Apache has write permissions to the temp directory."},{"function":"drive_serf","message_template":"failed to read request body","reason":"Logs when there's an error reading the client's request body or writing it to the temporary file.","resolution":"This could indicate a client disconnection during upload or filesystem issues. Check client connectivity and server disk space\/permissions."},{"function":"drive_serf","message_template":"serf_context_run() for %pI","reason":"Logs when there's an error running the Serf context for a specific IP address.","resolution":"This is a general Serf error when communicating with a backend. Check network connectivity to the specified IP, backend server health, and Serf library status."},{"function":"add_pass","message_template":"SerfPass must have at least a URI.","reason":"Logs during configuration when SerfPass directive is used without providing a URI parameter.","resolution":"Update your Apache configuration to include a URI in the SerfPass directive (e.g., SerfPass http:\/\/backend.example.com\/)."},{"function":"add_pass","message_template":"Unable to parse SerfPass url.","reason":"Logs during configuration when the URI provided to SerfPass is malformed and can't be parsed.","resolution":"Check the URI syntax in your SerfPass directive. Ensure it follows the proper format (scheme:\/\/host[:port][\/path])."},{"function":"add_pass","message_template":"Need scheme part in url.","reason":"Logs during configuration when the URI provided to SerfPass doesn't include a scheme (http:\/\/ or https:\/\/).","resolution":"Update your SerfPass directive to include the scheme in the URL (e.g., SerfPass http:\/\/backend.example.com\/)."},{"function":"add_cluster","message_template":"SerfCluster must have at least a name and provider.","reason":"Logs during configuration when SerfCluster directive is used without both name and provider parameters.","resolution":"Update your Apache configuration to include both a name and a provider in the SerfCluster directive (e.g., SerfCluster mycluster static hosts=server1.example.com)."},{"function":"add_cluster","message_template":"SerfCluster: unable to find provider '%s'","reason":"Logs during configuration when the provider specified in SerfCluster isn't registered with the system.","resolution":"Use one of the built-in providers ('static' or 'heartbeat') or ensure the module implementing the custom provider is loaded before mod_serf."},{"function":"add_cluster","message_template":"SerfCluster: Provider '%s' failed to provider a configuration checker","reason":"Logs during configuration when a cluster provider doesn't implement the required check_config function.","resolution":"Use a different cluster provider or update the current provider to implement the check_config function. This might indicate an incompatible or incomplete provider module."},{"function":"hb_list_servers","message_template":"SerfCluster: Heartbeat unable to read '%s'","reason":"Logs when the heartbeat provider can't read the heartbeat file specified in the configuration.","resolution":"Ensure the heartbeat file exists at the specified path and is readable by the Apache process. Check permissions and create the file if needed."},{"function":"hb_table_check","message_template":"SerfCluster Heartbeat Invalid parameter '%s'","reason":"Logs during configuration when an unrecognized parameter is provided to the heartbeat provider.","resolution":"Remove or correct the invalid parameter in your SerfCluster directive. The heartbeat provider only accepts the 'path' parameter."},{"function":"hb_config_check","message_template":"SerfCluster Heartbeat requires a path to the heartbeat information.","reason":"Logs during configuration when the heartbeat provider is used without specifying a path to the heartbeat file.","resolution":"Update your SerfCluster directive to include the path parameter for the heartbeat provider (e.g., SerfCluster mycluster heartbeat path=\/path\/to\/heartbeat.txt)."},{"function":"static_table_check","message_template":"SerfCluster Static Invalid parameter '%s'","reason":"Logs during configuration when an unrecognized parameter is provided to the static provider.","resolution":"Remove or correct the invalid parameter in your SerfCluster directive. The static provider only accepts 'hosts' and 'order' parameters."},{"function":"static_config_check","message_template":"SerfCluster Static requires at least a host list.","reason":"Logs during configuration when the static provider is used without any parameters.","resolution":"Update your SerfCluster directive to include at least the hosts parameter for the static provider (e.g., SerfCluster mycluster static hosts=server1.example.com,server2.example.com)."},{"function":"static_config_check","message_template":"SerfCluster Static requires at least a hosts parameter","reason":"Logs during configuration when the static provider is used without the required 'hosts' parameter.","resolution":"Update your SerfCluster directive to include the hosts parameter for the static provider (e.g., SerfCluster mycluster static hosts=server1.example.com,server2.example.com)."}],"project":"apache\/httpd"}