{"module":"mod_proxy_wstunnel.c","summary":"This module enables Apache to proxy WebSocket connections through the HTTP server. It handles WebSocket protocol tunneling, manages connection lifetimes, and provides both synchronous and asynchronous communication modes between clients and backend WebSocket servers.","logs":[{"function":"proxy_wstunnel_pump","message_template":"Tunnel timed out","reason":"Logged when a WebSocket tunnel connection times out without completing the request. This typically occurs when there's no activity on either end of the tunnel for longer than the configured timeout period.","resolution":"Increase the ProxyWebsocketIdleTimeout value if legitimate connections are timing out. Check network connectivity between proxy and the backend WebSocket server. Verify the backend server is responding in a timely manner."},{"function":"proxy_wstunnel_pump","message_template":"Attempting to go async","reason":"Informational log when the proxy is switching to asynchronous mode for handling the WebSocket connection. This happens when synchronous communication would block.","resolution":"Information log, no resolution required. If you see performance issues, you might want to adjust ProxyWebsocketAsyncDelay value."},{"function":"proxy_wstunnel_finish","message_template":"proxy_wstunnel_finish","reason":"Trace log indicating the WebSocket tunnel is being closed and cleaned up.","resolution":"Information log, no resolution required."},{"function":"proxy_wstunnel_cancel_callback","message_template":"proxy_wstunnel_cancel_callback, IO timed out","reason":"Logged when an asynchronous WebSocket connection times out while waiting for I\/O. The connection will be closed.","resolution":"If legitimate connections are timing out, increase ProxyWebsocketIdleTimeout. Check for network issues between proxy and backend, or verify the backend is responding properly."},{"function":"proxy_wstunnel_callback","message_template":"proxy_wstunnel_callback suspend","reason":"Informational trace log indicating the WebSocket connection is being suspended to wait for more activity.","resolution":"Information log, no resolution required."},{"function":"proxy_wstunnel_check_trans","message_template":"check_trans fallback","reason":"Trace log indicating that the request is being passed to mod_proxy_http instead of being handled by mod_proxy_wstunnel.","resolution":"Information log, no resolution required. This is normal when ProxyWebsocketFallbackToProxyHttp is enabled."},{"function":"proxy_wstunnel_canon","message_template":"canon fallback","reason":"Trace log indicating URL canonicalization is being handled by another module due to fallback configuration.","resolution":"Information log, no resolution required. This is normal when ProxyWebsocketFallbackToProxyHttp is enabled."},{"function":"proxy_wstunnel_canon","message_template":"canonicalising URL %s","reason":"Trace log showing the URL being canonicalized for WebSocket tunneling.","resolution":"Information log, no resolution required."},{"function":"proxy_wstunnel_canon","message_template":"error parsing URL %s: %s","reason":"Error log when the WebSocket URL cannot be parsed correctly. This prevents the proxy from establishing a connection.","resolution":"Check the WebSocket URL syntax in your configuration. Ensure it follows the ws:\/\/ or wss:\/\/ scheme format correctly and doesn't contain invalid characters."},{"function":"proxy_wstunnel_canon","message_template":"To be forwarded path contains control characters or spaces","reason":"Error log when the URL path contains control characters or spaces that should have been properly encoded.","resolution":"Ensure clients are properly encoding URLs. Check for client applications sending malformed WebSocket URLs or potential security attacks attempting to inject control characters."},{"function":"proxy_wstunnel_canon","message_template":"To be forwarded query string contains control characters or spaces","reason":"Error log when the query string in the URL contains control characters or spaces that should have been properly encoded.","resolution":"Ensure clients are properly encoding query parameters in WebSocket URLs. Check for client applications sending malformed requests or potential security attacks."},{"function":"proxy_wstunnel_request","message_template":"sending request","reason":"Trace log indicating a WebSocket proxy request is being sent to the backend server.","resolution":"Information log, no resolution required."},{"function":"proxy_wstunnel_request","message_template":"error creating websocket tunnel","reason":"Error log when the proxy fails to create a WebSocket tunnel. This could be due to resource limitations or connection issues.","resolution":"Check system resources (file descriptors, memory). Verify network connectivity to the backend WebSocket server. Examine server logs for more specific errors that might have occurred during tunnel creation."},{"function":"proxy_wstunnel_request","message_template":"No async support","reason":"Trace log indicating the MPM (Multi-Processing Module) doesn't support asynchronous connections, so the WebSocket tunnel will operate in synchronous mode.","resolution":"Information log, no resolution required. If you need async support, consider using an MPM that supports it, like event MPM."},{"function":"proxy_wstunnel_request","message_template":"error registering websocket tunnel","reason":"Error log when registering the WebSocket tunnel with the MPM's polling mechanism fails.","resolution":"Check system resources, particularly file descriptors. Verify your MPM configuration. This might indicate the server is overloaded or incorrectly configured for the number of concurrent connections."},{"function":"proxy_wstunnel_handler","message_template":"declining URL %s","reason":"Debug log when the module declines to handle a URL because it doesn't start with ws: or wss:.","resolution":"Information log, no resolution required. This is normal for non-WebSocket URLs."},{"function":"proxy_wstunnel_handler","message_template":"serving URL %s","reason":"Debug or trace log indicating the module is handling a WebSocket URL.","resolution":"Information log, no resolution required."},{"function":"proxy_wstunnel_handler","message_template":"require upgrade for URL %s (Upgrade header is %s, expecting %s)","reason":"Informational log when a client attempts to access a WebSocket URL without the proper Upgrade header or with an incorrect value.","resolution":"Ensure clients are sending the proper WebSocket handshake with Upgrade and Connection headers. If you're seeing this frequently, check client implementations or educate users on proper WebSocket connection protocols."},{"function":"proxy_wstunnel_handler","message_template":"failed to make connection to backend: %s","reason":"Error log when the proxy cannot establish a connection to the backend WebSocket server.","resolution":"Verify the backend server is running and accessible. Check network connectivity, firewall rules, and DNS resolution. Ensure the backend server address and port in your proxy configuration are correct."},{"function":"proxyws_set_idle","message_template":"ProxyWebsocketIdleTimeout timeout has wrong format","reason":"Configuration error when the ProxyWebsocketIdleTimeout directive value cannot be parsed correctly.","resolution":"Correct the ProxyWebsocketIdleTimeout directive in your configuration. Use a valid time format like '10s' for 10 seconds or '5m' for 5 minutes."},{"function":"proxyws_set_asynch_delay","message_template":"ProxyWebsocketAsyncDelay timeout has wrong format","reason":"Configuration error when the ProxyWebsocketAsyncDelay directive value cannot be parsed correctly.","resolution":"Correct the ProxyWebsocketAsyncDelay directive in your configuration. Use a valid time format like '10s' for 10 seconds or '5m' for 5 minutes."}],"project":"apache\/httpd"}