{"module":"mod_proxy_connect.c","summary":"This module implements the CONNECT method for Apache proxy, enabling tunneling through HTTP proxies for secure SSL connections. It creates a direct socket connection between client and server, passing data transparently between them, and optionally supporting chained proxies.","logs":[{"function":"proxy_connect_canon","message_template":"canonicalising URL %s","reason":"Logs the URL being processed by the canonicalization function when the CONNECT method is used. This is trace-level logging for debugging.","resolution":"This is an informational log message for debugging purposes, no resolution required."},{"function":"proxy_connect_handler","message_template":"declining URL %s","reason":"The handler is declining to process this URL as it's not a CONNECT method request.","resolution":"This is an informational log message for debugging purposes, no resolution required."},{"function":"proxy_connect_handler","message_template":"serving URL %s","reason":"The handler has accepted a CONNECT request and will process the specified URL.","resolution":"This is an informational log message for debugging purposes, no resolution required."},{"function":"proxy_connect_handler","message_template":"connecting %s to %s:%d","reason":"Logs details about the connection being established, showing the requested URL and the target hostname and port.","resolution":"This is an informational log message for debugging purposes, no resolution required."},{"function":"proxy_connect_handler","message_template":"URI cannot be parsed: ","reason":"The URL provided in the CONNECT request is malformed and cannot be parsed correctly. Likely caused by client sending an invalid URL format.","resolution":"Check client software that's generating the CONNECT request for bugs or incompatibilities. The client should provide a properly formatted URL."},{"function":"proxy_connect_handler","message_template":"failed to resolve hostname '%s'","reason":"DNS resolution failed for the hostname in the CONNECT request. This may indicate network connectivity issues or DNS server problems.","resolution":"Check DNS configuration on the server, verify network connectivity, and ensure the hostname is correct. May require contacting network administrator if DNS is centrally managed."},{"function":"proxy_connect_handler","message_template":"DNS lookup failure for: ","reason":"DNS resolution failed for the hostname while trying to establish a connection. This may be due to an invalid hostname or DNS service issues.","resolution":"Verify that the hostname is valid and accessible. Check DNS server configuration and network connectivity. The hostname might be misspelled or non-existent."},{"function":"proxy_connect_handler","message_template":"Connect to remote machine blocked","reason":"Connection was blocked due to ProxyBlock directive matching the hostname or IP address, a security measure to restrict proxy access.","resolution":"If the connection should be allowed, review and modify ProxyBlock directives in the Apache configuration to allow the desired host. This is a security feature, so changes should be made carefully."},{"function":"proxy_connect_handler","message_template":"connecting to remote proxy %s on port %d","reason":"The proxy is connecting to another (chained) proxy server rather than directly to the target. This is part of proxy chaining configuration.","resolution":"This is an informational log message for debugging purposes, no resolution required."},{"function":"proxy_connect_handler","message_template":"Connect to remote machine blocked","reason":"Connection was blocked because the requested port is not in the list of allowed ports for CONNECT method. This is a security restriction.","resolution":"If legitimate, add the required port to the AllowCONNECT directive in the Apache configuration. Only add ports that are necessary for your use case to maintain security."},{"function":"proxy_connect_handler","message_template":"an error occurred creating a new connection to %pI (%s)","reason":"Failed to establish a connection to the target server or chained proxy. Could be due to network issues, firewall rules, or the target server being down.","resolution":"Check if the destination server is operational, verify network connectivity, and ensure firewall rules allow the connection. May require network administrator intervention if firewall rules are preventing the connection."},{"function":"proxy_connect_handler","message_template":"pre_connection setup failed (%d)","reason":"The pre-connection hook failed, which might indicate a problem with a module that processes connections before they're fully established.","resolution":"Check Apache error logs for more detailed information from modules that implement pre_connection hooks. May require configuration adjustment or disabling problematic modules."},{"function":"proxy_connect_handler","message_template":"connection complete to %pI (%s)","reason":"Successfully established a connection to the target server or chained proxy. This is a trace-level log for connection tracking.","resolution":"This is an informational log message for debugging purposes, no resolution required."},{"function":"proxy_connect_handler","message_template":"sending the CONNECT request to the remote proxy","reason":"When chaining proxies, this indicates the CONNECT request is being forwarded to the next proxy in the chain.","resolution":"This is an informational log message for debugging purposes, no resolution required."},{"function":"proxy_connect_handler","message_template":"Returning 200 OK","reason":"The proxy is about to send a 200 Connection Established response to the client, indicating successful tunnel establishment.","resolution":"This is an informational log message for debugging purposes, no resolution required."},{"function":"proxy_connect_handler","message_template":"can't create tunnel for %pI (%s)","reason":"Failed to create the proxy tunnel between client and server after connection establishment. Could be due to resource constraints or system issues.","resolution":"Check server resources (memory, file descriptors) and Apache configuration. Might require increasing available resources or reducing server load."},{"function":"proxy_connect_handler","message_template":"tunnel timed out","reason":"The established proxy tunnel has timed out, likely due to inactivity or connection problems between the client and target server.","resolution":"Check network stability, connection timeouts in Apache configuration, and client behavior. May need to increase timeout values if legitimate connections are timing out."},{"function":"set_allowed_ports","message_template":"AllowCONNECT: port numbers must be numeric","reason":"Configuration error: The AllowCONNECT directive contains non-numeric values. Port numbers must be integer values.","resolution":"Review and correct the AllowCONNECT directive in the Apache configuration file to ensure all port values are numeric."},{"function":"set_allowed_ports","message_template":"Cannot parse '%s' as port number","reason":"Configuration error: A value in the AllowCONNECT directive cannot be parsed as a valid port number. The value might not be a valid integer.","resolution":"Correct the AllowCONNECT directive in the Apache configuration, ensuring all port numbers are valid integers within the proper range (1-65535)."}],"project":"apache\/httpd"}