{"module":"mod_proxy.h","summary":"Core header file for Apache's mod_proxy module that defines structures, constants, and function declarations for HTTP proxy functionality. It establishes the framework for handling proxied connections, load balancing, worker management, and request routing.","logs":[{"function":"ap_proxyerror","message_template":"Various error messages based on statuscode parameter","reason":"Called when proxy encounters an error condition that needs to be logged and potentially reported to clients","resolution":"Resolution depends on specific error code and message. Check proxy configuration and connectivity to backend servers."},{"function":"ap_proxy_check_connection","message_template":"Connection to backend failed","reason":"Socket connection to backend server could not be established or was lost","resolution":"Verify backend server is running, network connectivity is functional, and firewall rules allow connection."},{"function":"ap_proxy_connect_backend","message_template":"Failed to connect to backend server","reason":"Unable to establish connection to the specified worker backend","resolution":"Check backend server availability, DNS resolution, and network connectivity between proxy and backend."},{"function":"ap_proxy_acquire_connection","message_template":"All connections in use, waiting for connection to become available","reason":"Connection pool for worker is at capacity and no connections are available","resolution":"Consider increasing worker connection limits (min, smax, max) or adding more backend servers to distribute load."},{"function":"ap_proxy_release_connection","message_template":"Connection closed","reason":"Connection is being closed rather than returned to the pool, possibly due to errors","resolution":"If this happens frequently, check for backend server issues or increase connection timeouts."},{"function":"ap_proxy_determine_connection","message_template":"DNS lookup failure for backend server","reason":"Cannot resolve hostname for backend server","resolution":"Verify DNS configuration and ensure backend hostname is correct and resolvable from proxy server."},{"function":"ap_proxy_pre_request","message_template":"No worker for proxied request","reason":"No appropriate worker found to handle the proxied request","resolution":"Check ProxyPass configurations and ensure workers are properly defined for all required paths."},{"function":"ap_proxy_backend_broke","message_template":"Backend connection was closed during request processing","reason":"Connection to backend server was unexpectedly terminated while processing a request","resolution":"Check backend server logs for errors. May indicate backend server is overloaded or crashing."},{"function":"ap_proxy_sync_balancer","message_template":"Failed to sync balancer configuration","reason":"Error occurred while synchronizing balancer configuration with shared memory","resolution":"May indicate issues with shared memory allocation or corruption. Restart Apache service if persistent."},{"function":"ap_proxy_tunnel_run","message_template":"Tunnel connection timeout","reason":"Timeout while waiting for data in tunneled connection","resolution":"Consider increasing tunnel timeout settings if legitimate operations take longer than the current timeout."},{"function":"ap_proxy_clear_connection","message_template":"Close connection header present","reason":"Connection: close header was found in the request or response","resolution":"Informational only. Connection will not be reused as requested by client or server."},{"function":"ap_proxy_get_worker","message_template":"Worker not found","reason":"Requested worker configuration could not be found","resolution":"Verify worker configurations in httpd.conf and ensure workers are properly defined for all required URLs."},{"function":"ap_proxy_initialize_worker","message_template":"Failed to initialize worker","reason":"Error during worker initialization, possibly related to connection pool or mutex creation","resolution":"Check system resources (memory, file descriptors) and Apache error logs for more specific error information."},{"function":"ap_proxy_define_worker","message_template":"Invalid worker URL scheme","reason":"Worker URL contains an unsupported or invalid URL scheme","resolution":"Update worker configuration to use a valid scheme like http:\/\/, https:\/\/, ajp:\/\/, etc."},{"function":"balancer_manage","message_template":"balancer: Error status 400 (BAD REQUEST)","reason":"Error in balancer management operation due to invalid parameters","resolution":"Review balancer management request parameters and ensure they follow the required format."}],"project":"apache\/httpd"}