{"module":"mpm_worker.c","summary":"The worker MPM implements a hybrid multi-process multi-threaded server architecture for Apache HTTP Server. It creates multiple child processes and multiple threads per process to efficiently handle concurrent connections, managing process lifecycle, thread creation, and request processing.","logs":[{"function":"listener_thread","message_template":"apr_proc_mutex_%s failed before this child process served any requests.","reason":"Logs a critical error when a mutex operation (lock or unlock) fails in the listener thread before it processed any requests, indicating a fatal issue with the mutex mechanism","resolution":"Check system limits, permissions, and mutex implementation; ensure the mutex file is accessible and writable by the Apache user"},{"function":"listener_thread","message_template":"apr_proc_mutex_%s failed. Attempting to shutdown process gracefully.","reason":"Logs a critical error when a mutex operation (lock or unlock) fails in the listener thread, and the process will try to exit gracefully","resolution":"Check system limits, permissions, and mutex implementation; ensure the mutex file is accessible and writable by the Apache user"},{"function":"listener_thread","message_template":"apr_queue_info_wait failed. Attempting to shutdown process gracefully.","reason":"Logs an error when waiting for an idle worker from the queue fails, indicating a potential thread synchronization issue","resolution":"This may indicate system resource exhaustion or an internal MPM error; check for system resource limits and consider reducing ThreadsPerChild"},{"function":"listener_thread","message_template":"apr_proc_mutex_unlock failed. Attempting to shutdown process gracefully.","reason":"Logs a critical error when unlocking the accept mutex fails, indicating a serious mutex issue","resolution":"Check system limits, permissions, and mutex implementation; ensure the mutex file is accessible and writable by the Apache user"},{"function":"listener_thread","message_template":"accept() on client socket failed","reason":"Logs a debug message when accepting a connection fails, which can happen during normal operation (e.g., client disconnect)","resolution":"If seen occasionally, this is normal; if frequent, check network configuration and system limits on file descriptors"},{"function":"listener_thread","message_template":"ap_queue_push_socket failed","reason":"Logs a critical error when the listener thread cannot queue a connection to a worker thread, causing the connection to be closed immediately","resolution":"May indicate queue or memory issues; check system resources and consider reducing MaxRequestWorkers"},{"function":"worker_thread","message_template":"ap_queue_info_set_idle failed. Attempting to shutdown process gracefully.","reason":"Logs an error when a worker thread fails to mark itself as idle in the queue information structure","resolution":"This indicates an internal MPM error or system resource issue; consider restarting Apache"},{"function":"worker_thread","message_template":"ap_queue_pop_socket failed","reason":"Logs a critical error when a worker thread fails to get a connection from the queue","resolution":"This may indicate an internal MPM queue corruption; check for system stability issues and consider restarting Apache"},{"function":"start_threads","message_template":"ap_thread_create: unable to create worker thread","reason":"Logs an alert when the MPM fails to create a worker thread, likely due to system resource constraints","resolution":"Check system limits (ulimit -a), particularly max user processes and memory; consider reducing ThreadsPerChild or MaxRequestWorkers"},{"function":"start_threads","message_template":"ap_thread_create: unable to create listener thread","reason":"Logs an alert when the MPM fails to create the listener thread, which is critical for accepting connections","resolution":"Check system limits (ulimit -a), particularly max user processes and memory; this is a critical error that prevents normal operation"},{"function":"start_threads","message_template":"child %ld isn't taking over slots very quickly (%d of %d)","reason":"Logs a debug message when a child process is slow to take over scoreboard slots from a previous generation during restart","resolution":"This may indicate a busy server or resource contention; if persistent, check for system load issues or potential deadlocks"},{"function":"join_workers","message_template":"listener has not stopped accepting yet (%d iter)","reason":"Logs a trace message when the listener thread is slow to respond to shutdown signals","resolution":"If this persists for many iterations, it may indicate the listener thread is blocked; check for system load or deadlock issues"},{"function":"join_workers","message_template":"the listener thread didn't exit","reason":"Logs a debug message when the listener thread fails to exit after multiple attempts to signal it","resolution":"This may indicate a blocked or deadlocked thread; check for system stability issues and consider sending stronger signals"},{"function":"join_workers","message_template":"apr_thread_join: unable to join listener thread","reason":"Logs a critical error when the main thread cannot join the listener thread during shutdown","resolution":"This may indicate an unresponsive thread; check system resources and thread state, may require a complete restart"},{"function":"join_workers","message_template":"apr_thread_join: unable to join worker thread %d","reason":"Logs a critical error when the main thread cannot join a worker thread during shutdown","resolution":"This may indicate an unresponsive thread; check system resources and thread state, may require a complete restart"},{"function":"join_start_thread","message_template":"apr_thread_join: unable to join the start thread","reason":"Logs a critical error when the main thread cannot join the thread responsible for starting worker threads","resolution":"This indicates a serious thread synchronization issue; check system stability and consider server restart"},{"function":"child_main","message_template":"Couldn't initialize child main thread","reason":"Logs an emergency message when the MPM fails to initialize the main thread for a child process","resolution":"Check system thread limits and resources; this is a critical error that prevents normal child operation"},{"function":"child_main","message_template":"Couldn't initialize cross-process lock in child","reason":"Logs an emergency message when a child process fails to initialize the mutex for cross-process synchronization","resolution":"Check file system permissions and mutex implementation; ensure the mutex file location is writable by the Apache user"},{"function":"child_main","message_template":"Couldn't initialize signal thread","reason":"Logs an emergency message when the MPM fails to set up signal handling in a child process","resolution":"This indicates a serious system-level issue with signal handling; check OS signal implementation and consider upgrading Apache"},{"function":"child_main","message_template":"WARNING: ThreadStackSize of %ld is inappropriate, using default","reason":"Logs a warning when the configured ThreadStackSize is not supported or inappropriate for the platform","resolution":"Adjust the ThreadStackSize directive to a more appropriate value for your platform, or remove it to use the default value"},{"function":"child_main","message_template":"ap_thread_create: unable to create worker thread","reason":"Logs an alert when the MPM fails to create a worker thread in the child process","resolution":"Check system limits (ulimit -a), particularly max user processes and memory; consider reducing ThreadsPerChild or MaxRequestWorkers"},{"function":"child_main","message_template":"Couldn't create pollset in thread; check system or user limits","reason":"Logs an emergency message when the MPM fails to create a pollset for the listener thread","resolution":"Check system limits on file descriptors (ulimit -n) and increase if needed; ensure kernel supports the polling mechanism used by APR"},{"function":"child_main","message_template":"Couldn't create add listener to pollset; check system or user limits","reason":"Logs an emergency message when the MPM fails to add a listener socket to the pollset","resolution":"Check system limits on file descriptors and ensure Apache has permissions to access the listening socket"},{"function":"make_child","message_template":"fork: Unable to fork new process","reason":"Logs an error when the MPM fails to fork a new child process, typically due to system resource constraints","resolution":"Check system limits on processes (ulimit -u) and memory, reduce ServerLimit or increase system resources"},{"function":"make_child","message_template":"processor unbind failed","reason":"Logs a debug message when unbinding a child process from a specific processor fails on platforms like AIX","resolution":"This is typically informational on AIX systems; check platform documentation for processor binding if this is important for your environment"},{"function":"worker_note_child_lost_slot","message_template":"pid %ld taking over scoreboard slot from %ld%s","reason":"Logs a debug message when a new child process takes over a scoreboard slot from a previous child","resolution":"This is informational during graceful restart; if seen during normal operation, it may indicate unexpected child termination"},{"function":"perform_idle_server_maintenance","message_template":"A resource shortage or other unrecoverable failure was encountered before any child process initialized successfully... httpd is exiting!","reason":"Logs an alert when no child processes were able to initialize successfully, indicating a fatal error condition","resolution":"Check system resources, permissions, and Apache configuration; look for earlier error messages for specific causes"},{"function":"perform_idle_server_maintenance","message_template":"server reached MaxRequestWorkers setting, consider raising the MaxRequestWorkers setting","reason":"Logs an error when all worker threads are busy, indicating the server is at capacity","resolution":"If performance is adequate, this may be normal; otherwise, increase MaxRequestWorkers if system resources allow, or add more servers"},{"function":"perform_idle_server_maintenance","message_template":"server is within MinSpareThreads of MaxRequestWorkers, consider raising the MaxRequestWorkers setting","reason":"Logs an error when the server is nearing capacity with few idle threads available","resolution":"Consider increasing MaxRequestWorkers if system resources allow, or add more servers to distribute load"},{"function":"perform_idle_server_maintenance","message_template":"scoreboard is full, not at MaxRequestWorkers","reason":"Logs an error when the scoreboard is full but not all worker threads are in use, indicating a potential misconfiguration","resolution":"This suggests a scoreboard sizing issue; check ServerLimit and MaxRequestWorkers settings for consistency"},{"function":"perform_idle_server_maintenance","message_template":"server seems busy, (you may need to increase StartServers, ThreadsPerChild or Min\/MaxSpareThreads), spawning %d children, there are around %d idle threads, and %d total children","reason":"Logs an info message when the server is busy and spawning additional child processes to handle load","resolution":"This is normal during load increases; if persistent, consider adjusting the mentioned parameters for better performance"},{"function":"perform_idle_server_maintenance","message_template":"children are killed successively!","reason":"Logs a warning when multiple child processes are being killed one after another, potentially indicating instability","resolution":"Check for system resource issues, crashes in modules, or external forces terminating Apache processes"},{"function":"server_main_loop","message_template":"Ignoring fatal error in child of previous generation (pid %ld).","reason":"Logs a warning when a child from a previous generation encounters a fatal error during restart","resolution":"This is expected during restarts; if seen frequently outside restarts, check for module stability issues"},{"function":"server_main_loop","message_template":"long lost child came home! (pid %ld)","reason":"Logs a warning when a child process that wasn't in the scoreboard exits","resolution":"This may indicate scoreboard corruption or race conditions; if frequent, check for module issues affecting process management"},{"function":"worker_run","message_template":"could not duplicate listeners","reason":"Logs a critical error when the MPM fails to duplicate listener information for child processes","resolution":"Check file descriptor limits and system resources; this is a critical error preventing server startup"},{"function":"worker_run","message_template":"could not open pipe-of-death","reason":"Logs a critical error when the MPM fails to create the communication channel for signaling child processes","resolution":"Check system pipe limits and resources; this is a critical error preventing server startup"},{"function":"worker_run","message_template":"could not create accept mutex","reason":"Logs a critical error when the MPM fails to create the mutex used for serializing accept() calls","resolution":"Check file system permissions where mutex files are stored; ensure the directory is writable by the Apache user"},{"function":"worker_run","message_template":"%s configured -- resuming normal operations","reason":"Logs a notice message when the server has been successfully configured and is resuming normal operations","resolution":"Informational message indicating successful startup or restart; no action required"},{"function":"worker_run","message_template":"Server built: %s","reason":"Logs an info message showing when the server was built","resolution":"Informational message for version tracking; no action required"},{"function":"worker_run","message_template":"Accept mutex: %s (default: %s)","reason":"Logs a debug message showing which accept mutex type is being used","resolution":"Informational message about mutex configuration; useful for troubleshooting accept() serialization issues"},{"function":"worker_run","message_template":"caught SIGTERM, shutting down","reason":"Logs a notice message when the server receives a SIGTERM signal and is shutting down","resolution":"Normal shutdown message; no action required unless shutdown was unexpected"},{"function":"worker_run","message_template":"caught %s, shutting down gracefully","reason":"Logs a notice message when the server receives a signal to shut down gracefully","resolution":"Normal graceful shutdown message; no action required unless shutdown was unexpected"},{"function":"worker_run","message_template":"%s received. Doing graceful restart","reason":"Logs a notice message when the server receives a signal to restart gracefully","resolution":"Normal graceful restart message; no action required unless restart was unexpected"},{"function":"worker_run","message_template":"SIGHUP received. Attempting to restart","reason":"Logs a notice message when the server receives a SIGHUP signal for ungraceful restart","resolution":"Normal restart message; no action required unless restart was unexpected"},{"function":"worker_open_logs","message_template":"no listening sockets available, shutting down","reason":"Logs an alert message when no listening sockets are available, preventing the server from starting","resolution":"Check port availability, permissions, and Listen directives; ensure Apache can bind to the configured ports"},{"function":"worker_pre_config","message_template":"apr_proc_detach failed","reason":"Logs a critical error when the server fails to detach from the controlling terminal during daemonization","resolution":"Check system resources and permissions; this may indicate platform-specific issues with process daemonization"},{"function":"worker_check_config","message_template":"WARNING: ServerLimit of %d exceeds compile-time limit of %d servers, decreasing to %d.","reason":"Logs a warning when the configured ServerLimit exceeds the compile-time maximum","resolution":"Reduce ServerLimit in the configuration to a value at or below the compile-time limit, or recompile Apache with a higher limit"},{"function":"worker_check_config","message_template":"ServerLimit of %d not allowed, increasing to 1","reason":"Logs a warning when the configured ServerLimit is less than 1, which is invalid","resolution":"Set ServerLimit to at least 1 in the configuration"},{"function":"worker_check_config","message_template":"changing ServerLimit to %d from original value of %d not allowed during restart","reason":"Logs a warning when attempting to change ServerLimit during a server restart, which is not supported","resolution":"ServerLimit can only be changed with a full server stop and start; restart with the same value or perform a complete restart"},{"function":"worker_check_config","message_template":"WARNING: ThreadLimit of %d exceeds compile-time limit of %d threads, decreasing to %d.","reason":"Logs a warning when the configured ThreadLimit exceeds the compile-time maximum","resolution":"Reduce ThreadLimit in the configuration to a value at or below the compile-time limit, or recompile Apache with a higher limit"},{"function":"worker_check_config","message_template":"ThreadLimit of %d not allowed, increasing to 1","reason":"Logs a warning when the configured ThreadLimit is less than 1, which is invalid","resolution":"Set ThreadLimit to at least 1 in the configuration"},{"function":"worker_check_config","message_template":"changing ThreadLimit to %d from original value of %d not allowed during restart","reason":"Logs a warning when attempting to change ThreadLimit during a server restart, which is not supported","resolution":"ThreadLimit can only be changed with a full server stop and start; restart with the same value or perform a complete restart"},{"function":"worker_check_config","message_template":"WARNING: ThreadsPerChild of %d exceeds ThreadLimit of %d threads, decreasing to %d.","reason":"Logs a warning when the configured ThreadsPerChild exceeds the ThreadLimit","resolution":"Reduce ThreadsPerChild to be less than or equal to ThreadLimit, or increase ThreadLimit (within compile-time limits)"},{"function":"worker_check_config","message_template":"ThreadsPerChild of %d not allowed, increasing to 1","reason":"Logs a warning when the configured ThreadsPerChild is less than 1, which is invalid","resolution":"Set ThreadsPerChild to at least 1 in the configuration"},{"function":"worker_check_config","message_template":"WARNING: MaxRequestWorkers of %d is less than ThreadsPerChild of %d, increasing to %d.","reason":"Logs a warning when MaxRequestWorkers is less than ThreadsPerChild, which is invalid","resolution":"Set MaxRequestWorkers to at least the value of ThreadsPerChild"},{"function":"worker_check_config","message_template":"WARNING: MaxRequestWorkers of %d is not an integer multiple of ThreadsPerChild of %d, decreasing to nearest multiple %d.","reason":"Logs a warning when MaxRequestWorkers is not an integer multiple of ThreadsPerChild","resolution":"Set MaxRequestWorkers to an integer multiple of ThreadsPerChild for optimal utilization"},{"function":"worker_check_config","message_template":"WARNING: MaxRequestWorkers of %d would require %d servers and would exceed ServerLimit of %d, decreasing to %d.","reason":"Logs a warning when the number of child processes needed for MaxRequestWorkers exceeds ServerLimit","resolution":"Either increase ServerLimit or decrease MaxRequestWorkers to ensure compatibility"},{"function":"set_max_workers","message_template":"MaxClients is deprecated, use MaxRequestWorkers instead.","reason":"Logs an info message when the deprecated MaxClients directive is used instead of MaxRequestWorkers","resolution":"Update configuration to use MaxRequestWorkers instead of MaxClients for future compatibility"},{"function":"worker_check_config","message_template":"WARNING: MinSpareThreads of %d not allowed, increasing to 1 to avoid almost certain server failure.","reason":"Logs a warning when MinSpareThreads is less than 1, which could cause server instability","resolution":"Set MinSpareThreads to at least 1 in the configuration"}],"project":"apache\/httpd"}