{"module":"mod_session.c","summary":"This module provides session management functionality for Apache HTTP Server. It handles creating, loading, encoding, saving sessions, and allows configuring session parameters like expiry, URLs to include\/exclude, and integration with CGI environment.","logs":[{"function":"session_included","message_template":"excluded by configuration for: %s","reason":"Logs a debug message when a session is excluded for a URL based on configuration rules. This occurs when a URL matches an exclusion pattern or doesn't match any inclusion pattern.","resolution":"This is an informational message for debugging. If sessions are not working for specific URLs, check the SessionInclude and SessionExclude directives in your configuration."},{"function":"ap_session_load","message_template":"session is enabled but no session modules have been configured, session not loaded: %s","reason":"Warns that session functionality is enabled but no session storage modules (like mod_session_cookie) have been configured, making session loading impossible.","resolution":"Configure at least one session storage module (mod_session_cookie, mod_session_dbd, etc.) in your Apache configuration."},{"function":"ap_session_load","message_template":"error while loading the session, session not loaded: %s","reason":"Logs an error when the session storage module encountered a problem loading the session data. Could be due to database issues, file permissions, etc.","resolution":"Check the error logs for more specific messages from the session storage module. Verify database connectivity if using mod_session_dbd or file permissions if using file-based storage."},{"function":"ap_session_load","message_template":"error while decoding the session, session not loaded: %s","reason":"Logs an error when the session data was loaded but could not be decoded properly. This could indicate corrupted session data or incompatible encoding formats.","resolution":"The session will be treated as a new session. Check if you've changed session encoding methods or if there might be tampering with session data."},{"function":"ap_session_load","message_template":"session is expired","reason":"Logs a trace message when a session has expired based on its expiry timestamp. The session will be treated as a new, empty session.","resolution":"This is an informational message. If sessions are expiring too quickly, adjust the SessionMaxAge directive to a larger value."},{"function":"ap_session_save","message_template":"attempt made to save the session twice, session not saved: %s","reason":"Logs an error when there's an attempt to save a session that has already been saved. This could indicate an issue in application logic or a module trying to save sessions multiple times.","resolution":"Check for modules or code that might be calling session save functions multiple times for the same request. This is often a programming error in custom modules."},{"function":"ap_session_save","message_template":"attempt made to save a session when the session had already expired, session not saved: %s","reason":"Logs a warning when there's an attempt to save a session after it has expired. This could happen if processing takes longer than the session timeout.","resolution":"Increase SessionMaxAge if requests are taking longer to process than expected, or implement better session handling in your application to refresh sessions before they expire."},{"function":"ap_session_save","message_template":"error while encoding the session, session not saved: %s","reason":"Logs an error when the session could not be encoded properly before saving. This could indicate issues with data in the session or problems with the encoding mechanism.","resolution":"Check what data is being stored in the session. Ensure all data is properly formatted and doesn't contain problematic characters or excessive size."},{"function":"ap_session_save","message_template":"session is enabled but no session modules have been configured, session not saved: %s","reason":"Warns that session functionality is enabled but no session storage modules have been configured, making session saving impossible.","resolution":"Configure at least one session storage module (mod_session_cookie, mod_session_dbd, etc.) in your Apache configuration."},{"function":"ap_session_save","message_template":"error while saving the session, session not saved: %s","reason":"Logs an error when the session storage module encountered a problem saving the session data. Could be due to database issues, file permissions, disk space, etc.","resolution":"Check the error logs for more specific messages from the session storage module. Verify database connectivity, disk space, and appropriate permissions for the storage mechanism being used."}],"project":"apache\/httpd"}