{"module":"session_crypto_module.c","summary":"A module for Apache that provides encryption and decryption of session data using APR crypto libraries. It supports various ciphers and passphrase configurations for secure session storage and transmission.","logs":[{"function":"crypt_init","message_template":"no ciphers returned by APR. session encryption not possible","reason":"The APR crypto library failed to provide any ciphers. Session encryption cannot proceed without available ciphers.","resolution":"Verify that the APR installation includes crypto support and that the correct crypto libraries are installed on the system."},{"function":"crypt_init","message_template":"cipher '%s' not recognised by crypto driver. session encryption not possible, options: %s","reason":"The specified cipher is not available or recognized by the crypto driver. The system provides a list of available options.","resolution":"Configure SessionCryptoCipher with one of the supported ciphers listed in the error message. Default is 'aes256'."},{"function":"encrypt_string","message_template":"failure generating key from passphrase","reason":"The system could not generate an encryption key from the provided passphrase. This could be due to an invalid passphrase or issues with the crypto library.","resolution":"Verify the passphrase is valid and meets crypto requirements. Ensure the crypto library is correctly configured."},{"function":"encrypt_string","message_template":"padding is not supported for cipher","reason":"The selected cipher does not support the required padding method.","resolution":"Choose a different cipher that supports the required padding or reconfigure the crypto library to use a compatible padding method."},{"function":"encrypt_string","message_template":"the key type is not known","reason":"The crypto library does not recognize the key type being used for encryption.","resolution":"Verify the cipher and key configuration. May require updating or reconfiguring the crypto library."},{"function":"encrypt_string","message_template":"encryption could not be configured.","reason":"General failure in setting up the encryption environment with the specified parameters.","resolution":"Check all encryption parameters including cipher and passphrase. Verify the crypto library is properly installed and configured."},{"function":"encrypt_string","message_template":"apr_crypto_block_encrypt_init failed","reason":"Initialization of the encryption block failed, possibly due to issues with key, IV, or crypto library.","resolution":"Check for issues with the passphrase, ensure the crypto library is properly installed and compatible with the server."},{"function":"encrypt_string","message_template":"apr_crypto_block_encrypt failed","reason":"The actual encryption operation failed after initialization.","resolution":"Check for memory issues, verify crypto library is functioning correctly. May require debugging at the APR crypto level."},{"function":"encrypt_string","message_template":"apr_crypto_block_encrypt_finish failed","reason":"Failed to finalize the encryption process, possibly due to padding issues or memory problems.","resolution":"Verify the cipher supports the padding being used. Check for memory issues or crypto library bugs."},{"function":"decrypt_string","message_template":"too short to decrypt, aborting","reason":"The encrypted data is too short to contain valid encrypted content. This could be due to data corruption or tampering.","resolution":"Verify the session data hasn't been corrupted or truncated during transmission or storage. May require clearing the session."},{"function":"decrypt_string","message_template":"auth does not match, skipping","reason":"Authentication check failed for the encrypted data, indicating possible tampering or incorrect passphrase.","resolution":"Verify the passphrase is correct. If this happens frequently, it could indicate attempted session hijacking or data corruption."},{"function":"decrypt_string","message_template":"failure generating key from passphrase","reason":"Failed to generate the decryption key from the provided passphrase during decryption attempt.","resolution":"Verify the passphrase is valid. If multiple passphrases are configured, ensure at least one matches what was used for encryption."},{"function":"decrypt_string","message_template":"padding is not supported for cipher","reason":"The padding method required for decryption is not supported by the selected cipher.","resolution":"Configure a cipher that supports the required padding method, or reconfigure the crypto library."},{"function":"decrypt_string","message_template":"the key type is not known","reason":"The crypto library does not recognize the key type needed for decryption.","resolution":"Verify cipher configuration. May require updating or reconfiguring the crypto library."},{"function":"decrypt_string","message_template":"encryption could not be configured.","reason":"General failure in setting up the decryption environment with the specified parameters.","resolution":"Check all encryption parameters including cipher and passphrase. Verify crypto library is properly installed."},{"function":"decrypt_string","message_template":"too short to decrypt, skipping","reason":"The input data is too short to contain the expected components (salt, IV, etc.) needed for decryption.","resolution":"This may indicate data corruption or tampering. Clear the session and have the user log in again."},{"function":"decrypt_string","message_template":"apr_crypto_block_decrypt_init failed","reason":"Failed to initialize the decryption process, likely due to problems with key, IV, or the crypto library.","resolution":"Verify correct passphrase is being used. Check the crypto library configuration and installation."},{"function":"decrypt_string","message_template":"apr_crypto_block_decrypt failed","reason":"The actual decryption operation failed after initialization.","resolution":"This could indicate corrupted data or incompatible encryption parameters. May require clearing the session."},{"function":"decrypt_string","message_template":"apr_crypto_block_decrypt_finish failed","reason":"Failed to complete the decryption process, possibly due to padding issues or data corruption.","resolution":"Verify data integrity. May require clearing affected sessions or checking crypto library configuration."},{"function":"decrypt_string","message_template":"decryption failed","reason":"General decryption failure after trying all configured passphrases.","resolution":"Ensure at least one configured passphrase matches the one used for encryption. May require clearing the session."},{"function":"session_crypto_encode","message_template":"encrypt session failed","reason":"Failed to encrypt the session data, which may prevent the session from being securely stored.","resolution":"Check the detailed error logs for more specific encryption failures. Verify passphrase and cipher configuration."},{"function":"session_crypto_decode","message_template":"decrypt session failed, wrong passphrase?","reason":"Failed to decrypt the session data, likely due to an incorrect passphrase or data corruption.","resolution":"Verify all configured passphrases. If the issue persists, clear affected sessions and have users log in again."},{"function":"session_crypto_init","message_template":"APR crypto could not be initialised","reason":"The APR crypto subsystem failed to initialize during server startup.","resolution":"Verify APR crypto libraries are correctly installed. Check server configuration for crypto-related settings."},{"function":"session_crypto_init","message_template":"warning: crypto for '%s' was already initialised, using existing configuration","reason":"The crypto library was already initialized, indicating a possible duplicate configuration.","resolution":"This is just a warning, but check for duplicate SessionCryptoDriver configurations in your server setup."},{"function":"session_crypto_init","message_template":"The crypto library '%s' could not be loaded: %s (%s: %d)","reason":"Failed to load the specified crypto library during server initialization.","resolution":"Verify the crypto library exists and is accessible. Check the error details for specific issues to address."},{"function":"session_crypto_init","message_template":"The crypto library '%s' could not be found","reason":"The specified crypto library could not be found on the system.","resolution":"Install the missing crypto library or correct the library path in your configuration."},{"function":"session_crypto_init","message_template":"The crypto library '%s' could not be loaded","reason":"General failure in loading the specified crypto library.","resolution":"Check if the library is compatible with your system and properly installed. Verify permissions and dependencies."},{"function":"session_crypto_init","message_template":"The crypto library '%s' could not be initialised","reason":"The crypto library was found but could not be initialized properly.","resolution":"Check system requirements for the crypto library. Verify the library is compatible with your server version."},{"function":"session_crypto_init","message_template":"The crypto library '%s' was loaded successfully","reason":"Informational message indicating successful loading of the crypto library during server startup.","resolution":"Information log, no resolution required."}],"project":"apache\/httpd"}