{"module":"mod_session_cookie.c","summary":"Apache module that manages HTTP sessions using cookies. It handles storing session data in cookies (both RFC2109 and RFC2965 compliant), retrieving session data from cookies, and provides configuration options to control cookie behavior including name, attributes, removal, and max-age.","logs":[{"function":"check_string","message_template":"cannot be empty, or contain '=' or '&'.","reason":"Configuration error when a cookie name is empty or contains invalid characters ('=' or '&'). This occurs during server startup or configuration reloading.","resolution":"Modify the SessionCookieName or SessionCookieName2 directive to use a valid cookie name that doesn't contain '=' or '&' characters and isn't empty."},{"function":"session_cookie_save","message_template":"Cookie write operation failed","reason":"While this isn't an explicit log message in the code, the cookie write functions could fail and result in errors being logged by Apache. This might happen if memory allocation fails or if headers were already sent.","resolution":"Check server resources if this occurs frequently. May require increasing available memory or investigating race conditions in the request processing pipeline."},{"function":"session_cookie_load","message_template":"Cache-Control: no-cache, private","reason":"This header is added to responses for authenticated sessions to prevent caching of authenticated content. While not a log message itself, it affects response headers and browser behavior.","resolution":"This is expected behavior for authenticated sessions. If caching is required for authenticated content, module configuration would need to be modified."},{"function":"session_cookie_load","message_template":"Cookie parsing failed","reason":"While not explicitly logged in this module, cookie parsing errors could occur if malformed cookies are provided by clients. The Apache server might log these issues.","resolution":"If many such errors occur, investigate client behavior or potential attacks attempting to provide malformed cookies. May require cookie validation or filtering at the web application level."}],"project":"apache\/httpd"}