{"module":"mod_session_dbd.c","summary":"This module provides session management for Apache using a database backend. It enables loading, saving, updating, and deleting sessions from a database through the DBD API, supporting both anonymous sessions through cookies and per-user sessions.","logs":[{"function":"dbd_init","message_template":"You must load mod_dbd to enable AuthDBD functions","reason":"The required mod_dbd module is not loaded or properly configured. This error occurs when trying to initialize a database connection without the prerequisite module.","resolution":"Load the mod_dbd module in your Apache configuration using LoadModule directive. Ensure mod_dbd is properly configured with the necessary database connection parameters."},{"function":"dbd_init","message_template":"failed to acquire database connection","reason":"The module could not establish a connection to the database. This could be due to incorrect credentials, network issues, or database server being down.","resolution":"Verify database credentials in the DBD configuration. Check network connectivity between Apache and the database server. Ensure the database server is running and accessible."},{"function":"dbd_init","message_template":"failed to find the prepared statement called '%s'","reason":"A prepared SQL statement with the specified label was not found. This happens when the required SQL statement wasn't properly prepared during initialization.","resolution":"Ensure that all required SQL statements are properly defined using the DBDPrepare directive in your Apache configuration. Check for typos in statement labels."},{"function":"dbd_load","message_template":"no SessionDBDselectlabel has been specified","reason":"Configuration is missing the SessionDBDSelectLabel directive which specifies the prepared statement for selecting sessions from the database.","resolution":"Add a SessionDBDSelectLabel directive to your configuration pointing to a prepared SQL statement that selects session data from your database."},{"function":"dbd_load","message_template":"query execution error saving session '%s' in database using query '%s': %s","reason":"An error occurred when executing the SQL query to save a session. This could be due to database schema issues, permissions, or SQL syntax errors.","resolution":"Check the database error message for specific details. Verify the SQL statement syntax, ensure the database user has proper permissions, and confirm the database schema matches what the query expects."},{"function":"dbd_load","message_template":"error retrieving results while saving '%s' in database using query '%s': %s","reason":"The query executed successfully but there was an error retrieving the results. This could be due to data format issues or database driver errors.","resolution":"Check the database error message for specifics. Verify the data types in your database schema match what the application expects. Consider updating database drivers if they appear to be causing the issue."},{"function":"dbd_save","message_template":"no SessionDBDupdatelabel has been specified","reason":"Configuration is missing the SessionDBDUpdateLabel directive which specifies the prepared statement for updating existing sessions in the database.","resolution":"Add a SessionDBDUpdateLabel directive to your configuration pointing to a prepared SQL statement that updates session data in your database."},{"function":"dbd_save","message_template":"query execution error updating session '%s' using database query '%s': %s\/%s","reason":"An error occurred when executing the SQL query to update a session. This could be due to database constraints, permissions, or SQL syntax errors.","resolution":"Check the database error message for specific details. Verify the SQL statement syntax, ensure the database user has proper permissions, and confirm any unique constraints or foreign keys are properly handled."},{"function":"dbd_save","message_template":"no SessionDBDinsertlabel has been specified","reason":"Configuration is missing the SessionDBDInsertLabel directive which specifies the prepared statement for inserting new sessions into the database.","resolution":"Add a SessionDBDInsertLabel directive to your configuration pointing to a prepared SQL statement that inserts session data into your database."},{"function":"dbd_save","message_template":"query execution error inserting session '%s' in database with '%s': %s","reason":"An error occurred when executing the SQL query to insert a new session. This could be due to database constraints, permissions, or SQL syntax errors.","resolution":"Check the database error message for specific details. Verify the SQL statement syntax, ensure the database user has proper insert permissions, and confirm any unique constraints or foreign keys are properly handled."},{"function":"dbd_save","message_template":"the session insert query did not cause any rows to be added to the database for session '%s', session not inserted","reason":"The insert query executed without errors but no rows were actually inserted into the database. This could be due to database constraints or an issue with the SQL query.","resolution":"Check your SQL statement to ensure it's properly formatted for inserts. Verify any WHERE clauses aren't too restrictive. Check for unique constraints that might be preventing insertion."},{"function":"dbd_remove","message_template":"no SessionDBDdeletelabel has been specified","reason":"Configuration is missing the SessionDBDDeleteLabel directive which specifies the prepared statement for deleting sessions from the database.","resolution":"Add a SessionDBDDeleteLabel directive to your configuration pointing to a prepared SQL statement that deletes session data from your database."},{"function":"dbd_remove","message_template":"query execution error removing session '%s' from database","reason":"An error occurred when executing the SQL query to remove a session. This could be due to database constraints, permissions, or SQL syntax errors.","resolution":"Check the database error message for specific details. Verify the SQL statement syntax, ensure the database user has proper delete permissions, and confirm any foreign key constraints are properly handled."},{"function":"session_dbd_save","message_template":"peruser sessions can only be saved if a user is logged in, session not saved: %s","reason":"When using per-user sessions (SessionDBDPerUser), the module tried to save a session but no user was logged in. Per-user sessions require authentication.","resolution":"Ensure users are properly authenticated before trying to use per-user sessions. Configure appropriate authentication modules and ensure they're running before session management. Or, switch to anonymous sessions if user authentication isn't always available."},{"function":"session_dbd_load","message_template":"Cache-Control: no-cache, private","reason":"This is an HTTP header being set to prevent caching of pages with active sessions for security reasons. It's not an error but an informational message about header manipulation.","resolution":"Information log, no resolution required. This is expected behavior when working with session data to ensure sensitive session information isn't cached."},{"function":"session_dbd_save","message_template":"Cache-Control: no-cache, private","reason":"This is an HTTP header being set to prevent caching of pages with active sessions for security reasons. It's not an error but an informational message about header manipulation.","resolution":"Information log, no resolution required. This is expected behavior when working with session data to ensure sensitive session information isn't cached."}],"project":"apache\/httpd"}