{"project":"sendmail","module":"mailstats.c","summary":"The mailstats utility reads and displays statistics from the sendmail mail transfer agent, providing information about message counts, bytes transferred, and rejection counts per mailer. It parses the sendmail configuration file to identify mailers and locate the statistics file, then outputs formatted statistics data.","logs":[{"function":"main","message_template":"usage: mailstats [-C cffile] [-c] [-P] [-f stfile] [-o] [-p]\n","reason":"Displays usage information when invalid command-line arguments are provided","resolution":"Check the command-line parameters and use the supported options as described in the usage message"},{"function":"main","message_template":"mailstats: ","reason":"Indicates an error opening the specified configuration file, followed by the system error message","resolution":"Verify that the configuration file exists and has appropriate permissions. The default file is normally \/etc\/mail\/sendmail.cf"},{"function":"main","message_template":"StatusFile filename too long: %.30s...\n","reason":"The StatusFile path in the configuration file exceeds the maximum allowed length","resolution":"Edit the sendmail configuration file and use a shorter path for the StatusFile option"},{"function":"main","message_template":"Too many mailers defined, %d max.\n","reason":"The configuration file defines more mailers than the program can handle (MAXMAILERS)","resolution":"Reduce the number of mailers defined in the configuration file or recompile with a larger MAXMAILERS value"},{"function":"main","message_template":"mailstats: no statistics file located\n","reason":"No statistics file was found in the configuration (StatusFile option)","resolution":"Ensure the sendmail configuration file includes a valid StatusFile option or specify a statistics file with the -f option"},{"function":"main","message_template":"mailstats: incorrect magic number in %s\n","reason":"The statistics file header doesn't contain the expected magic number, indicating it's not a valid statistics file","resolution":"Check if the file has been corrupted or is not a sendmail statistics file. The file may need to be recreated by sendmail"},{"function":"main","message_template":"mailstats version (%d) incompatible with %s version (%d)\n","reason":"The version of the statistics file format doesn't match the version expected by the mailstats program","resolution":"Ensure you're using compatible versions of sendmail and mailstats. You may need to upgrade or downgrade one of them"},{"function":"main","message_template":"mailstats: file size changed.\n","reason":"The size of the statistics file doesn't match what's expected, indicating a format mismatch or corruption","resolution":"The statistics file may be corrupted or was created by an incompatible version of sendmail. You may need to reset statistics by truncating the file"},{"function":"main","message_template":"Statistics from %s","reason":"Displays the timestamp of when statistics collection began","resolution":"Informational message, no resolution required"},{"function":"main","message_template":" M   msgsfr  bytes_from   msgsto    bytes_to  msgsrej msgsdis msgsqur  Mailer","reason":"Column headers for the statistics table in human-readable mode","resolution":"Informational message, no resolution required"},{"function":"main","message_template":"%ld %ld\n","reason":"Outputs the start time and current time in program mode (with -P or -p option)","resolution":"Informational message, no resolution required"}]}