{"module":"mpm_event.c","summary":"The Event MPM is an Apache module that provides an event-driven approach to handling connections. It addresses the 'keep alive problem' in HTTP by using a dedicated thread to handle both listening sockets and keep-alive connections, resulting in better resource utilization compared to traditional worker MPMs.","logs":[{"function":"enable_listensocks","message_template":"Accepting new connections again: %u active conns (%u lingering\/%u clogged\/%u suspended), %u idle workers","reason":"A log message when the server starts accepting connections again after previously disabling accept() due to load","resolution":"This is an informational message. If you see it frequently, consider increasing MaxRequestWorkers or other capacity-related settings."},{"function":"close_socket_nonblocking","message_template":"error closing socket","reason":"Failed to close a socket cleanly, which could indicate networking problems or a resource leak","resolution":"Check system resources, network stability, and consider inspecting network-related kernel parameters."},{"function":"wakeup_listener","message_template":"wake up listener%s","reason":"The MPM is sending a signal to wake up the listener thread, often during shutdown or restart","resolution":"Informational message, no resolution required."},{"function":"process_socket","message_template":"process_socket: connection aborted","reason":"A client connection was aborted during processing","resolution":"Usually happens when clients disconnect unexpectedly. If you see many of these, check client-side issues or network problems."},{"function":"process_socket","message_template":"process_socket: connection processing returned %i (%sstate %i): closing","reason":"A connection is being closed due to an error or unexpected state","resolution":"If error codes are non-zero, investigate module-specific issues. Unexpected states might indicate module incompatibilities or bugs."},{"function":"process_socket","message_template":"process_socket: apr_pollset_add failure in CONN_STATE_ASYNC_WAITIO","reason":"Failed to add a socket to the pollset for async wait I\/O operations","resolution":"May indicate system resource limits reached. Check file descriptor limits and system resources."},{"function":"process_socket","message_template":"process_socket: apr_pollset_add failure in CONN_STATE_WRITE_COMPLETION","reason":"Failed to add a socket to the pollset while waiting for write completion","resolution":"Check system resources, especially file descriptor limits, and consider increasing system limits."},{"function":"process_socket","message_template":"process_socket: apr_pollset_add failure for keep alive","reason":"Failed to add a socket to the pollset while in keep-alive state","resolution":"Check for fd limits being reached. May require increasing system file descriptor limits."},{"function":"event_resume_suspended","message_template":"event_resume_suspended: suspended_baton is NULL","reason":"Attempted to resume a suspended connection but the suspended_baton is NULL","resolution":"This is likely a programming error within Apache or a module. Report it as a bug if persistent."},{"function":"event_resume_suspended","message_template":"event_resume_suspended: Thread isn't suspended","reason":"Attempted to resume a thread that isn't actually in suspended state","resolution":"This is likely a programming error within Apache or a module. Report it as a bug if persistent."},{"function":"check_infinite_requests","message_template":"Stopping process due to MaxConnectionsPerChild","reason":"A child process is stopping because it has served the maximum number of connections as configured by MaxConnectionsPerChild","resolution":"Informational message, no resolution required unless child processes are cycling too rapidly."},{"function":"close_listeners","message_template":"closing listeners (connection_count=%u)","reason":"Closing listener sockets, typically during a shutdown or restart sequence","resolution":"Informational message, no resolution required."},{"function":"push2worker","message_template":"push2worker: ap_queue_push_socket failed","reason":"Failed to add a socket connection to the worker queue for processing","resolution":"If persistent, may indicate problems with worker thread management or resource shortages."},{"function":"get_worker","message_template":"ap_queue_info_wait_for_idler failed. Attempting to shutdown process gracefully","reason":"Failed while waiting for an idle worker thread, indicating a serious resource or internal error","resolution":"Check for system resource exhaustion. May require increasing system limits or reducing server load."},{"function":"process_lingering_close","message_template":"lingering close from state %i","reason":"A connection is entering the lingering close state from a previous state","resolution":"Informational message, no resolution required."},{"function":"process_lingering_close","message_template":"process_lingering_close: apr_pollset_add failure","reason":"Failed to add a socket to the pollset during lingering close processing","resolution":"Likely indicates system resource limits reached. Check file descriptor limits."},{"function":"event_loop","message_template":"apr_pollset_remove failed","reason":"Failed to remove a socket from the pollset, potentially causing resource leaks","resolution":"May indicate a bug in Apache or corrupted internal state. If repeated, restart the server."},{"function":"event_loop","message_template":"event_loop: unexpected state %d","reason":"A connection is in an unexpected state in the event loop, indicating internal state corruption","resolution":"This suggests a bug in Apache or a module. If persistent, try disabling optional modules to isolate the cause."},{"function":"event_loop","message_template":"All workers busy, not accepting new conns in this process","reason":"All worker threads are busy, so the server is temporarily not accepting new connections","resolution":"If persistent, consider increasing ThreadsPerChild, MaxRequestWorkers, or reducing the time connections are kept alive."},{"function":"event_loop","message_template":"Too many open connections (%u, idlers %u), not accepting new conns in this process","reason":"The process has reached its connection limit, likely due to MaxRequestWorkers or similar constraints","resolution":"Consider increasing MaxRequestWorkers or ThreadsPerChild if server resources allow."},{"function":"ap_queue_create","message_template":"Failed to create transaction pool","reason":"Failed to create a memory pool for a new transaction, indicating memory shortage","resolution":"Check system memory resources and consider reducing MaxRequestWorkers or ThreadsPerChild."},{"function":"event_loop","message_template":"accept() on client socket failed","reason":"Failed to accept a new connection on a listener socket","resolution":"May be temporary under high load. If persistent, check for networking issues or file descriptor limits."},{"function":"event_loop","message_template":"apr_pollset_poll failed. Attempting to shutdown process gracefully","reason":"The pollset polling operation failed, indicating a serious system-level issue","resolution":"Check system resources and logs for more details. May require server restart or system investigation."},{"function":"create_listener_thread","message_template":"ap_thread_create: unable to create listener thread","reason":"Failed to create the critical listener thread, making the server unable to accept connections","resolution":"Check system resources, particularly threading limits. May require reducing the number of threads or increasing system limits."},{"function":"start_threads","message_template":"ap_thread_create: unable to create worker thread","reason":"Failed to create a worker thread, reducing server capacity","resolution":"Check system resources, particularly threading and memory limits. May require reducing ThreadsPerChild."},{"function":"start_threads","message_template":"start_threads: Using %s (%swakeable)","reason":"Informational message showing which polling method is being used and whether it supports wakeable poll","resolution":"Informational message, no resolution required. Wakeable poll is preferable for best performance."},{"function":"child_main","message_template":"child %d isn't taking over slots very quickly (%d of %d)","reason":"A child process is slow to initialize and take over its expected slots","resolution":"May indicate system resource constraints or high load. Check system resources if persistent."},{"function":"listener_thread","message_template":"listener has not stopped accepting yet (%d iter)","reason":"During shutdown, the listener thread hasn't stopped accepting connections after multiple attempts","resolution":"If server hangs during shutdown, may require a less graceful shutdown method or investigation of stuck threads."},{"function":"listener_thread","message_template":"the listener thread didn't stop accepting","reason":"During shutdown, the listener thread failed to stop accepting connections","resolution":"May require manual intervention if the server cannot shut down cleanly. Check for stuck connections or system resource issues."},{"function":"listener_thread","message_template":"apr_thread_join: unable to join listener thread","reason":"Failed to join (wait for termination of) the listener thread during shutdown","resolution":"May indicate threading issues in the OS. If persistent during shutdowns, may require server or system investigation."},{"function":"listener_thread","message_template":"apr_thread_join: unable to join worker thread %d","reason":"Failed to join a worker thread during shutdown","resolution":"May indicate threading issues or a worker thread hang. Check for blocked operations in modules if persistent."},{"function":"listener_thread","message_template":"apr_thread_join: unable to join the start thread","reason":"Failed to join the thread that starts other threads during shutdown","resolution":"Indicates threading issues. If persistent during shutdowns, check system threading implementation."},{"function":"main_loop","message_template":"Child %d stopped: pid %d, gen %d, active %d\/%d, total %d\/%d\/%d, quiescing %d","reason":"A child process has stopped, with details about its state","resolution":"Informational message, no resolution required unless child processes are stopping unexpectedly."},{"function":"main_loop","message_template":"Child %d started: pid %d, gen %d, active %d\/%d, total %d\/%d\/%d","reason":"A child process has started, with details about server state","resolution":"Informational message, no resolution required."},{"function":"child_main","message_template":"processor unbind failed","reason":"On AIX, failed to unbind a child process from a processor","resolution":"Platform-specific issue on AIX. Check system documentation for processor binding permissions and settings."},{"function":"event_note_child_stopped","message_template":"Child %d quiescing: pid %d, gen %d, active %d\/%d, total %d\/%d\/%d","reason":"A child process is in the quiescing (graceful shutdown) state","resolution":"Informational message, no resolution required."},{"function":"perform_idle_server_maintenance","message_template":"A resource shortage or other unrecoverable failure was encountered before any child process initialized successfully... httpd is exiting!","reason":"No child processes could initialize successfully, indicating a serious resource shortage or configuration problem","resolution":"Check system resources, Apache configuration, and system limits. May require increasing resources or adjusting configuration."},{"function":"perform_idle_server_maintenance","message_template":"%shutting down one child: active %d\/%d, total %d\/%d\/%d, idle threads %d, max workers %d","reason":"The server is shutting down a child process as part of idle server maintenance","resolution":"Informational message, no resolution required unless child processes are cycling too rapidly."},{"function":"perform_idle_server_maintenance","message_template":"server reached MaxRequestWorkers setting, consider raising the MaxRequestWorkers setting","reason":"The server has reached the MaxRequestWorkers limit, potentially causing client requests to be queued or rejected","resolution":"If performance is affected, consider increasing MaxRequestWorkers if system resources allow, or add more server instances."},{"function":"perform_idle_server_maintenance","message_template":"server is within MinSpareThreads of MaxRequestWorkers, consider raising the MaxRequestWorkers setting","reason":"The server is approaching its maximum capacity and may soon reject connections","resolution":"Increase MaxRequestWorkers if system resources allow, or add more server instances to handle the load."},{"function":"perform_idle_server_maintenance","message_template":"scoreboard is full, not at MaxRequestWorkers. Increase ServerLimit.","reason":"The scoreboard (tracking structure for server processes) is full, preventing new processes despite capacity availability","resolution":"Increase ServerLimit to allow more processes, but ensure system resources can handle the increase."},{"function":"perform_idle_server_maintenance","message_template":"server is at active daemons limit, spawning of %d children cancelled: active %d\/%d, total %d\/%d\/%d, rate %d","reason":"The server has reached the maximum number of active child processes","resolution":"Consider increasing ServerLimit and MaxRequestWorkers if system resources allow."},{"function":"perform_idle_server_maintenance","message_template":"server seems busy, (you may need to increase StartServers, ThreadsPerChild or Min\/MaxSpareThreads), spawning %d children, there are around %d idle threads, %d active children, and %d children that are shutting down","reason":"The server is under high load and spawning additional child processes to handle the load","resolution":"Consider adjusting StartServers, ThreadsPerChild, or spare threads settings for more optimal performance under your specific load pattern."},{"function":"server_main_loop","message_template":"Ignoring fatal error in child of previous generation (pid %ld).","reason":"A child process from a previous server generation has encountered a fatal error, but it's being ignored","resolution":"Usually occurs during restarts. If persistent across multiple restarts, investigate the specific child process issues."},{"function":"server_main_loop","message_template":"long lost child came home! (pid %ld)","reason":"A child process that wasn't properly tracked has terminated","resolution":"This may indicate a scoreboard corruption or tracking issue. If frequent, it may suggest a bug in Apache or a module."},{"function":"server_main_loop","message_template":"children are killed successively!","reason":"Multiple child processes are being terminated in succession, potentially indicating a systemic issue","resolution":"Check for resource problems or buggy modules that might be causing child processes to fail repeatedly."},{"function":"make_child","message_template":"fork: Unable to fork new process","reason":"Failed to create a new child process, likely due to system resource limitations","resolution":"Check system resources, particularly maximum process limits and memory. May require reducing MaxRequestWorkers or adding more system resources."},{"function":"event_run","message_template":"could not duplicate listeners","reason":"Failed to duplicate listener sockets for child processes","resolution":"Check file descriptor limits and network socket availability. May indicate resource exhaustion."},{"function":"event_run","message_template":"could not open pipe-of-death","reason":"Failed to create the communication pipe used for signaling between parent and child processes","resolution":"Check file descriptor limits and system resources. May indicate resource exhaustion."},{"function":"event_run","message_template":"%s configured -- resuming normal operations","reason":"The server has completed configuration and is resuming normal operations","resolution":"Informational message, no resolution required."},{"function":"event_run","message_template":"Server built: %s","reason":"Shows when the server binary was built, useful for version information","resolution":"Informational message, no resolution required."},{"function":"event_run","message_template":"caught SIGTERM, shutting down","reason":"The server has received a SIGTERM signal and is shutting down","resolution":"Informational message, no resolution required unless the shutdown was unexpected."},{"function":"event_run","message_template":"caught %s, shutting down gracefully","reason":"The server has received a signal requesting graceful shutdown","resolution":"Informational message, no resolution required unless the shutdown was unexpected."},{"function":"event_run","message_template":"%s received. Doing graceful restart","reason":"The server has received a signal requesting a graceful restart","resolution":"Informational message, no resolution required unless the restart was unexpected."},{"function":"event_run","message_template":"SIGHUP received. Attempting to restart","reason":"The server has received a SIGHUP signal and is attempting to restart","resolution":"Informational message, no resolution required unless the restart was unexpected."},{"function":"event_run","message_template":"no listening sockets available, shutting down","reason":"There are no listening sockets available, making the server unable to function","resolution":"Check port availability, permissions, and whether another process is using the configured ports."},{"function":"event_pre_config","message_template":"atomics not working as expected - add32 of negative number","reason":"Atomic operations are not working correctly, which can affect thread synchronization","resolution":"This indicates a problem with the underlying system or architecture. Apache may not function correctly in this environment."},{"function":"event_pre_config","message_template":"Couldn't create a Thread Safe Pollset. Is it supported on your platform?","reason":"Failed to create a thread-safe pollset, which is required for the event MPM","resolution":"Check if the platform supports thread-safe poll operations. You may need to use a different MPM on this platform."},{"function":"event_pre_config","message_template":"apr_proc_detach failed","reason":"Failed to detach the process when running as a daemon","resolution":"Check system resources and permissions. May indicate issues with the process control or privilege limitations."},{"function":"event_check_config","message_template":"WARNING: ServerLimit of %d exceeds compile-time limit of %d servers, decreasing to %d.","reason":"The configured ServerLimit exceeds the compile-time maximum and is being automatically reduced","resolution":"If you need more server processes, recompile Apache with a higher MAX_SERVER_LIMIT."},{"function":"event_check_config","message_template":"WARNING: ServerLimit of %d not allowed, increasing to 1.","reason":"The configured ServerLimit is less than 1, which is not allowed, so it's being increased","resolution":"Fix the configuration to specify a valid ServerLimit (minimum 1)."},{"function":"event_check_config","message_template":"changing ServerLimit to %d from original value of %d not allowed during restart","reason":"An attempt was made to change ServerLimit during a restart, which is not allowed","resolution":"To change ServerLimit, a full server stop and start is required, not just a restart."},{"function":"event_check_config","message_template":"WARNING: ThreadLimit of %d exceeds compile-time limit of %d threads, decreasing to %d.","reason":"The configured ThreadLimit exceeds the compile-time maximum and is being automatically reduced","resolution":"If you need more threads per process, recompile Apache with a higher MAX_THREAD_LIMIT."},{"function":"event_check_config","message_template":"WARNING: ThreadLimit of %d not allowed, increasing to 1.","reason":"The configured ThreadLimit is less than 1, which is not allowed, so it's being increased","resolution":"Fix the configuration to specify a valid ThreadLimit (minimum 1)."},{"function":"event_check_config","message_template":"changing ThreadLimit to %d from original value of %d not allowed during restart","reason":"An attempt was made to change ThreadLimit during a restart, which is not allowed","resolution":"To change ThreadLimit, a full server stop and start is required, not just a restart."},{"function":"event_check_config","message_template":"WARNING: ThreadsPerChild of %d exceeds ThreadLimit of %d threads, decreasing to %d. To increase, please see the ThreadLimit directive.","reason":"ThreadsPerChild exceeds the configured ThreadLimit and is being automatically reduced","resolution":"Increase ThreadLimit in your configuration if you need more threads per child."},{"function":"event_check_config","message_template":"WARNING: ThreadsPerChild of %d not allowed, increasing to 1.","reason":"The configured ThreadsPerChild is less than 1, which is not allowed, so it's being increased","resolution":"Fix the configuration to specify a valid ThreadsPerChild (minimum 1)."},{"function":"event_check_config","message_template":"WARNING: MaxRequestWorkers of %d is less than ThreadsPerChild of %d, increasing to %d. MaxRequestWorkers must be at least as large as the number of threads in a single server.","reason":"MaxRequestWorkers is less than ThreadsPerChild, which is not allowed, so it's being increased","resolution":"Fix the configuration to ensure MaxRequestWorkers is at least equal to ThreadsPerChild."},{"function":"event_check_config","message_template":"WARNING: MaxRequestWorkers of %d is not an integer multiple of ThreadsPerChild of %d, decreasing to nearest multiple %d, for a maximum of %d servers.","reason":"MaxRequestWorkers is not an integer multiple of ThreadsPerChild and is being adjusted","resolution":"For cleaner configuration, set MaxRequestWorkers to an integer multiple of ThreadsPerChild."},{"function":"event_check_config","message_template":"WARNING: MaxRequestWorkers of %d would require %d servers and would exceed ServerLimit of %d, decreasing to %d. To increase, please see the ServerLimit directive.","reason":"MaxRequestWorkers would require more server processes than allowed by ServerLimit and is being adjusted","resolution":"If you need more workers, increase ServerLimit in your configuration."},{"function":"event_check_config","message_template":"WARNING: StartServers of %d not allowed, increasing to 1.","reason":"The configured StartServers is less than 1, which is not allowed, so it's being increased","resolution":"Fix the configuration to specify a valid StartServers (minimum 1)."},{"function":"event_check_config","message_template":"WARNING: MinSpareThreads of %d not allowed, increasing to 1 to avoid almost certain server failure. Please read the documentation.","reason":"The configured MinSpareThreads is less than 1, which can cause server problems, so it's being increased","resolution":"Fix the configuration to specify a valid MinSpareThreads (minimum 1)."},{"function":"set_max_workers","message_template":"MaxClients is deprecated, use MaxRequestWorkers instead.","reason":"The MaxClients directive is deprecated in favor of MaxRequestWorkers","resolution":"Update your configuration to use MaxRequestWorkers instead of MaxClients."},{"function":"set_worker_factor","message_template":"error parsing value","reason":"Error parsing the AsyncRequestWorkerFactor directive value","resolution":"Fix the configuration to provide a valid numeric value for AsyncRequestWorkerFactor."},{"function":"set_worker_factor","message_template":"AsyncRequestWorkerFactor argument must be a positive number","reason":"The AsyncRequestWorkerFactor value must be positive, but a non-positive value was provided","resolution":"Fix the configuration to provide a positive value for AsyncRequestWorkerFactor."},{"function":"child_main","message_template":"Couldn't initialize child main thread","reason":"Failed to initialize the main thread in a child process","resolution":"Check system resources, particularly threading resources and limits. May indicate a fundamental system issue."},{"function":"child_main","message_template":"Couldn't initialize signal thread","reason":"Failed to initialize the signal handling thread","resolution":"Check system threading resources and capabilities. May indicate fundamental system or resource issues."},{"function":"child_main","message_template":"WARNING: ThreadStackSize of %ld is inappropriate, using default","reason":"The configured ThreadStackSize is inappropriate and the default is being used instead","resolution":"Adjust ThreadStackSize to a more appropriate value if thread stack issues occur."},{"function":"child_main","message_template":"%s termination received, joining workers","reason":"A termination signal has been received and the server is joining (waiting for) worker threads","resolution":"Informational message, no resolution required unless shutdown is problematic."},{"function":"child_main","message_template":"%s termination, workers joined, exiting","reason":"Worker threads have been successfully joined during termination","resolution":"Informational message, no resolution required."},{"function":"make_child","message_template":"BUG: Scoreboard slot %d should be empty but is in use by pid %ld","reason":"A scoreboard slot expected to be empty is already in use, indicating a scoreboard corruption","resolution":"This indicates a bug in Apache or a module. If persistent, try restarting the server or report the issue."}],"project":"apache\/httpd"}