{"module":"lbmethod_heartbeat_module.c","summary":"A load balancing method module for Apache that makes decisions based on server heartbeat data, indicating server health and load. It can read this data from either a file or shared memory (via mod_heartmonitor) and selects the least busy server for handling requests.","logs":[{"function":"argstr_to_table","message_template":"Found query arg: %s = %s","reason":"Debug information to show query arguments parsed from the heartbeat data. This is commented out in the code but could be useful for troubleshooting.","resolution":"This is a debug log, no resolution required. If enabled, it would help diagnose how heartbeat data is being interpreted."},{"function":"find_best_hb","message_template":"lb_heartbeat: Unable to read heartbeats at '%s'","reason":"Logs an error when the module fails to read heartbeat data from the configured path. This could happen due to file permissions, misconfigurations, or the file not existing.","resolution":"Check that the file at the configured HeartbeatStorage path exists and is readable by the Apache process. Verify path configuration or switch to using shared memory via mod_heartmonitor."},{"function":"find_best_hb","message_template":"lb_heartbeat: No server for worker %s","reason":"Indicates that the module couldn't find heartbeat data for a specific worker. This would happen when a server configured in the balancer doesn't have corresponding heartbeat information.","resolution":"Ensure all servers in the balancer are correctly sending heartbeat information. Check server hostnames match between balancer configuration and heartbeat data."},{"function":"lb_hb_init","message_template":"Failed to lookup provider 'shm' for '%s'. Maybe you need to load mod_slotmem_shm?","reason":"The module couldn't access the shared memory provider needed to read heartbeat data from mod_heartmonitor. Likely due to missing mod_slotmem_shm module.","resolution":"Load mod_slotmem_shm if you want to use shared memory for heartbeat data. If not, ensure the HeartbeatStorage path is correctly configured for file-based heartbeat data."},{"function":"lb_hb_init","message_template":"No slotmem from mod_heartmonitor","reason":"The module couldn't attach to shared memory from mod_heartmonitor. This happens when mod_heartmonitor isn't loaded or hasn't created the shared memory segment.","resolution":"Ensure mod_heartmonitor is loaded and properly configured if you want to use shared memory for heartbeat data. Otherwise, the module will fall back to file-based heartbeat data."},{"function":"lb_hb_init","message_template":"Using slotmem from mod_heartmonitor","reason":"Confirms that the module successfully attached to shared memory from mod_heartmonitor and will use it for heartbeat data.","resolution":"This is an informational message indicating successful configuration, no resolution required."}],"project":"apache\/httpd"}