{"module":"mod_isapi.c","summary":"This Apache module implements the Internet Server Application (ISA) architecture, supporting ISAPI extensions (dynamically loaded Windows DLLs) similar to IIS. It provides a complete implementation of the ISAPI 2.0 specification with Microsoft extensions through IIS 5.0, with a focus on compatibility and error handling for ISAPI applications.","logs":[{"function":"isapi_cmd_cachefile","message_template":"invalid module path, skipping %s","reason":"Logs a warning when an ISAPI module path specified in ISAPICacheFile is invalid or cannot be resolved relative to the server root.","resolution":"Check the path specified in ISAPICacheFile and ensure it is valid and accessible by the server."},{"function":"isapi_cmd_cachefile","message_template":"unable to stat, skipping %s","reason":"Logs a warning when the server cannot get file information for an ISAPI module specified in ISAPICacheFile.","resolution":"Check file permissions and ensure the file exists at the specified location."},{"function":"isapi_cmd_cachefile","message_template":"not a regular file, skipping %s","reason":"Logs a warning when an ISAPI module specified in ISAPICacheFile is not a regular file (e.g., it's a directory).","resolution":"Ensure the path points to a valid ISAPI DLL file, not a directory or special file."},{"function":"isapi_cmd_cachefile","message_template":"unable to cache, skipping %s","reason":"Logs a warning when the server cannot cache an ISAPI module specified in ISAPICacheFile, typically due to loading failures.","resolution":"Check if the file is a valid ISAPI DLL and has the required exported functions."},{"function":"isapi_load","message_template":"failed to load %s","reason":"Logs an error when the server fails to load an ISAPI DLL, typically due to DLL loading issues or missing dependencies.","resolution":"Check if the DLL is compatible with the server architecture and that all its dependencies are available."},{"function":"isapi_load","message_template":"missing GetExtensionVersion() in %s","reason":"Logs an error when an ISAPI DLL doesn't export the required GetExtensionVersion function.","resolution":"Ensure the DLL is a valid ISAPI extension with all required exported functions."},{"function":"isapi_load","message_template":"missing HttpExtensionProc() in %s","reason":"Logs an error when an ISAPI DLL doesn't export the required HttpExtensionProc function.","resolution":"Ensure the DLL is a valid ISAPI extension with all required exported functions."},{"function":"isapi_load","message_template":"failed call to GetExtensionVersion() in %s","reason":"Logs an error when calling the GetExtensionVersion function in an ISAPI DLL fails.","resolution":"Check if the ISAPI extension is properly implemented and compatible with the server."},{"function":"send_response_header","message_template":"Could not determine HTTP response code; using %d","reason":"Logs a debug message when the module cannot determine the HTTP status code from the ISAPI extension's response.","resolution":"This is typically an informational message. The extension should properly set status codes in its response."},{"function":"regfnWriteClient","message_template":"WriteClient ap_pass_brigade failed: %s","reason":"Logs a debug message when the server fails to send data to the client during a WriteClient call from an ISAPI extension.","resolution":"Check network connectivity and client connection state. May indicate client disconnected prematurely."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction HSE_REQ_SEND_RESPONSE_HEADER ap_pass_brigade failed: %s","reason":"Logs a debug message when the server fails to send response headers to the client during an HSE_REQ_SEND_RESPONSE_HEADER call.","resolution":"Check network connectivity. May indicate client disconnected prematurely."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction HSE_REQ_DONE_WITH_SESSION is not supported: %s","reason":"Logs a warning when an ISAPI extension calls HSE_REQ_DONE_WITH_SESSION without the module having fake async support enabled.","resolution":"Enable ISAPIFakeAsync in the module configuration if the ISAPI extension requires this support."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction HSE_REQ_GET_SSPI_INFO is not supported: %s","reason":"Logs a warning when an ISAPI extension requests SSPI (Windows security) information which is not supported.","resolution":"This feature is not supported. The ISAPI extension may need to be modified or may not function correctly."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction HSE_REQ_IO_COMPLETION is not supported: %s","reason":"Logs a warning when an ISAPI extension tries to register an I\/O completion callback without fake async support enabled.","resolution":"Enable ISAPIFakeAsync in the module configuration if the ISAPI extension requires asynchronous I\/O support."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction HSE_REQ_TRANSMIT_FILE as HSE_IO_ASYNC is not supported: %s","reason":"Logs a warning when an ISAPI extension tries to use asynchronous file transmission without fake async support enabled.","resolution":"Enable ISAPIFakeAsync in the module configuration if the ISAPI extension requires asynchronous transmission support."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction HSE_REQ_TRANSMIT_FILE ap_pass_brigade failed: %s","reason":"Logs a debug message when the server fails to transmit a file to the client during an HSE_REQ_TRANSMIT_FILE call.","resolution":"Check network connectivity and client connection state. May indicate client disconnected prematurely."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction HSE_REQ_REFRESH_ISAPI_ACL is not supported: %s","reason":"Logs a warning when an ISAPI extension tries to refresh ACLs, which is not supported in this implementation.","resolution":"This feature is not supported. The ISAPI extension may need to be modified or may not function correctly."},{"function":"regfnServerSupportFunction","message_template":"asynchronous I\/O not supported: %s","reason":"Logs a warning when an ISAPI extension tries to use asynchronous I\/O without fake async support enabled.","resolution":"Enable ISAPIFakeAsync in the module configuration if the ISAPI extension requires asynchronous I\/O support."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction HSE_REQ_GET_IMPERSONATION_TOKEN is not supported: %s","reason":"Logs a warning when an ISAPI extension tries to get a Windows impersonation token, which is not supported.","resolution":"This Windows-specific security feature is not supported. The ISAPI extension may need modification."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction HSE_REQ_ABORTIVE_CLOSE is not supported: %s","reason":"Logs a warning when an ISAPI extension tries to perform an abortive close on the connection, which is not supported.","resolution":"This feature is not supported. The ISAPI extension may need to be modified or may not function correctly."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction HSE_REQ_GET_CERT_INFO_EX is not supported: %s","reason":"Logs a warning when an ISAPI extension tries to get extended certificate information, which is not supported.","resolution":"This SSL certificate feature is not supported. The ISAPI extension may need modification or may not work with SSL."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction HSE_REQ_SEND_RESPONSE_HEADER_EX ap_pass_brigade failed: %s","reason":"Logs a debug message when the server fails to send extended response headers to the client.","resolution":"Check network connectivity and client connection state. May indicate client disconnected prematurely."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction HSE_REQ_CLOSE_CONNECTION is not supported: %s","reason":"Logs a warning when an ISAPI extension tries to explicitly close the connection, which is not supported.","resolution":"This feature is not supported. The ISAPI extension may need to be modified."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction HSE_REQ_EXTENSION_TRIGGER is not supported: %s","reason":"Logs a warning when an ISAPI extension tries to use the extension trigger feature, which is not supported.","resolution":"This undocumented feature is not supported. The ISAPI extension may need to be modified."},{"function":"regfnServerSupportFunction","message_template":"ServerSupportFunction (%d) not supported: %s","reason":"Logs a warning when an ISAPI extension tries to use an unknown or unsupported server support function.","resolution":"The ISAPI extension is using features not implemented in this module. It may need modification."},{"function":"regfnServerSupportFunction","message_template":"%s: %s","reason":"Logs an informational message appended by the ISAPI extension using HSE_APPEND_LOG_PARAMETER.","resolution":"This is an informational message from the ISAPI extension itself. Check the extension documentation."},{"function":"isapi_handler","message_template":"Failed to create completion mutex","reason":"Logs a warning when the server fails to create a mutex for handling asynchronous ISAPI requests.","resolution":"This indicates a system resource issue. Check system memory and available resources."},{"function":"isapi_handler","message_template":"%s: %s","reason":"Logs an informational message set by the ISAPI extension in its lpszLogData field.","resolution":"This is an informational message from the ISAPI extension itself. Check the extension documentation."},{"function":"isapi_handler","message_template":"asynch I\/O result HSE_STATUS_PENDING from HttpExtensionProc() is not supported: %s","reason":"Logs a warning when an ISAPI extension returns HSE_STATUS_PENDING without fake async support enabled.","resolution":"Enable ISAPIFakeAsync in the module configuration if the ISAPI extension requires asynchronous support."},{"function":"isapi_handler","message_template":"HSE_STATUS_ERROR result from HttpExtensionProc(): %s","reason":"Logs a warning when an ISAPI extension returns HSE_STATUS_ERROR indicating a failure during processing.","resolution":"Check the ISAPI extension for errors. This typically indicates a problem within the extension itself."},{"function":"isapi_handler","message_template":"unrecognized result code %d from HttpExtensionProc(): %s","reason":"Logs a warning when an ISAPI extension returns an unknown or invalid status code.","resolution":"The ISAPI extension is returning an invalid status code. Check if it's compatible with the ISAPI specification."},{"function":"isapi_handler","message_template":"ap_pass_brigade failed to complete the response: %s","reason":"Logs a debug message when the server fails to send the final response to the client.","resolution":"Check network connectivity and client connection state. May indicate client disconnected prematurely."},{"function":"isapi_pre_config","message_template":"could not create the isapi cache pool","reason":"Logs an error when the server fails to create a memory pool for caching ISAPI modules during server startup.","resolution":"Check system memory and available resources. This is a critical startup error."},{"function":"isapi_pre_config","message_template":"Failed to create module cache","reason":"Logs an error when the server fails to create the hash table for caching ISAPI modules during startup.","resolution":"Check system memory and available resources. This is a critical startup error."},{"function":"isapi_pre_config","message_template":"Failed to create module cache lock","reason":"Logs an error when the server fails to create a mutex for thread-safe access to the ISAPI module cache.","resolution":"Check system resources. This might indicate a problem with thread synchronization primitives."}],"project":"apache\/httpd"}