{"project":"sendmail","module":"contrib\/bitdomain.c","summary":"A utility for processing BITNET 'internet.listing' files to create a mapping between BITNET node names and their internet domain equivalents. It validates domain names against DNS and produces output suitable for the makemap utility, which creates a database used by sendmail's FEATURE(bitdomain) configuration.","logs":[{"function":"main","message_template":"usage: %s [-o outfile] [internet.listing]\n","reason":"Displayed when the user provides invalid command-line arguments or options, indicating proper program usage.","resolution":"Ensure the command is run with correct syntax following the usage pattern shown. Provide the correct path to internet.listing file if needed."},{"function":"readfile","message_template":"%-8s: no domain name in input file\n","reason":"Displayed when a node entry is found in the input file but no corresponding domain name is provided on the same line.","resolution":"Verify the format of the internet.listing file. Each line should contain a node name followed by a domain name. The file may be corrupted or in an incorrect format."},{"function":"readfile","message_template":"%-8s no domain name in input file\n","reason":"Similar to the previous message, but occurs when whitespace is found after the node name but no domain name follows.","resolution":"Check the format of the internet.listing file for incomplete entries. Each node should be paired with a domain name."},{"function":"entry","message_template":"%-8s %s %s\n","reason":"Displayed when DNS validation fails for a domain, with the third parameter indicating the specific DNS error that occurred.","resolution":"Depending on the error, check DNS configuration, ensure nameservers are responding, or verify that the domain exists. For temporary failures, retrying later may resolve the issue."},{"function":"remember","message_template":"%-8s %s\n","reason":"Outputs a successful mapping between a BITNET node and its corresponding internet domain to stdout.","resolution":"Informational output, no resolution required. This is the expected output that will be fed to makemap."},{"function":"remember","message_template":"Out of memory\n","reason":"Displayed when memory allocation fails during the processing of domain mappings.","resolution":"The system may be low on available memory. Try closing other applications, increasing swap space, or running the program on a system with more available memory."}]}