{"module":"cgi.c","summary":"This module handles the execution of CGI scripts and Server-Side Includes (SSI) exec directives in Apache HTTP Server. It manages script input\/output, captures stderr, handles timeouts, and processes CGI protocol headers.","logs":[{"function":"log_scripterror","message_template":"%sstderr from %s: %s","reason":"Logs stderr output from a script with an optional log number prefix, filename, and the error message itself","resolution":"Check the script for errors in its code or configuration. Look for syntax errors or runtime issues in the script being executed."},{"function":"cgi_handle_exec","message_template":"missing argument for exec element in %s","reason":"SSI exec directive was used without required arguments in the specified file","resolution":"Modify the SSI directive to include the required cmd= or cgi= parameter. Example: <!--#exec cmd=\"command\" --> or <!--#exec cgi=\"script.cgi\" -->"},{"function":"cgi_handle_exec","message_template":"exec used but not allowed in %s","reason":"SSI exec directive was used but execution is disabled by server configuration","resolution":"Either enable script execution by setting 'Options +ExecCGI' for the directory or modify the SSI directive to use an allowed feature instead"},{"function":"cgi_handle_exec","message_template":"execution failure for parameter \"%s\" to tag exec in file %s","reason":"The command specified in cmd= parameter of an SSI exec directive failed to execute","resolution":"Verify the command exists, is executable by the web server user, and does not contain syntax errors. Check file permissions and paths."},{"function":"cgi_handle_exec","message_template":"invalid CGI ref \"%s\" in %s","reason":"The CGI script referenced in the cgi= parameter of an SSI exec directive could not be found or executed","resolution":"Ensure the CGI script exists at the specified path, has correct permissions, and is executable by the web server user"},{"function":"cgi_handle_exec","message_template":"unknown parameter \"%s\" to tag exec in %s","reason":"An SSI exec directive used an unknown parameter instead of cmd= or cgi=","resolution":"Modify the SSI directive to use only supported parameters: cmd= or cgi="},{"function":"cgi_bucket_create","message_template":"apr_pollset_create(); check system or user limits","reason":"System couldn't create a pollset to monitor CGI script output, likely due to system resource limits","resolution":"Check system limits like max file descriptors (ulimit -n) and increase if necessary. May also indicate memory exhaustion or a need to reduce server load."},{"function":"cgi_bucket_create","message_template":"apr_pollset_add(); check system or user limits","reason":"Failed to add a file descriptor to the pollset, likely due to system resource limits","resolution":"Check system limits such as max file descriptors and increase if necessary. May require server configuration changes or system tuning."},{"function":"cgi_bucket_read","message_template":"Timeout waiting for output from CGI script %s","reason":"The CGI script did not produce output within the configured timeout period","resolution":"Increase the timeout value in the server configuration, or optimize the script to respond faster. Check if the script is stuck in an infinite loop or waiting for external resources."},{"function":"cgi_bucket_read","message_template":"poll failed waiting for CGI child","reason":"The poll system call to monitor CGI script output failed unexpectedly","resolution":"Check system resources and server logs for more details. May indicate system instability, resource exhaustion, or a need to restart the server."},{"function":"cgi_handle_response","message_template":"script sent Transfer-Encoding","reason":"The CGI script attempted to set a Transfer-Encoding header, which is not allowed","resolution":"Modify the CGI script to avoid setting Transfer-Encoding headers directly. The server handles transfer encoding automatically."},{"function":"cgi_handle_request","message_template":"Error writing request body to script %s","reason":"Failed to write the HTTP request body to the CGI script's stdin, possibly because the script stopped reading input","resolution":"Check if the script properly reads stdin when handling POST\/PUT requests. Make sure the script doesn't exit prematurely before reading all input."}],"project":"apache\/httpd"}