{"module":"mod_cgi.c","summary":"This module implements the CGI (Common Gateway Interface) specification for Apache HTTP Server, allowing external programs to be executed by the server in response to HTTP requests. It handles script execution, input\/output management, and error reporting with configurable logging capabilities.","logs":[{"function":"set_scriptlog","message_template":"Invalid ScriptLog path %s","reason":"The path provided for the ScriptLog directive is invalid or cannot be resolved relative to the server root.","resolution":"Check the path specified in the ScriptLog directive and ensure it's valid and accessible by the Apache server process."},{"function":"set_script_timeout","message_template":"CGIScriptTimeout has wrong format","reason":"The format of the timeout value specified for CGIScriptTimeout is incorrect or cannot be parsed.","resolution":"Ensure the CGIScriptTimeout value follows the expected format (a number followed by an optional 's' for seconds)."},{"function":"run_cgi_child","message_template":"couldn't set child process attributes: %s","reason":"The server failed to set necessary attributes for the CGI child process, such as I\/O pipes, directory, resource limits, or process type.","resolution":"Check server resources, permissions, and configuration. This may indicate system resource constraints or permission issues."},{"function":"run_cgi_child","message_template":"couldn't create child process: %d: %s","reason":"The server failed to create the CGI child process with the given attributes and configuration.","resolution":"Check system resources, permissions for the script file, and ensure the script is executable. May indicate system resource limits or permission problems."},{"function":"cgi_handler","message_template":"Options ExecCGI is off in this directory","reason":"A CGI script execution was attempted in a directory where the ExecCGI option is not enabled and the script is not in a ScriptAlias directory.","resolution":"Enable the ExecCGI option for the directory in the Apache configuration, or move the script to a ScriptAlias directory."},{"function":"cgi_handler","message_template":"attempt to include NPH CGI script","reason":"An attempt was made to include an NPH (No-Parse-Header) CGI script, which is not allowed. NPH scripts must be executed directly, not included.","resolution":"Use a regular CGI script instead of an NPH script for inclusion, or access the NPH script directly rather than including it."},{"function":"cgi_handler","message_template":"script not found or unable to stat","reason":"The requested CGI script could not be found on the filesystem or the server could not retrieve information about the file.","resolution":"Verify the script file exists at the specified path and is accessible (readable) by the Apache server process."},{"function":"cgi_handler","message_template":"attempt to invoke directory as script","reason":"An attempt was made to execute a directory as a CGI script, which is not allowed.","resolution":"Ensure the path points to an executable file, not a directory. Check the URL and server configuration."},{"function":"cgi_handler","message_template":"AcceptPathInfo off disallows user's path","reason":"The request contains path information after the script name, but the AcceptPathInfo directive is set to 'off' for this location.","resolution":"Either remove the path information from the request URL or set AcceptPathInfo to 'on' in the Apache configuration for this location."},{"function":"cgi_handler","message_template":"file permissions deny server execution","reason":"The file permissions of the CGI script do not allow the server to execute it.","resolution":"Set the appropriate execute permissions on the CGI script file (typically chmod +x filename for Unix systems)."},{"function":"cgi_handler","message_template":"don't know how to spawn child process: %s","reason":"The server could not determine how to execute the CGI script. This could be due to an unsupported script type or configuration issue.","resolution":"Verify the script is of a supported type and has the correct shebang line or file extension. Check if the necessary interpreter is installed and accessible."},{"function":"cgi_handler","message_template":"couldn't spawn child process: %s","reason":"The server failed to spawn the CGI process after determining how to execute it. This could be due to system resource limitations or other issues.","resolution":"Check system resources, script permissions, and ensure the script and its interpreter are functioning properly. May require system administrator intervention."},{"function":"cgi_handler","message_template":"Error reading request entity data","reason":"The server encountered an error while reading the request body data that should be passed to the CGI script.","resolution":"This may indicate client disconnection, network issues, or problems with request entity size. Check client connectivity and request size limits."},{"function":"include_cmd","message_template":"don't know how to spawn cmd child process: %s","reason":"The server could not determine how to execute a command for an SSI (Server Side Include) exec directive.","resolution":"Verify the command is valid and accessible on the server. Check the SSI exec directive syntax and server configuration."},{"function":"include_cmd","message_template":"couldn't spawn child process: %s","reason":"The server failed to spawn a child process for an SSI exec directive after determining how to execute it.","resolution":"Check system resources, command permissions, and ensure the command is functioning properly. May require system administrator intervention."},{"function":"log_script","message_template":"%%%% [%s] %s %s%s%s %s","reason":"This is a debug log entry for CGI script execution, logging the timestamp, HTTP method, URI, query string, and protocol.","resolution":"This is an informational log, no resolution required. Used for debugging CGI script issues."},{"function":"log_script","message_template":"%%%% %d %s","reason":"This is a debug log entry for CGI script execution, logging the HTTP status code and script filename.","resolution":"This is an informational log, no resolution required. Used for debugging CGI script issues."},{"function":"log_script","message_template":"%request","reason":"This is a debug log marker indicating the beginning of the request headers section in the CGI debug log.","resolution":"This is an informational log marker, no resolution required. Used for structuring CGI debug logs."},{"function":"log_script","message_template":"%response","reason":"This is a debug log marker indicating the beginning of the response headers section in the CGI debug log.","resolution":"This is an informational log marker, no resolution required. Used for structuring CGI debug logs."},{"function":"log_script","message_template":"%stdout","reason":"This is a debug log marker indicating the beginning of the script's standard output section in the CGI debug log.","resolution":"This is an informational log marker, no resolution required. Used for structuring CGI debug logs."},{"function":"log_script","message_template":"%stderr","reason":"This is a debug log marker indicating the beginning of the script's standard error output section in the CGI debug log.","resolution":"This is an informational log marker, no resolution required. Used for structuring CGI debug logs."},{"function":"cgi_child_errfn","message_template":"(%d)%pm: %s","reason":"Error message from a CGI child process, including error code and description. This indicates an issue with the execution of the CGI script.","resolution":"Review the error message details to determine the specific issue with the script execution. May require debugging the script or checking system resources."}],"project":"apache\/httpd"}