{"module":"mod_headers.c","summary":"The module manages HTTP headers for Apache, allowing administrators to add, modify, remove, or otherwise manipulate request and response headers through configuration directives. It supports conditional header manipulation based on environment variables or expressions, and can process headers early or during the normal request processing phase.","logs":[{"function":"process_tags","message_template":"Can't evaluate value expression: %s","reason":"An error occurred when attempting to evaluate an expression specified with 'expr=' in a Header directive. The expression syntax was likely invalid or referenced undefined variables.","resolution":"Check the expression syntax in your Header directive and ensure all referenced variables exist. Look at Apache's expression documentation for proper syntax."},{"function":"do_headers_fixup","message_template":"Failed to evaluate expression (%s) - ignoring","reason":"A conditional expression in a Header directive failed to evaluate, causing the header operation to be skipped. The expression was likely malformed or referenced undefined variables.","resolution":"Review the expression in your Header directive, ensuring proper syntax and that all referenced variables are defined. The header action will be skipped until the expression can be properly evaluated."},{"function":"ap_headers_early","message_template":"Regular expression replacement failed (replacement too long?)","reason":"A regex substitution in a Header edit operation failed, possibly because the resulting string would be too long. This is a critical error that stops request processing.","resolution":"Simplify your regex replacement patterns in Header edit directives to produce shorter results, or increase Apache's buffer sizes if possible. This may require adjusting internal Apache limits."},{"function":"ap_headers_output_filter","message_template":"headers: ap_headers_output_filter()","reason":"Debug\/trace log indicating the headers output filter is executing. This is informational and indicates normal operation.","resolution":"This is an informational trace message, no resolution required."},{"function":"ap_headers_error_filter","message_template":"headers: ap_headers_error_filter()","reason":"Debug log indicating the headers error filter is executing. This is informational and tracks the execution of the error filter function.","resolution":"This is an informational debug message, no resolution required."},{"function":"parse_format_tag","message_template":"Unrecognized header format %","reason":"A format specifier in a header value template is not recognized. The format specifier begins with % but has an unknown format character.","resolution":"Check your header directive for invalid format specifiers. Valid format specifiers include %D, %t, %e, %s, %l, %i, and %b. Correct the format specifier or use %% to include a literal % character."},{"function":"parse_format_string","message_template":"Can't parse value expression : ","reason":"Failed to parse an expression in a header value defined with expr=. The expression syntax was likely invalid.","resolution":"Review the expression syntax in your Header directive's value. Ensure it follows Apache's expression syntax rules and all variables referenced are available in the context."},{"function":"header_inout_cmd","message_template":"first argument must be 'add', 'set', 'setifempty', 'append', 'merge', 'unset', 'echo', 'note', 'edit', or 'edit*'.","reason":"The action specified in a Header or RequestHeader directive is not one of the allowed values. The configuration is invalid.","resolution":"Modify your Header or RequestHeader directive to use one of the supported actions: add, set, setifempty, append, merge, unset, echo, note, edit, or edit*."},{"function":"header_inout_cmd","message_template":"Header edit requires a match and a substitution","reason":"A Header edit directive was missing either the regex pattern to match or the substitution pattern. Both are required for edit operations.","resolution":"Ensure your Header edit directive includes both a regular expression pattern to match and a substitution pattern. The format should be: Header edit header-name pattern substitution."},{"function":"header_inout_cmd","message_template":"Header edit regex could not be compiled","reason":"The regular expression provided in a Header edit directive has syntax errors and cannot be compiled. The regex is invalid.","resolution":"Check the regular expression in your Header edit directive for syntax errors. Test the regex with a regex validator or simplify it to ensure it's valid POSIX extended regex syntax."},{"function":"header_inout_cmd","message_template":"Too many arguments to directive","reason":"A Header or RequestHeader directive has more arguments than expected. This usually happens when providing both a substitution and an env clause for non-edit actions.","resolution":"Review your Header\/RequestHeader directive and remove excess arguments. Most directives follow the pattern: Header action header-name value [env=variable]."},{"function":"header_inout_cmd","message_template":"header unset takes two arguments","reason":"A Header unset directive received too many or too few arguments. It requires exactly the action and the header name.","resolution":"Correct your Header unset directive to include only the 'unset' action and the header name to be removed. The format should be: Header unset header-name [env=variable]."},{"function":"header_inout_cmd","message_template":"Header echo takes two arguments","reason":"A Header echo directive received incorrect number of arguments. It requires exactly the action and a regular expression pattern.","resolution":"Fix your Header echo directive to include only the 'echo' action and the regular expression pattern to match header names. The format should be: Header echo pattern [env=variable]."},{"function":"header_inout_cmd","message_template":"Header echo only valid on Header directives","reason":"The echo action was used with a RequestHeader directive, but it's only valid for response headers (Header directive).","resolution":"Only use the 'echo' action with Header directives, not with RequestHeader directives. If you need to copy request headers, consider other approaches or Apache modules."},{"function":"header_inout_cmd","message_template":"Header echo regex could not be compiled","reason":"The regular expression provided in a Header echo directive has syntax errors and cannot be compiled. The regex is invalid.","resolution":"Check the regular expression in your Header echo directive for syntax errors. Test the regex with a regex validator or simplify it to ensure it's valid POSIX extended regex syntax."},{"function":"header_inout_cmd","message_template":"Header requires three arguments","reason":"A Header directive is missing required arguments. Most Header actions require at least the action, header name, and value.","resolution":"Add the missing arguments to your Header directive. Most directives require the action, header name, and value (except for 'unset' and 'echo' which have different requirements)."},{"function":"header_inout_cmd","message_template":"error: missing environment variable name. envclause should be in the form env=envar","reason":"An env clause in a Header directive is malformed. It must be in the form 'env=variable' or 'env=!variable'.","resolution":"Correct the env clause in your Header directive to use the proper format: env=variable_name or env=!variable_name to negate the condition."},{"function":"header_inout_cmd","message_template":"Can't parse envclause\/expression: ","reason":"An expression in an env clause of a Header directive has syntax errors and cannot be parsed.","resolution":"Review the expression in your Header directive's env clause. Ensure it follows Apache's expression syntax rules and all referenced variables are properly defined."},{"function":"header_inout_cmd","message_template":"Unknown parameter: ","reason":"An unknown parameter was provided in a Header directive, often in place of the expected env clause.","resolution":"Replace the unknown parameter with a valid env clause (env=variable) or expr= clause, or remove it if not needed. Check the Apache documentation for valid Header directive syntax."},{"function":"header_cmd","message_template":" has too many arguments","reason":"A Header or RequestHeader directive has more arguments than expected. The directive format is incorrect.","resolution":"Review your Header or RequestHeader directive and remove excess arguments. Check the Apache documentation for the correct syntax for the specific action you're using."}],"project":"apache\/httpd"}