{"module":"mod_ident.c","summary":"This module implements RFC 1413 identity checking, which queries an identity server (typically on port 113) on the client's machine to identify the user initiating a connection. The module handles the socket connections, timeouts, and response parsing, and can be enabled\/disabled with the IdentityCheck directive.","logs":[{"function":"rfc1413_connect","message_template":"rfc1413: apr_sockaddr_info_get(%s) failed","reason":"Logs a critical error when unable to get socket address information for the local IP address. Likely occurs due to system resource limitations or an invalid IP address format.","resolution":"Check that the local IP address is valid and properly configured in the server. May require investigating system network configuration or increasing system resources."},{"function":"rfc1413_connect","message_template":"rfc1413: apr_sockaddr_info_get(%s) failed","reason":"Logs a critical error when unable to get socket address information for the client IP address. This could occur if the client IP address is invalid or when there are system resource limitations.","resolution":"Verify that client IP addresses are being properly captured and formatted. May indicate network configuration issues or possibly a malformed request from a client."},{"function":"rfc1413_connect","message_template":"rfc1413: error creating query socket","reason":"Logs a critical error when the server cannot create a socket for the ident query. Usually due to system resource limitations or permission issues.","resolution":"Check system resource limits (ulimit) for file descriptors. May require increasing the limit on open file descriptors or resolving permission issues with the Apache process."},{"function":"rfc1413_connect","message_template":"rfc1413: error setting query socket timeout","reason":"Logs a critical error when the server fails to set the timeout value on the ident query socket. Typically occurs due to system resource limitations or configuration issues.","resolution":"May require adjusting the IdentityCheckTimeout to a more reasonable value or investigating system-level socket configuration issues."},{"function":"rfc1413_connect","message_template":"rfc1413: Error binding query socket to local port","reason":"Logs a critical error when the server cannot bind the query socket to the local address. Often occurs when the port is already in use or when there are permission issues.","resolution":"Check for other processes using the same local port or address combination. May require adjusting network configuration or waiting for ephemeral ports to be released."},{"function":"rfc1413_query","message_template":"write: rfc1413: error sending request","reason":"Logs a critical error when the server cannot send the ident request to the client's identd server. Typically occurs due to network connectivity issues or if the client dropped the connection.","resolution":"Check network connectivity between the server and client. May indicate the client's identd service is not responding properly or there are network issues between the server and client."},{"function":"rfc1413_query","message_template":"read: rfc1413: error reading response","reason":"Logs a critical error when the server cannot read the response from the client's identd server. Usually due to network issues, timeout, or the client dropping the connection.","resolution":"Consider increasing the IdentityCheckTimeout if responses are taking too long. May also indicate network issues or that the client's identd service is not functioning properly."},{"function":"ap_ident_lookup","message_template":"unknown","reason":"Not an explicit log message but a fallback value set when identification fails for any reason. This value appears in logs when remote_logname is used.","resolution":"This is expected behavior when identification fails and doesn't necessarily indicate an error. If many connections show as 'unknown', consider whether ident checking is useful for your environment, as many clients don't run identd services."}],"project":"apache\/httpd"}