{"module":"mod_unique_id.c","summary":"The mod_unique_id module generates a globally unique identifier for each HTTP request processed by the Apache server. It creates a 144-bit value encoded into a 24-character string stored in the UNIQUE_ID environment variable, which can be used by other modules for logging and tracking purposes.","logs":[{"function":"set_unique_id","message_template":"UNIQUE_ID","reason":"Sets the unique identifier for the current request in the environment. This ID will appear in logs and can be used by other modules.","resolution":"This is an informational entry, no resolution required. If unique IDs are not appearing properly in logs, check server configuration and ensure the module is loaded correctly."},{"function":"set_unique_id","message_template":"REDIRECT_UNIQUE_ID","reason":"Preserves the unique identifier during internal redirects. This ensures request tracking remains consistent across redirects.","resolution":"This is an informational entry, no resolution required. If unique IDs are inconsistent across redirects, check for module loading order issues."},{"function":"generate_log_id","message_template":"UNIQUE_ID","reason":"Provides the unique identifier for error logging purposes. This ensures error logs contain the same ID as access logs.","resolution":"This is an informational entry, no resolution required. If IDs are missing from error logs, verify the module is properly loaded and the error logging configuration."},{"function":"gen_unique_id","message_template":"unique ID generation","reason":"Creates a unique identifier based on timestamp, random values, and a counter. Issues here could result in non-unique IDs across requests.","resolution":"If duplicate IDs appear in logs, check for clock synchronization issues across servers in a cluster, or for very high request volumes that exceed the counter capacity."},{"function":"unique_id_child_init","message_template":"random number initialization","reason":"Initializes the random component of the unique ID generator. A failure here could lead to predictable or non-unique IDs.","resolution":"If unique IDs appear to be predictable or repetitive, check system entropy sources and ensure the server has adequate resources for secure random number generation."}],"project":"apache\/httpd"}