{"module":"mod_setenvif.c","summary":"This module sets environment variables based on matching request headers or attributes against regex strings. It allows conditional configuration based on client characteristics like user-agent, IP address, or requested URI, with directives like SetEnvIf and BrowserMatch.","logs":[{"function":"add_envvars","message_template":"Missing envariable expression for %s","reason":"No environment variables were provided for the specified SetEnvIf directive. The directive requires at least one environment variable to set or unset.","resolution":"Add at least one environment variable to the directive. For example: SetEnvIf User-Agent Mozilla BROWSER=mozilla"},{"function":"add_setenvif_core","message_template":"Missing regular expression for %s","reason":"A regular expression pattern was not provided for the SetEnvIf directive, which is required to match against the header value.","resolution":"Provide a valid regular expression to match against. For example: SetEnvIf User-Agent ^Mozilla BROWSER=mozilla"},{"function":"add_setenvif_core","message_template":"%s pattern could not be compiled.","reason":"The pattern specified in the SetEnvIf directive could not be compiled as a valid regular expression pattern.","resolution":"Check and correct the syntax of your regular expression pattern. Ensure proper escaping of special characters."},{"function":"add_setenvif_core","message_template":"%s regex could not be compiled.","reason":"The regular expression specified in the SetEnvIf directive could not be compiled, likely due to syntax errors.","resolution":"Verify the regular expression syntax and correct any errors. Test your regex with a validator if possible."},{"function":"add_setenvif_core","message_template":"Header name regex could not be compiled.","reason":"When using a regular expression for a header name, the regex could not be compiled, suggesting syntax errors.","resolution":"Check the regular expression used for the header name and ensure it follows proper regex syntax."},{"function":"add_setenvif","message_template":"Missing header-field name for %s","reason":"The SetEnvIf directive was missing a required header field name as its first argument.","resolution":"Specify a valid header field name or special variable as the first argument to the directive. For example: SetEnvIf User-Agent Mozilla BROWSER=mozilla"},{"function":"add_setenvifexpr","message_template":"Missing expression for %s","reason":"The SetEnvIfExpr directive was missing the required expression parameter.","resolution":"Add a valid expression to the SetEnvIfExpr directive. For example: SetEnvIfExpr \"%{HTTP_HOST} =~ \/example\\.com\/\" SITE=example"},{"function":"add_setenvifexpr","message_template":"Could not parse expression \"%s\": %s","reason":"The expression provided to SetEnvIfExpr could not be parsed due to syntax errors or invalid expressions.","resolution":"Check the expression syntax and correct any errors. Ensure you're using valid operators and functions in your expression."},{"function":"match_headers","message_template":"Regular expression replacement failed for '%s', value too long?","reason":"During request processing, a regular expression replacement operation failed, possibly because the resulting string would be too long.","resolution":"Simplify your regular expressions or ensure they won't generate excessively long replacement strings. Consider using multiple rules instead of a single complex one."},{"function":"match_headers","message_template":"Setting %s","reason":"Informational debug trace that an environment variable is being set due to a successful match condition.","resolution":"This is an informational log at TRACE2 level. No resolution required unless you're debugging SetEnvIf behavior."}],"project":"apache\/httpd"}