{"module":"mod_usertrack.c","summary":"This Apache module tracks users' paths through a website using client-side cookies. It generates unique cookies for first-time visitors and identifies returning users by reading cookie values, with various configuration options for cookie attributes like domain, expiration, and security settings.","logs":[{"function":"spot_cookie","message_template":"Failed to extract cookie value (out of mem?)","reason":"Logs a critical error when the module fails to extract a cookie value from the request headers, likely due to memory allocation failure.","resolution":"This indicates a serious system resource issue. Check for memory constraints on the server and possibly increase available memory or reduce the server load."},{"function":"set_cookie_name","message_template":"Regular expression could not be compiled.","reason":"Error occurs when the regular expression used to extract cookie values cannot be compiled with the provided cookie name.","resolution":"Ensure the cookie name doesn't contain characters that would make it invalid as part of a regular expression. Use simpler names with alphanumeric characters."},{"function":"set_cookie_name","message_template":"Invalid cookie name \"%s\"","reason":"Error occurs when the specified cookie name results in an invalid regular expression for cookie extraction.","resolution":"Choose a cookie name that consists of simple alphanumeric characters without special regex characters."},{"function":"set_cookie_domain","message_template":"CookieDomain values may not be null","reason":"Error occurs when an empty string is provided for the CookieDomain directive.","resolution":"Specify a valid domain name starting with a dot, such as '.example.com'."},{"function":"set_cookie_domain","message_template":"CookieDomain values must begin with a dot","reason":"Error occurs when the cookie domain doesn't start with a dot character, which violates cookie standards.","resolution":"Ensure the domain name begins with a dot, such as '.example.com'."},{"function":"set_cookie_domain","message_template":"CookieDomain values must contain at least one embedded dot","reason":"Error occurs when the cookie domain doesn't contain at least one dot after the initial dot, which violates cookie standards.","resolution":"Use a properly formatted domain with at least one embedded dot, such as '.example.com'."},{"function":"set_cookie_style","message_template":"Invalid %s keyword: '%s'","reason":"Error occurs when an invalid value is provided for the CookieStyle directive.","resolution":"Use only the supported values: 'Netscape', 'Cookie'\/'RFC2109', or 'Cookie2'\/'RFC2965'."},{"function":"set_samesite_value","message_template":"CookieSameSite accepts 'Strict', 'Lax', or 'None'","reason":"Error occurs when an invalid value is provided for the CookieSameSite directive.","resolution":"Use only the supported values: 'Strict', 'Lax', or 'None'."},{"function":"set_cookie_exp","message_template":"bad expires code, numeric value expected.","reason":"Error occurs when parsing CookieExpires directive and a numeric value was expected but not found.","resolution":"Ensure the CookieExpires directive uses the correct format, with numeric values for time units, e.g., '2 weeks' or '3600'."},{"function":"set_cookie_exp","message_template":"bad expires code, missing <type>","reason":"Error occurs when parsing CookieExpires directive and a time unit type is missing after a numeric value.","resolution":"Ensure the CookieExpires directive includes time unit types after numeric values, e.g., '2 weeks' or '1 day 6 hours'."},{"function":"set_cookie_exp","message_template":"bad expires code, unrecognized type","reason":"Error occurs when parsing CookieExpires directive and an unrecognized time unit type is encountered.","resolution":"Use only supported time unit types: years, months, weeks, days, hours, minutes, or seconds."}],"project":"apache\/httpd"}