{"module":"mod_expires.c","summary":"This module controls HTTP Expires and Cache-Control headers for Apache web server. It allows administrators to configure expiration times for web content based on MIME types, access time, or modification time, improving caching behavior for clients and proxies.","logs":[{"function":"check_code","message_template":"bad expires code, unrecognised <base> '%s'","reason":"Logs an error when the base parameter (access, now, modification) in an expiration directive is not recognized.","resolution":"Check your configuration and ensure the base parameter is one of: 'access', 'now', or 'modification'. These are the only valid base values for expiration calculations."},{"function":"check_code","message_template":"bad expires code, numeric value expected <num> '%s'","reason":"Logs an error when a numeric value is expected in an expiration directive but a non-numeric value was provided.","resolution":"Ensure that time values in expiration directives are valid integers. For example, 'access plus 30 days' requires '30' to be a number."},{"function":"check_code","message_template":"bad expires code, missing <type>","reason":"Logs an error when the time unit type (years, months, etc.) is missing in an expiration directive.","resolution":"Check your configuration and add the appropriate time unit type (years, months, weeks, days, hours, minutes, seconds) after the numeric value."},{"function":"check_code","message_template":"bad expires code, unrecognised <type>'%s'","reason":"Logs an error when the time unit type in an expiration directive is not recognized.","resolution":"Use only supported time unit types: years, months, weeks, days, hours, minutes, or seconds. Any other unit type will cause this error."},{"function":"set_expiresbytype","message_template":"Invalid mimetype: should contain a slash","reason":"Logs an error when an invalid MIME type (without a slash) is provided in an ExpiresByType directive.","resolution":"Ensure all MIME types in ExpiresByType directives follow the format 'type\/subtype', such as 'text\/html' or 'image\/gif'. MIME types must contain a slash character."},{"function":"set_expiresbytype","message_template":"'ExpiresByType %s %s': %s","reason":"Logs an error when there's a problem with an ExpiresByType directive, passing through the detailed error message from check_code().","resolution":"Review the specific error message provided in the log, which will contain details about syntax problems in your ExpiresByType configuration."},{"function":"set_expiresdefault","message_template":"'ExpiresDefault %s': %s","reason":"Logs an error when there's a problem with an ExpiresDefault directive, passing through the detailed error message from check_code().","resolution":"Check the specific error message in the log for details on what's wrong with your ExpiresDefault directive. Fix the syntax according to the error message."},{"function":"set_expiration_fields","message_template":"internal error: bad expires code: %s","reason":"Logs an internal error when an invalid expiration code type is encountered during request processing. This shouldn't happen with proper configuration validation.","resolution":"This indicates a potential bug in the module or corrupted configuration. Check your Apache configuration files and verify all Expires directives use valid syntax. If the problem persists, consider reporting it as a bug."}],"project":"apache\/httpd"}