{"project":"sendmail","module":"..\/working\/sendmail\/smrsh\/smrsh.c","summary":"Smrsh is a restricted shell for sendmail that provides secure execution of programs by only allowing commands found in a specific directory (CMDDIR). It prevents users from executing arbitrary commands through sendmail by stripping path components and rejecting special characters.","logs":[{"function":"addcmd","message_template":"command too long: %.40s","reason":"Logs a warning when the command passed to smrsh exceeds the buffer size limit, indicating a possible buffer overflow attempt or simply an overly long command.","resolution":"Shorten the command being executed. If this is legitimate, consider increasing the buffer size in the application or breaking the command into smaller pieces."},{"function":"main","message_template":"usage","reason":"Logs an error when smrsh is invoked with incorrect command-line arguments, indicating misuse of the restricted shell.","resolution":"Ensure smrsh is invoked with the proper syntax: 'smrsh -c command'. Verify the calling application is using the correct argument format."},{"function":"main","message_template":"too many specials: %.40s","reason":"Logs an error when the SPECIALS string definition is too long for the internal buffer, indicating a configuration issue in the code.","resolution":"This is an internal application error that requires code modification. The list of special characters deemed illegal is too large for the buffer size."},{"function":"main","message_template":"uid %d: missing command to exec","reason":"Logs when an exec directive is specified but no command follows it, which could indicate an attack attempt or malformed command.","resolution":"Check the mail filter or .forward file that's invoking the command and ensure it has a properly formatted command after 'exec'."},{"function":"main","message_template":"uid %d: attempt to use \"%s\" (filename too long)","reason":"Logs a critical error when a user attempts to execute a command whose resolved path would be too long for the system buffer, which could be an attempt to exploit buffer overflow.","resolution":"Use a shorter command name or path. This could be a legitimate issue with long paths or a potential attack vector."},{"function":"main","message_template":"uid %d: attempt to use \"%s\" (stat failed)","reason":"Logs a critical error when stat() fails on a command, typically because the command doesn't exist or permissions deny access.","resolution":"Verify the command exists in the CMDDIR directory and has appropriate permissions. The command may need to be created or permissions adjusted."},{"function":"main","message_template":"uid %d: attempt to use \"%s\" (not a file)","reason":"Logs a critical error when a user attempts to use something that's not a regular file or symbolic link as a command, possibly trying to execute a directory or special file.","resolution":"Check that the referenced command in CMDDIR is a regular executable file or valid symlink, not a directory or other special file type."},{"function":"main","message_template":"uid %d: attempt to use \"%s\"","reason":"Logs a critical error when a user attempts to execute a command that exists but doesn't have execute permissions, indicating a possible security issue.","resolution":"Ensure the command file in CMDDIR has appropriate executable permissions (chmod +x). This is likely a configuration error."},{"function":"main","message_template":"uid %d: attempt to use %c in command: %s","reason":"Logs a critical error when a user attempts to use a forbidden special character in their command, which could be an attempt to execute shell metacharacters.","resolution":"Remove the special characters from the command. If this functionality is required, consider creating a wrapper script in CMDDIR that safely handles these characters."},{"function":"main","message_template":"Cannot exec \/bin\/sh: %s","reason":"Logs a critical error when smrsh fails to execute the shell after validating the command, indicating a system-level issue with the shell.","resolution":"Verify that \/bin\/sh exists and is executable. This may indicate a system configuration problem or possibly a resource limitation issue."}]}