{"module":"mpm_netware.c","summary":"This module implements the Apache HTTP Server Multi-Processing Module (MPM) for the NetWare platform. It manages worker threads, handles server lifecycle events, and provides a console command interface for server management.","logs":[{"function":"worker_main","message_template":"select() failed on listen socket","reason":"The select() system call on the listening socket failed, indicating a potential system resource issue or network stack problem.","resolution":"Check system resources, verify network stack is properly initialized, and ensure that network services are running properly."},{"function":"worker_main","message_template":"apr_socket_accept: giving up.","reason":"The server repeatedly failed to accept connections and has decided to abort operations due to persistent network layer problems.","resolution":"Restart the network services on the server, check for network hardware issues, or verify that the TCP\/IP stack is operating correctly."},{"function":"worker_main","message_template":"apr_socket_accept: (client socket)","reason":"An error occurred while trying to accept a client connection, but it was not recoverable and resulted in a worker thread shutting down.","resolution":"Check client connection attempts, verify network connectivity, and ensure server has sufficient resources to handle connections."},{"function":"perform_idle_server_maintenance","message_template":"server reached MaxRequestWorkers setting, consider raising the MaxRequestWorkers setting","reason":"The server has reached its configured maximum number of worker threads and cannot spawn any more to handle additional requests.","resolution":"Increase the MaxRequestWorkers (MaxThreads) setting in the configuration if the server has sufficient resources to handle more concurrent connections."},{"function":"perform_idle_server_maintenance","message_template":"server seems busy, (you may need to increase StartServers, or Min\/MaxSpareServers), spawning %d children, there are %d idle, and %d total children","reason":"The server is experiencing high load and is dynamically increasing the number of worker threads to handle the traffic.","resolution":"Consider adjusting StartThreads, MinSpareThreads, and MaxSpareThreads settings to optimize performance under typical load conditions."},{"function":"setup_listeners","message_template":"no listening sockets available, shutting down","reason":"The server could not set up any listening sockets, which is a fatal error preventing the server from accepting connections.","resolution":"Check that the configured ports are available and not in use by other services. Verify that the server has permission to bind to the specified ports."},{"function":"netware_run","message_template":"%s configured -- resuming normal operations","reason":"Informational message indicating that the server has completed configuration and is now operational.","resolution":"Information log, no resolution required."},{"function":"netware_run","message_template":"Server built: %s","reason":"Informational message showing when the server binary was compiled.","resolution":"Information log, no resolution required."},{"function":"netware_run","message_template":"caught SIGTERM, shutting down","reason":"The server received a termination signal and is beginning the shutdown process.","resolution":"Information log, no resolution required unless shutdown was unexpected. In that case, investigate what triggered the termination signal."},{"function":"netware_run","message_template":"Graceful restart requested, doing restart","reason":"The server has received a request to perform a graceful restart, allowing current connections to complete before restarting.","resolution":"Information log, no resolution required."},{"function":"netware_check_config","message_template":"WARNING: MaxThreads of %d exceeds compile-time limit of %d threads, decreasing to %d. To increase, please see the HARD_THREAD_LIMIT define in server\/mpm\/netware%s.","reason":"The configured MaxThreads value is higher than the compiled-in hard limit, and has been automatically decreased.","resolution":"Recompile the server with a higher HARD_THREAD_LIMIT if more threads are needed, or decrease the MaxThreads setting in the configuration."},{"function":"netware_check_config","message_template":"MaxThreads of %d exceeds compile-time limit of %d, decreasing to match","reason":"The configured MaxThreads value is higher than the compiled-in hard limit and has been automatically decreased.","resolution":"Recompile the server with a higher HARD_THREAD_LIMIT if more threads are needed, or decrease the MaxThreads setting in the configuration."},{"function":"netware_check_config","message_template":"WARNING: MaxThreads of %d not allowed, increasing to 1.","reason":"The configured MaxThreads value is less than 1, which is invalid. It has been automatically increased to 1.","resolution":"Update the configuration with a valid MaxThreads setting (at least 1)."},{"function":"netware_check_config","message_template":"MaxThreads of %d not allowed, increasing to 1","reason":"The configured MaxThreads value is less than 1, which is invalid. It has been automatically increased to 1.","resolution":"Update the configuration with a valid MaxThreads setting (at least 1)."},{"function":"netware_check_config","message_template":"WARNING: StartThreads of %d not allowed, increasing to 1.","reason":"The configured StartThreads value is less than 1, which is invalid. It has been automatically increased to 1.","resolution":"Update the configuration with a valid StartThreads setting (at least 1)."},{"function":"netware_check_config","message_template":"StartThreads of %d not allowed, increasing to 1","reason":"The configured StartThreads value is less than 1, which is invalid. It has been automatically increased to 1.","resolution":"Update the configuration with a valid StartThreads setting (at least 1)."},{"function":"netware_check_config","message_template":"WARNING: MinSpareThreads of %d not allowed, increasing to 1 to avoid almost certain server failure. Please read the documentation.","reason":"The configured MinSpareThreads value is less than 1, which is invalid and could cause server failure. It has been automatically increased to 1.","resolution":"Update the configuration with a valid MinSpareThreads setting (at least 1) and review the server documentation for recommended settings."},{"function":"netware_check_config","message_template":"MinSpareThreads of %d not allowed, increasing to 1","reason":"The configured MinSpareThreads value is less than 1, which is invalid. It has been automatically increased to 1.","resolution":"Update the configuration with a valid MinSpareThreads setting (at least 1)."},{"function":"CommandLineInterpreter","message_template":"Error on allocate resource tag","reason":"The server failed to allocate a resource tag for the console command handler, which may indicate resource exhaustion.","resolution":"Check system resources and verify that the NetWare server has sufficient memory and resources available."},{"function":"CommandLineInterpreter","message_template":"Restart Requested...","reason":"A restart command was issued from the console and the server is preparing to restart.","resolution":"Information log, no resolution required."},{"function":"CommandLineInterpreter","message_template":"Shutdown Requested...","reason":"A shutdown command was issued from the console and the server is preparing to shut down.","resolution":"Information log, no resolution required."},{"function":"CommandLineInterpreter","message_template":"Unknown APACHE2 command %s","reason":"An unrecognized command was entered at the console and could not be processed.","resolution":"Use a valid APACHE2 command. See the help output for a list of valid commands."}],"project":"apache\/httpd"}