{"module":"systemd.c","summary":"This module integrates Apache HTTP Server with systemd, providing status notifications to systemd during server lifecycle events, SELinux context logging, performance statistics reporting, and systemd socket activation support.","logs":[{"function":"systemd_pre_config","message_template":"RELOADING=1\nSTATUS=Reading configuration...\n","reason":"Notifies systemd that Apache is reloading its configuration during the pre-configuration phase","resolution":"Informational message, no resolution required. This is part of normal server startup or graceful restart."},{"function":"log_selinux_context","message_template":"SELinux is enabled; httpd running as context %s","reason":"Logs the SELinux security context under which the httpd process is running, providing important security information","resolution":"Informational message. If the context appears incorrect, verify SELinux policy configuration for httpd and ensure the server is started with the correct context."},{"function":"systemd_post_config","message_template":"READY=1\nSTATUS=Configuration loaded.\n","reason":"Notifies systemd that Apache has successfully loaded its configuration and is ready to accept connections","resolution":"Informational message, no resolution required. This indicates successful configuration loading."},{"function":"systemd_pre_mpm","message_template":"READY=1\nSTATUS=Processing requests...\nMAINPID=%","reason":"Notifies systemd that Apache is ready to process requests and provides the main process ID","resolution":"Informational message, no resolution required. This is part of normal server operation after successful initialization."},{"function":"systemd_monitor","message_template":"READY=1\nSTATUS=Total requests: %lu; Idle\/Busy workers %d\/%d;Requests\/sec: %.3g; Bytes served\/sec: %sB\/sec\n","reason":"Reports server performance statistics to systemd periodically for monitoring purposes","resolution":"Informational message for monitoring. If worker ratios show consistently high busy counts, consider increasing MaxRequestWorkers in httpd.conf."},{"function":"ap_find_systemd_socket","message_template":"find_systemd_socket: Error parsing enviroment, sd_listen_fds returned %d","reason":"Failed to parse the environment variables required for systemd socket activation, likely due to missing or malformed environment variables","resolution":"Verify systemd service unit file contains the correct socket-related directives. Ensure systemd is properly passing socket file descriptors to Apache. Check that Apache was launched by systemd with the proper environment variables."},{"function":"ap_find_systemd_socket","message_template":"find_systemd_socket: At least one socket must be set.","reason":"No systemd socket was found when using socket activation, which is required for this feature to work","resolution":"Ensure the systemd service unit file includes proper socket activation configuration. Verify that the associated systemd socket unit is enabled and properly configured to listen on the desired ports."}],"project":"apache\/httpd"}