{"module":"mod_privileges.c","summary":"This module manages process privileges on Solaris systems, enabling Apache to run with different privileges for different virtual hosts. It allows secure compartmentalization by restricting available system calls and operations for various contexts and processes.","logs":[{"function":"privileges_create_cfg","message_template":"Failed to initialise privileges","reason":"Failed to initialize the base privileges set during server configuration. This occurs when the system cannot set up the appropriate privilege restrictions.","resolution":"Check if the Apache process has appropriate permissions to manipulate privileges. This may require running Apache as root initially."},{"function":"privileges_end_req","message_template":"PRIV_ON failed restoring default user\/group","reason":"Failed to restore privileges needed to switch back to the default user\/group after request processing.","resolution":"Check system resource limits and ensure the process has PRIV_PROC_SETID capability."},{"function":"privileges_end_req","message_template":"Error restoring default userid","reason":"Failed to restore the server's default user ID after processing a request with custom privileges.","resolution":"Verify the default user ID exists and that the process has permission to switch to it."},{"function":"privileges_end_req","message_template":"Error restoring default group","reason":"Failed to restore the server's default group ID after processing a request with custom privileges.","resolution":"Verify the default group exists and that the process has permission to switch to it."},{"function":"privileges_end_req","message_template":"Error restoring default privileges","reason":"Failed to restore the default privilege set after request processing, potentially leaving the process with incorrect privileges.","resolution":"Check system privilege subsystem integrity and ensure Apache has permission to modify its privileges."},{"function":"privileges_req","message_template":"parent waiting for child","reason":"Debug message indicating the parent process is waiting for a child process that was forked to handle a request with limited privileges.","resolution":"Information log, no resolution required."},{"function":"privileges_req","message_template":"parent: child %s","reason":"Debug message indicating the status of a child process that was handling a request (done or notdone).","resolution":"Information log, no resolution required. If 'notdone' appears frequently, check for child process issues."},{"function":"privileges_req","message_template":"In child!","reason":"Debug message indicating successful creation of a child process for handling a request with limited privileges.","resolution":"Information log, no resolution required."},{"function":"privileges_req","message_template":"Failed to fork secure child process!","reason":"The server failed to create a child process for handling a request securely with limited privileges.","resolution":"Check system resources like process limits, memory availability, and ensure fork() operations are allowed in the current privilege context."},{"function":"privileges_req","message_template":"No privilege to set user\/group","reason":"The process lacks the privileges needed to change the user or group ID for a request.","resolution":"Ensure the Apache process starts with appropriate privileges, typically by starting as root initially before dropping privileges."},{"function":"privileges_req","message_template":"Error setting userid","reason":"Failed to set the user ID specified in VHostUser configuration, which prevents running the request with the intended privileges.","resolution":"Verify the specified user exists on the system and that the process has permission to switch to this user."},{"function":"privileges_req","message_template":"Error setting group","reason":"Failed to set the group ID specified in VHostGroup configuration, which prevents running the request with the intended privileges.","resolution":"Verify the specified group exists on the system and that the process has permission to switch to this group."},{"function":"privileges_req","message_template":"Error setting effective privileges","reason":"Failed to apply the configured effective privilege set to the process, leaving it with potentially incorrect privileges.","resolution":"Check that the privileges specified in the configuration exist on the system and that Apache has permission to modify its privilege sets."},{"function":"privileges_req","message_template":"Error setting inheritable privileges","reason":"Failed to set the inheritable privilege set, which would affect privileges available to child processes.","resolution":"Verify that the configured privileges exist on the system and that the process has permission to modify its inheritable privilege set."},{"function":"privileges_req","message_template":"Error setting limit privileges","reason":"Failed to set the limit privilege set, which defines the maximum privileges available to the process.","resolution":"Check that the configured privileges exist on the system and that the process has permission to modify its limit privilege set."},{"function":"privileges_req","message_template":"Error setting permitted privileges","reason":"Failed to set the permitted privilege set in a child process, potentially leaving it with excessive privileges.","resolution":"Verify system privilege subsystem is functioning correctly and that the process has permission to modify its permitted privilege set."},{"function":"privileges_drop_first","message_template":"Error dropping privileges","reason":"Failed to drop privileges during server initialization, which could leave the server running with excessive privileges.","resolution":"Check that the process has permission to modify its privilege sets and that the privilege subsystem is functioning correctly."},{"function":"privileges_init","message_template":"mod_privileges: unable to determine MPM characteristics. Please ensure you are using a non-threaded MPM with this module.","reason":"The module could not determine if the Apache MPM (Multi-Processing Module) is threaded or not, which is essential because mod_privileges is incompatible with threaded MPMs.","resolution":"Configure Apache to use a non-threaded MPM such as prefork, and ensure the MPM module is loaded before mod_privileges."},{"function":"privileges_init","message_template":"mod_privileges is not compatible with a threaded MPM.","reason":"The module detected that Apache is using a threaded MPM, but mod_privileges only works with non-threaded MPMs due to privilege isolation requirements.","resolution":"Reconfigure Apache to use a non-threaded MPM such as prefork instead of worker or event MPMs."},{"function":"vhost_user","message_template":"Invalid userid for VHostUser: ","reason":"The user specified in VHostUser directive does not exist or could not be resolved to a valid user ID.","resolution":"Ensure the specified user exists on the system and is accessible to the Apache process during configuration parsing."},{"function":"vhost_group","message_template":"Invalid groupid for VHostGroup: ","reason":"The group specified in VHostGroup directive does not exist or could not be resolved to a valid group ID.","resolution":"Ensure the specified group exists on the system and is accessible to the Apache process during configuration parsing."},{"function":"vhost_cgimode","message_template":"VHostCGIMode must be On, Off or Secure","reason":"The VHostCGIMode directive was given an invalid value, only 'On', 'Off', or 'Secure' are permitted.","resolution":"Update the configuration to use one of the allowed values for VHostCGIMode."},{"function":"privs_mode","message_template":"PrivilegesMode in a Directory context must be FAST or SECURE","reason":"In a directory context, PrivilegesMode was set to an invalid value; only FAST or SECURE are allowed in this context.","resolution":"Update the configuration to use either FAST or SECURE for PrivilegesMode in directory contexts."},{"function":"privs_mode","message_template":"PrivilegesMode must be FAST, SECURE or SELECTIVE","reason":"In a server or virtual host context, PrivilegesMode was set to an invalid value; only FAST, SECURE, or SELECTIVE are allowed.","resolution":"Update the configuration to use one of the allowed values for PrivilegesMode in server or virtual host contexts."},{"function":"privileges_postconf","message_template":"priv_addset","reason":"Failed to add a privilege to a privilege set during post-configuration, possibly related to DTrace privileges.","resolution":"Verify the system supports the privileges being added (particularly DTrace-related ones) and that Apache has permission to modify its privilege sets."}],"project":"apache\/httpd"}