{"module":"mod_dav.c","summary":"Apache module implementing WebDAV (Web Distributed Authoring and Versioning) protocol for web content management. It handles HTTP methods like PROPFIND, PROPPATCH, MKCOL, and provides locking, versioning, and property management features.","logs":[{"function":"dav_init_handler","message_template":"mod_dav ACL support disabled. Compile with apr-util >= 1.6 to enable.","reason":"Logs a warning that ACL support in mod_dav is not available due to the version of apr-util being too old.","resolution":"Recompile with apr-util version 1.6 or newer to enable ACL support."},{"function":"dav_merge_dir_config","message_template":"\"DAV Off\" cannot be used to turn off a subtree of a DAV-enabled location.","reason":"Logs an error when configuration attempts to disable DAV in a subdirectory when the parent directory has DAV enabled.","resolution":"Reconfigure your server to not have conflicting DAV settings between parent and child directories."},{"function":"dav_merge_dir_config","message_template":"A subtree cannot specify a different DAV provider than its parent.","reason":"Logs an error when a directory specifies a different DAV provider than its parent directory.","resolution":"Ensure all directories in the same hierarchy use the same DAV provider."},{"function":"dav_get_resource","message_template":"failed to find repository for location configured via regex match - missing DAVBasePath?","reason":"Logs an error when repository resolution fails in a location configured with regex match.","resolution":"Add a DAVBasePath directive to specify the repository path when using regex location matching."},{"function":"dav_cmd_dav","message_template":"Unknown DAV provider: %s","reason":"Logs an error when an unrecognized DAV provider name is used in configuration.","resolution":"Use only registered DAV providers like 'filesystem' or others registered by loaded modules."},{"function":"dav_cmd_davmintimeout","message_template":"DAVMinTimeout requires a non-negative integer.","reason":"Logs an error when DAVMinTimeout is configured with a negative value.","resolution":"Use only non-negative integers for DAVMinTimeout directive."},{"function":"dav_cmd_davmsext","message_template":"DAVMSext values can be None | [+|-]WDV | All","reason":"Logs an error when DAVMSext is configured with an invalid value.","resolution":"Use only the allowed values: None, Off, +WDV, WDV, -WDV, All, or On for the DAVMSext directive."},{"function":"dav_method_get","message_template":"Unable to set up HTTP headers.","reason":"Logs an error when the repository fails to set up HTTP headers for a GET request.","resolution":"Check repository configuration and file permissions, as this typically indicates a problem with resource metadata access."},{"function":"dav_method_get","message_template":"Unable to deliver content.","reason":"Logs an error when the repository fails to deliver the resource content for a GET request.","resolution":"Verify file permissions and resource accessibility in the DAV repository."},{"function":"dav_method_put","message_template":"Cannot create resource %s with PUT.","reason":"Logs an error when a PUT request attempts to create a resource of an unsupported type.","resolution":"Only regular resources can be created with PUT. Use appropriate WebDAV methods for other resource types."},{"function":"dav_method_put","message_template":"Cannot PUT to a collection.","reason":"Logs an error when a PUT request attempts to update a collection resource.","resolution":"Use MKCOL to create collections, and PUT only for regular resources. Collections cannot be created or updated with PUT."},{"function":"dav_method_put","message_template":"Malformed Content-Range header for PUT %s.","reason":"Logs an error when a PUT request contains an invalid Content-Range header.","resolution":"Check the client's Content-Range header format. It should follow the format 'bytes start-end\/length'."},{"function":"dav_method_put","message_template":"Unable to PUT new contents for %s.","reason":"Logs an error when the repository fails to store the request content.","resolution":"Verify write permissions in the repository and available disk space."},{"function":"dav_method_put","message_template":"An error occurred while reading the request body (URI: %s)","reason":"Logs an error when there's a problem reading the request body data.","resolution":"Check network connection and client behavior. May indicate premature connection termination or invalid content length."},{"function":"dav_method_put","message_template":"An error occurred while reading the request body from the bucket (URI: %s)","reason":"Logs a more specific error about bucket reading problems during PUT processing.","resolution":"This is typically a server-side issue with memory or internal data handling. Check server resources and Apache error logs for related issues."},{"function":"dav_method_put","message_template":"The PUT was successful, but there was a problem automatically checking in the resource or its parent collection.","reason":"Logs a warning when the PUT operation succeeded but auto-versioning check-in failed.","resolution":"This is primarily informational. The resource was saved but versioning operations were incomplete. Check versioning configuration if this persists."},{"function":"dav_method_put","message_template":"The file was PUT successfully, but there was a problem opening the lock database which prevents inheriting locks from the parent resources.","reason":"Logs a warning when the PUT operation succeeded but lock inheritance failed.","resolution":"Check lock database configuration and permissions. Lock inheritance may not be working properly."},{"function":"dav_method_put","message_template":"The file was PUT successfully, but there was a problem updating its lock information.","reason":"Logs a warning when the PUT operation succeeded but lock information updates failed.","resolution":"Verify lock database configuration and permissions. Lock information may be out of sync."},{"function":"dav_method_delete","message_template":"Depth must be \"infinity\" for DELETE of a collection.","reason":"Logs an error when a DELETE request for a collection doesn't specify Depth: infinity.","resolution":"Modify client to include 'Depth: infinity' header when deleting collections, or delete individual resources."},{"function":"dav_method_delete","message_template":"Depth of \"1\" is not allowed for DELETE.","reason":"Logs an error when a DELETE request specifies a Depth of 1, which is not valid for DELETE.","resolution":"Use Depth: infinity for collections or Depth: 0 for single resources. Depth: 1 is not allowed for DELETE."},{"function":"dav_method_delete","message_template":"Could not DELETE %s due to a failed precondition (e.g. locks).","reason":"Logs an error when a DELETE operation fails due to lock conflicts or other preconditions.","resolution":"Ensure the resource is not locked by another user, or provide appropriate lock tokens in the If header."},{"function":"dav_method_delete","message_template":"Could not DELETE %s.","reason":"Logs a general error when a DELETE operation fails for unspecified reasons.","resolution":"Check server logs for more specific errors, and verify permissions on the resource and its parent directory."},{"function":"dav_method_delete","message_template":"The DELETE was successful, but there was a problem automatically checking in the parent collection.","reason":"Logs a warning when DELETE succeeded but versioning operations on the parent failed.","resolution":"This is informational - the delete was successful but versioning updates may be incomplete. Check versioning configuration if this persists."},{"function":"dav_get_depth","message_template":"An invalid Depth header was specified.","reason":"Logs an error when a request contains an invalid Depth header value.","resolution":"Use only valid Depth values: 0, 1, or infinity in the Depth header."},{"function":"dav_get_overwrite","message_template":"An invalid Overwrite header was specified.","reason":"Logs an error when a request contains an invalid Overwrite header value.","resolution":"Use only 'T' or 'F' as values for the Overwrite header."},{"function":"dav_method_propfind","message_template":"PROPFIND requests with a Depth of \"infinity\" are not allowed for %s.","reason":"Logs an error when a PROPFIND request with Depth: infinity is not allowed for the resource.","resolution":"Configure DAVDepthInfinity to allow Depth: infinity PROPFIND requests, or use Depth: 0 or 1 instead."},{"function":"dav_method_propfind","message_template":"The \"propfind\" element was not found.","reason":"Logs an error when a PROPFIND request body does not contain the required propfind element.","resolution":"Ensure client sends a properly formatted WebDAV PROPFIND request body with a propfind root element."},{"function":"dav_method_propfind","message_template":"The \"propfind\" element does not contain one of the required child elements (the specific command).","reason":"Logs an error when a PROPFIND request body doesn't contain one of the required elements (allprop, propname, or prop).","resolution":"Modify client to include one of the required elements (allprop, propname, or prop) in the propfind request body."},{"function":"dav_method_propfind","message_template":"Provider encountered an error while streaming a multistatus PROPFIND response.","reason":"Logs an error when the repository provider encounters an error while generating the PROPFIND response.","resolution":"Check server logs for more specific errors. This may indicate filesystem access problems or resource limitations."},{"function":"dav_open_lockdb","message_template":"The lock database could not be opened, preventing access to the various lock properties for the PROPFIND.","reason":"Logs an error when the lock database cannot be opened during a PROPFIND operation.","resolution":"Check lock database configuration and permissions. Lock-related properties may not be available."},{"function":"dav_gen_supported_live_props","message_template":"The lock database could not be opened, preventing the reporting of supported lock properties.","reason":"Logs an error when the lock database cannot be opened during property support reporting.","resolution":"Check lock database configuration and permissions. Lock property support information may be incomplete."},{"function":"dav_gen_supported_live_props","message_template":"The property database could not be opened, preventing report of supported properties.","reason":"Logs an error when the property database cannot be opened during property support reporting.","resolution":"Check property database configuration and permissions. Property support information may be incomplete."},{"function":"dav_gen_supported_reports","message_template":"DAV:supported-report-set could not be determined due to a problem fetching the available reports for this resource.","reason":"Logs an error when available reports cannot be determined for a resource.","resolution":"Check versioning provider configuration and resource type. Report capabilities may be unavailable."},{"function":"dav_method_proppatch","message_template":"The request body does not contain a \"propertyupdate\" element.","reason":"Logs an error when a PROPPATCH request body doesn't contain the required propertyupdate element.","resolution":"Ensure client sends a properly formatted WebDAV PROPPATCH request with a propertyupdate root element."},{"function":"dav_method_proppatch","message_template":"Could not open the property database for %s.","reason":"Logs an error when the property database cannot be opened during a PROPPATCH operation.","resolution":"Check property database configuration and permissions. Property updates will fail until resolved."},{"function":"dav_method_proppatch","message_template":"A \"prop\" element is missing inside the propertyupdate command.","reason":"Logs an error when a propertyupdate element in a PROPPATCH request doesn't contain a prop element.","resolution":"Modify client to include a prop element within set or remove elements in the PROPPATCH request."},{"function":"process_mkcol_body","message_template":"Unknown Transfer-Encoding %s","reason":"Logs an error when a request contains an unsupported Transfer-Encoding header.","resolution":"Use only 'chunked' as the Transfer-Encoding value, or use Content-Length instead."},{"function":"process_mkcol_body","message_template":"Invalid Content-Length %s","reason":"Logs an error when a request contains an invalid Content-Length header.","resolution":"Provide a valid positive integer as the Content-Length value, or use chunked Transfer-Encoding."},{"function":"dav_method_mkcol","message_template":"The MKCOL was successful, but there was a problem automatically checking in the parent collection.","reason":"Logs a warning when MKCOL succeeded but versioning operations on the parent failed.","resolution":"This is informational - the collection was created but versioning updates may be incomplete. Check versioning configuration if this persists."},{"function":"dav_method_mkcol","message_template":"The MKCOL was successful, but there was a problem opening the lock database which prevents inheriting locks from the parent resources.","reason":"Logs a warning when MKCOL succeeded but lock inheritance failed.","resolution":"Check lock database configuration and permissions. Lock inheritance may not be working properly for new collections."},{"function":"dav_method_mkcol","message_template":"The MKCOL was successful, but there was a problem updating its lock information.","reason":"Logs a warning when MKCOL succeeded but lock information updates failed.","resolution":"Verify lock database configuration and permissions. Lock information may be out of sync for new collections."},{"function":"dav_method_copymove","message_template":"Cannot COPY\/MOVE resource %s.","reason":"Logs an error when a resource cannot be copied or moved due to resource type constraints.","resolution":"Only regular resources can be copied or moved. Check resource type and consider alternative operations."},{"function":"dav_method_copymove","message_template":"The request is missing a Destination header.","reason":"Logs an error when a COPY or MOVE request doesn't include a Destination header.","resolution":"Modify client to include a Destination header specifying the target URI for the operation."},{"function":"dav_method_copymove","message_template":"Destination URI had an error.","reason":"Logs an error when the Destination URI in a COPY or MOVE request is invalid.","resolution":"Check the Destination URI format and ensure it points to a valid location."},{"function":"dav_method_copymove","message_template":"Destination URI is handled by a different repository than the source URI. MOVE or COPY between repositories is not possible.","reason":"Logs an error when a COPY or MOVE operation attempts to cross repository boundaries.","resolution":"COPY\/MOVE operations must be within the same repository. Use client-side copy\/move for cross-repository transfers."},{"function":"dav_method_copymove","message_template":"Destination is not empty and Overwrite is not \"T\"","reason":"Logs an error when a COPY or MOVE operation targets an existing resource but Overwrite is not set to T.","resolution":"Include 'Overwrite: T' header if you wish to replace existing destination resources, otherwise choose a non-existent destination."},{"function":"dav_method_copymove","message_template":"Source and Destination URIs are the same.","reason":"Logs an error when a COPY or MOVE operation has identical source and destination.","resolution":"Specify a different destination URI for the operation. Source and destination cannot be the same."},{"function":"dav_method_copymove","message_template":"Depth must be \"0\" or \"infinity\" for COPY or MOVE.","reason":"Logs an error when a COPY or MOVE request specifies an invalid Depth header.","resolution":"Use only 'Depth: 0' or 'Depth: infinity' for COPY\/MOVE operations."},{"function":"dav_method_copymove","message_template":"Depth must be \"infinity\" when moving a collection.","reason":"Logs an error when a MOVE request for a collection doesn't specify Depth: infinity.","resolution":"Always use 'Depth: infinity' when moving collections. Partial collection moves are not allowed."},{"function":"dav_method_copymove","message_template":"Could not %s %s due to a failed precondition on the source (e.g. locks).","reason":"Logs an error when a COPY or MOVE operation fails due to lock conflicts or other preconditions on the source.","resolution":"Ensure the source resource is not locked by another user, or provide appropriate lock tokens in the If header."},{"function":"dav_method_copymove","message_template":"Could not MOVE\/COPY %s due to a failed precondition on the destination (e.g. locks).","reason":"Logs an error when a COPY or MOVE operation fails due to lock conflicts or other preconditions on the destination.","resolution":"Ensure the destination resource is not locked by another user, or provide appropriate lock tokens in the If header."},{"function":"dav_method_copymove","message_template":"Source collection contains the Destination.","reason":"Logs an error when a COPY or MOVE operation would create a circular hierarchy.","resolution":"Choose a destination that is not contained within the source collection."},{"function":"dav_method_copymove","message_template":"Destination collection contains the Source and Overwrite has been specified.","reason":"Logs an error when a COPY or MOVE with Overwrite would delete its own source.","resolution":"This operation is not allowed because it would delete the source before completing. Choose a different destination."},{"function":"dav_method_copymove","message_template":"Could not MOVE\/COPY %s.","reason":"Logs a general error when a COPY or MOVE operation fails for unspecified reasons.","resolution":"Check server logs for more specific errors, and verify permissions on both source and destination resources."},{"function":"dav_method_copymove","message_template":"The MOVE\/COPY was successful, but there was a problem automatically checking in the source parent collection.","reason":"Logs a warning when COPY\/MOVE succeeded but versioning operations on the source parent failed.","resolution":"This is informational - the operation was successful but versioning updates may be incomplete. Check versioning configuration if this persists."},{"function":"dav_method_copymove","message_template":"The MOVE\/COPY was successful, but there was a problem automatically checking in the destination or its parent collection.","reason":"Logs a warning when COPY\/MOVE succeeded but versioning operations on the destination failed.","resolution":"This is informational - the operation was successful but versioning updates may be incomplete. Check versioning configuration if this persists."},{"function":"dav_method_copymove","message_template":"The MOVE\/COPY was successful, but there was a problem updating the lock information.","reason":"Logs a warning when COPY\/MOVE succeeded but lock information updates failed.","resolution":"Verify lock database configuration and permissions. Lock information may be out of sync for the affected resources."},{"function":"dav_method_lock","message_template":"Depth must be 0 or \"infinity\" for LOCK.","reason":"Logs an error when a LOCK request specifies an invalid Depth header.","resolution":"Use only 'Depth: 0' or 'Depth: infinity' for LOCK operations."},{"function":"dav_method_lock","message_template":"The parent resource of %s does not exist or is not a collection.","reason":"Logs an error when a LOCK request attempts to create a lock-null resource but the parent collection doesn't exist.","resolution":"Create the parent collection first before attempting to lock a non-existent resource within it."},{"function":"dav_method_lock","message_template":"Could not LOCK %s due to a failed precondition (e.g. other locks).","reason":"Logs an error when a LOCK operation fails due to conflicting locks or other preconditions.","resolution":"Check for existing locks on the resource. You may need to wait for other locks to be released."},{"function":"dav_method_lock","message_template":"The lock refresh for %s failed because no lock tokens were specified in an \"If:\" header.","reason":"Logs an error when a lock refresh request doesn't include lock tokens in an If header.","resolution":"Include appropriate lock tokens in the If header when refreshing locks."},{"function":"dav_method_unlock","message_template":"Unlock failed (%s): No Lock-Token specified in header","reason":"Logs an error when an UNLOCK request doesn't include a Lock-Token header.","resolution":"Modify client to include a Lock-Token header with the token of the lock to be removed."},{"function":"dav_method_unlock","message_template":"The UNLOCK on %s failed -- an invalid lock token was specified in the \"If:\" header.","reason":"Logs an error when an UNLOCK request contains an invalid lock token.","resolution":"Check that the lock token is correctly formatted and refers to an existing lock on the resource."},{"function":"dav_method_vsn_control","message_template":"Could not VERSION-CONTROL resource %s.","reason":"Logs an error when a VERSION-CONTROL operation fails for a resource.","resolution":"Check versioning provider configuration and resource type support for versioning."},{"function":"dav_method_vsn_control","message_template":"The VERSION-CONTROL was successful, but there was a problem automatically checking in the parent collection.","reason":"Logs a warning when VERSION-CONTROL succeeded but parent collection versioning operations failed.","resolution":"This is informational - the operation was successful but versioning updates on the parent may be incomplete."},{"function":"dav_method_vsn_control","message_template":"The VERSION-CONTROL was successful, but there was a problem opening the lock database which prevents inheriting locks from the parent resources.","reason":"Logs a warning when VERSION-CONTROL succeeded but lock inheritance failed.","resolution":"Check lock database configuration and permissions. Lock inheritance may not be working properly for newly versioned resources."},{"function":"dav_method_vsn_control","message_template":"The VERSION-CONTROL was successful, but there was a problem updating its lock information.","reason":"Logs a warning when VERSION-CONTROL succeeded but lock information updates failed.","resolution":"Verify lock database configuration and permissions. Lock information may be out of sync for newly versioned resources."},{"function":"dav_method_checkout","message_template":"The request body, if present, must be a DAV:checkout element.","reason":"Logs an error when a CHECKOUT request body is present but not a valid checkout element.","resolution":"Ensure client sends a properly formatted WebDAV CHECKOUT request with a checkout root element if a body is included."},{"function":"dav_method_checkout","message_template":"DAV:apply-to-version cannot be used in conjunction with a Label header.","reason":"Logs an error when a CHECKOUT request contains both apply-to-version and a Label header.","resolution":"Use either apply-to-version in the request body or a Label header, but not both."},{"function":"dav_method_checkout","message_template":"Within the DAV:activity-set element, the DAV:new element must be used, or at least one DAV:href must be specified.","reason":"Logs an error when an activity-set element in a CHECKOUT request is empty.","resolution":"Include either a new element or at least one href element within the activity-set element."},{"function":"dav_method_checkout","message_template":"Cannot checkout this type of resource.","reason":"Logs an error when a CHECKOUT operation is attempted on an unsupported resource type.","resolution":"CHECKOUT is only allowed on regular or version resources. Check resource type and consider alternative operations."},{"function":"dav_method_checkout","message_template":"Cannot checkout unversioned resource.","reason":"Logs an error when a CHECKOUT operation is attempted on a non-versioned resource.","resolution":"Apply VERSION-CONTROL to the resource first before attempting CHECKOUT."},{"function":"dav_method_checkout","message_template":"The resource is already checked out to the workspace.","reason":"Logs an error when a CHECKOUT operation is attempted on a resource already checked out.","resolution":"Resource is already checked out and doesn't need another checkout. Use the current working resource."},{"function":"dav_method_checkout","message_template":"Could not CHECKOUT resource %s.","reason":"Logs a general error when a CHECKOUT operation fails for unspecified reasons.","resolution":"Check server logs for more specific errors, and verify versioning provider configuration."},{"function":"dav_method_uncheckout","message_template":"Cannot uncheckout this type of resource.","reason":"Logs an error when an UNCHECKOUT operation is attempted on an unsupported resource type.","resolution":"UNCHECKOUT is only allowed on regular resources. Check resource type and consider alternative operations."},{"function":"dav_method_uncheckout","message_template":"Cannot uncheckout unversioned resource.","reason":"Logs an error when an UNCHECKOUT operation is attempted on a non-versioned resource.","resolution":"Only versioned resources can be checked out or unchecked out."},{"function":"dav_method_uncheckout","message_template":"The resource is not checked out to the workspace.","reason":"Logs an error when an UNCHECKOUT operation is attempted on a resource not checked out.","resolution":"UNCHECKOUT is only applicable to resources currently checked out. Verify resource state."},{"function":"dav_method_uncheckout","message_template":"Could not UNCHECKOUT resource %s.","reason":"Logs a general error when an UNCHECKOUT operation fails for unspecified reasons.","resolution":"Check server logs for more specific errors, and verify versioning provider configuration."},{"function":"dav_method_checkin","message_template":"The request body, if present, must be a DAV:checkin element.","reason":"Logs an error when a CHECKIN request body is present but not a valid checkin element.","resolution":"Ensure client sends a properly formatted WebDAV CHECKIN request with a checkin root element if a body is included."},{"function":"dav_method_checkin","message_template":"Cannot checkin this type of resource.","reason":"Logs an error when a CHECKIN operation is attempted on an unsupported resource type.","resolution":"CHECKIN is only allowed on regular resources. Check resource type and consider alternative operations."},{"function":"dav_method_checkin","message_template":"Cannot checkin unversioned resource.","reason":"Logs an error when a CHECKIN operation is attempted on a non-versioned resource.","resolution":"Only versioned resources can be checked in. Apply VERSION-CONTROL first."},{"function":"dav_method_checkin","message_template":"The resource is not checked out.","reason":"Logs an error when a CHECKIN operation is attempted on a resource not checked out.","resolution":"Only checked-out resources can be checked in. Perform CHECKOUT first."},{"function":"dav_method_checkin","message_template":"Could not CHECKIN resource %s.","reason":"Logs a general error when a CHECKIN operation fails for unspecified reasons.","resolution":"Check server logs for more specific errors, and verify versioning provider configuration."},{"function":"dav_method_update","message_template":"The request body does not contain an \"update\" element.","reason":"Logs an error when an UPDATE request body doesn't contain the required update element.","resolution":"Ensure client sends a properly formatted WebDAV UPDATE request with an update root element."},{"function":"dav_method_update","message_template":"The \"update\" element does not contain a \"label-name\" or \"version\" element.","reason":"Logs an error when an update element doesn't contain either a label-name or version element.","resolution":"Include either a label-name or version element in the UPDATE request body."},{"function":"dav_method_update","message_template":"Depth must be zero for UPDATE with a version","reason":"Logs an error when an UPDATE request with a version element specifies a non-zero Depth.","resolution":"Use 'Depth: 0' for UPDATE operations with a version element."},{"function":"dav_method_update","message_template":"A \"label-name\" or \"href\" element does not contain any content.","reason":"Logs an error when a label-name or href element in an UPDATE request is empty.","resolution":"Provide label name or version URI content within the respective elements."},{"function":"dav_method_update","message_template":"Version URI had an error.","reason":"Logs an error when the version URI in an UPDATE request is invalid.","resolution":"Check the version URI format and ensure it points to a valid version resource."},{"function":"dav_method_update","message_template":"Could not UPDATE %s.","reason":"Logs a general error when an UPDATE operation fails for unspecified reasons.","resolution":"Check server logs for more specific errors, and verify versioning provider configuration."},{"function":"dav_label_walker","message_template":"<DAV:must-be-version-or-version-selector\/>","reason":"Logs an error when a LABEL operation is attempted on a resource that is neither a version nor a version selector.","resolution":"LABEL operations can only be applied to versions or version selectors. Check resource type and state."},{"function":"dav_label_walker","message_template":"<DAV:must-not-be-checked-out\/>","reason":"Logs an error when a LABEL operation is attempted on a checked-out resource.","resolution":"Check in the resource before applying or modifying labels."},{"function":"dav_method_label","message_template":"The request body does not contain a \"label\" element.","reason":"Logs an error when a LABEL request body doesn't contain the required label element.","resolution":"Ensure client sends a properly formatted WebDAV LABEL request with a label root element."},{"function":"dav_method_label","message_template":"The \"label\" element does not contain an \"add\", \"set\", or \"remove\" element.","reason":"Logs an error when a label element doesn't specify the operation type.","resolution":"Include one of add, set, or remove elements in the LABEL request to specify the operation."},{"function":"dav_method_label","message_template":"The label command element does not contain a \"label-name\" element.","reason":"Logs an error when a LABEL operation element doesn't include a label-name element.","resolution":"Include a label-name element within the add, set, or remove element."},{"function":"dav_method_label","message_template":"A \"label-name\" element does not contain a label name.","reason":"Logs an error when a label-name element in a LABEL request is empty.","resolution":"Provide a non-empty label name within the label-name element."},{"function":"dav_method_label","message_template":"The LABEL operation was terminated prematurely.","reason":"Logs an error when a LABEL operation fails partway through processing multiple resources.","resolution":"Check server logs for more specific errors on individual resources that caused the operation to terminate."},{"function":"dav_method_label","message_template":"Errors occurred during the LABEL operation.","reason":"Logs a general error summary when a LABEL operation had partial failures.","resolution":"Check the multistatus response for details on which resources had errors and why."},{"function":"dav_method_report","message_template":"The request body must specify a report.","reason":"Logs an error when a REPORT request doesn't include a request body.","resolution":"Ensure client sends a properly formatted WebDAV REPORT request with an appropriate report element."},{"function":"dav_method_report","message_template":"Provider encountered an error while streaming a REPORT response.","reason":"Logs an error when the repository provider encounters an error while generating the REPORT response.","resolution":"Check server logs for more specific errors. May indicate resource limitations or provider-specific issues."},{"function":"dav_method_make_workspace","message_template":"The request body does not contain a \"mkworkspace\" element.","reason":"Logs an error when a MKWORKSPACE request body doesn't contain the required mkworkspace element.","resolution":"Ensure client sends a properly formatted WebDAV MKWORKSPACE request with a mkworkspace root element."},{"function":"dav_method_make_workspace","message_template":"<DAV:resource-must-be-null\/>","reason":"Logs an error when a MKWORKSPACE operation targets an existing resource.","resolution":"MKWORKSPACE cannot be used to replace existing resources. Choose a non-existent resource path."},{"function":"dav_method_make_workspace","message_template":"Could not create workspace %s.","reason":"Logs a general error when a MKWORKSPACE operation fails for unspecified reasons.","resolution":"Check server logs for more specific errors, and verify versioning provider configuration."},{"function":"dav_method_make_activity","message_template":"<DAV:resource-must-be-null\/>","reason":"Logs an error when a MKACTIVITY operation targets an existing resource.","resolution":"MKACTIVITY cannot be used to replace existing resources. Choose a non-existent resource path."},{"function":"dav_method_make_activity","message_template":"<DAV:activity-location-ok\/>","reason":"Logs an error when a MKACTIVITY operation targets an invalid location.","resolution":"The repository provider doesn't allow activities at this location. Check repository configuration for activity locations."},{"function":"dav_method_make_activity","message_template":"Could not create activity %s.","reason":"Logs a general error when a MKACTIVITY operation fails for unspecified reasons.","resolution":"Check server logs for more specific errors, and verify versioning provider configuration."},{"function":"dav_method_merge","message_template":"The request body must be present and must be a DAV:merge element.","reason":"Logs an error when a MERGE request doesn't include a proper request body.","resolution":"Ensure client sends a properly formatted WebDAV MERGE request with a merge root element."},{"function":"dav_method_merge","message_template":"The DAV:merge element must contain a DAV:source element.","reason":"Logs an error when a merge element doesn't include a source element.","resolution":"Include a source element in the MERGE request to specify the source to merge from."},{"function":"dav_method_merge","message_template":"The DAV:source element must contain a DAV:href element.","reason":"Logs an error when a source element in a MERGE request doesn't include an href element.","resolution":"Include an href element within the source element to specify the source URI."},{"function":"dav_method_merge","message_template":"Merge source URI had an error.","reason":"Logs an error when the source URI in a MERGE request is invalid.","resolution":"Check the source URI format and ensure it points to a valid resource that can be merged."},{"function":"dav_method_merge","message_template":"Could not MERGE resource \"%s\" into \"%s\".","reason":"Logs a general error when a MERGE operation fails for unspecified reasons.","resolution":"Check server logs for more specific errors, and verify versioning provider configuration and resource states."},{"function":"dav_method_bind","message_template":"The request is missing a Destination header.","reason":"Logs an error when a BIND request doesn't include a Destination header.","resolution":"Modify client to include a Destination header specifying the target URI for the binding."},{"function":"dav_method_bind","message_template":"Cross server bindings are not allowed by this server.","reason":"Logs an error when a BIND operation attempts to create a binding across servers.","resolution":"BIND operations must be within the same server. Use client-side operations for cross-server bindings."},{"function":"dav_method_bind","message_template":"Destination URI had an error.","reason":"Logs an error when the Destination URI in a BIND request is invalid.","resolution":"Check the Destination URI format and ensure it points to a valid location for binding."},{"function":"dav_method_bind","message_template":"Destination URI is handled by a different repository than the source URI. BIND between repositories is not possible.","reason":"Logs an error when a BIND operation attempts to cross repository boundaries.","resolution":"BIND operations must be within the same repository. Use client-side operations for cross-repository bindings."},{"function":"dav_method_bind","message_template":"Destination is not empty and Overwrite is not \"T\"","reason":"Logs an error when a BIND operation targets an existing resource but Overwrite is not set to T.","resolution":"Include 'Overwrite: T' header if you wish to replace existing destination resources with the binding."},{"function":"dav_method_bind","message_template":"Source and Destination URIs are the same.","reason":"Logs an error when a BIND operation has identical source and destination.","resolution":"Specify a different destination URI for the binding. Source and destination cannot be the same."},{"function":"dav_method_bind","message_template":"Could not BIND %s due to a failed precondition on the destination (e.g. locks).","reason":"Logs an error when a BIND operation fails due to lock conflicts or other preconditions on the destination.","resolution":"Ensure the destination resource is not locked by another user, or provide appropriate lock tokens in the If header."},{"function":"dav_method_bind","message_template":"Source collection contains the Destination.","reason":"Logs an error when a BIND operation would create a circular hierarchy.","resolution":"Choose a destination that is not contained within the source collection to avoid circular references."},{"function":"dav_method_bind","message_template":"Destination collection contains the Source and Overwrite has been specified.","reason":"Logs an error when a BIND with Overwrite would delete its own source.","resolution":"This operation is not allowed because it would delete the source before completing. Choose a different destination."},{"function":"dav_method_bind","message_template":"Could not BIND %s.","reason":"Logs a general error when a BIND operation fails for unspecified reasons.","resolution":"Check server logs for more specific errors, and verify binding provider configuration and permissions."},{"function":"dav_method_bind","message_template":"The BIND was successful, but there was a problem automatically checking in the source parent collection.","reason":"Logs a warning when BIND succeeded but versioning operations on the parent failed.","resolution":"This is informational - the binding was created but versioning updates may be incomplete. Check versioning configuration if this persists."},{"function":"dav_handler","message_template":"buggy client used un-escaped hash in Request-URI %s in method %d","reason":"Logs a warning when a client sends a request with an unescaped hash character in the URI, which could lead to unexpected behavior.","resolution":"Update client software to properly escape hash (#) characters in URIs. Server rejects these requests for safety."}],"project":"apache\/httpd"}