{"module":"mod_dav_prop.c","summary":"This module implements WebDAV property database handling for Apache's mod_dav, providing methods to store, retrieve, and manage WebDAV properties for resources. It supports both live properties (dynamically generated) and dead properties (stored in a database), handling property operations like PROPFIND and PROPPATCH.","logs":[{"function":"dav_insert_coreprop","message_template":"DAV:lockdiscovery could not be determined due to a problem fetching the locks for this resource.","reason":"This error occurs when there's a problem querying the lock database to generate the lockdiscovery property. Likely due to database access issues or corruption.","resolution":"Check the lock database for corruption issues. Ensure proper permissions for the web server to access the lock database. May require restarting the web server or rebuilding the lock database if issues persist."},{"function":"dav_really_open_db","message_template":"Could not open the property database.","reason":"Failure to open the property database for reading or writing WebDAV properties. May be due to permission issues, database corruption, or filesystem problems.","resolution":"Verify file permissions on the property database files. Check for disk space issues. May need to rebuild the property database if it's corrupted."},{"function":"dav_popen_propdb","message_template":"INTERNAL DESIGN ERROR: resource must define its URI.","reason":"An internal error indicating that a resource object was passed without a defined URI, which is a required field for resource objects.","resolution":"This is a code-level error that should be reported to developers. It indicates a bug in the mod_dav implementation or in a module using the DAV API incorrectly."},{"function":"dav_insert_liveprop","message_template":"INTERNAL DESIGN ERROR: insert_liveprop did not insert what was asked for.","reason":"An internal implementation error where the insert_liveprop function didn't perform the requested insertion operation correctly.","resolution":"This indicates a bug in the mod_dav code or in a module implementing the liveprop interface. It should be reported to developers. No user-level configuration fix is available."},{"function":"dav_prop_validate","message_template":"Property is read-only.","reason":"User attempted to set or delete a WebDAV property that is defined as read-only. This happens when clients try to modify protected properties like DAV:lockdiscovery or DAV:supportedlock.","resolution":"This is a client error. The WebDAV client needs to be modified to avoid setting read-only properties. No server-side configuration change is needed."},{"function":"dav_prop_validate","message_template":"Attempted to set\/remove a property without a valid, open, read\/write property database.","reason":"The code tried to modify a property but the property database is not open in read\/write mode or doesn't exist. This could happen due to permission issues or database corruption.","resolution":"Check file permissions on the property database directory. Ensure the user running the web server has write access. May need to initialize the database if it doesn't exist."},{"function":"dav_prop_exec","message_template":"Could not execute PROPPATCH.","reason":"Failed to execute a PROPPATCH operation to set or remove properties. This is a general error that could be caused by various underlying issues like database problems or invalid property data.","resolution":"Check the server logs for more specific errors that might be related. Verify database permissions and integrity. Might require database repair or recreation if the issue persists."},{"function":"dav_prop_rollback","message_template":"Specifying the removal of a property that does not exist is not an error","reason":"This is actually an informational message citing the HTTP specification, noting that attempting to delete a non-existent property is not considered an error according to RFC 4918.","resolution":"No action required. This is an informational message referring to the WebDAV specification rather than an actual error condition."}],"project":"apache\/httpd"}