{"module":"mod_dav_util.c","summary":"Core utility functions for the Apache WebDAV module, providing HTTP validation, If-header processing, lock verification, and auto-versioning support for WebDAV resources.","logs":[{"function":"dav_lookup_uri","message_template":"Invalid syntax in Destination URI.","reason":"The URI provided in the Destination header could not be parsed correctly, possibly due to malformed syntax.","resolution":"Verify the client is sending a properly formatted URI in the Destination header that follows RFC 3986 standards."},{"function":"dav_lookup_uri","message_template":"Destination URI must be an absolute URI.","reason":"The WebDAV specification requires Destination URIs to be absolute (containing scheme, host, etc.) but a relative URI was provided.","resolution":"Update the client to use absolute URIs in the Destination header, including scheme, host, and path components."},{"function":"dav_lookup_uri","message_template":"Destination URI contains invalid components (a query or a fragment).","reason":"WebDAV Destination URIs should not contain query parameters or fragment identifiers.","resolution":"Remove query parameters and fragment identifiers from the Destination URI."},{"function":"dav_lookup_uri","message_template":"Destination URI refers to different scheme or port (%s:\/\/hostname:%d)(want: %s:\/\/hostname:%d)","reason":"The Destination URI specified a different protocol scheme or port than the current request.","resolution":"Ensure the Destination URI uses the same scheme and port as the current request."},{"function":"dav_lookup_uri","message_template":"Destination URI refers to a different server.","reason":"WebDAV operations cannot be performed across different servers.","resolution":"Use a Destination URI that refers to the same server as the request."},{"function":"dav_validate_resource_state","message_template":"The locks could not be queried for verification against a possible \"If:\" header.","reason":"The server encountered an error when attempting to query the lock database.","resolution":"Check server logs for database errors, verify lock database configuration, and ensure it is accessible."},{"function":"dav_validate_resource_state","message_template":"Existing lock(s) on the requested resource prevent an exclusive lock.","reason":"The resource already has one or more locks, and an exclusive lock was requested.","resolution":"Wait for existing locks to be released or request a shared lock instead of an exclusive lock."},{"function":"dav_validate_resource_state","message_template":"The requested resource is already locked exclusively.","reason":"An attempt was made to place a shared lock on a resource that already has an exclusive lock.","resolution":"Wait for the exclusive lock to be released before applying a new lock."},{"function":"dav_validate_resource_state","message_template":"This resource is locked and an \"If:\" header was not supplied to allow access to the resource.","reason":"The resource has an active lock but the request did not include an If header with the appropriate lock token.","resolution":"Include an If header with the correct lock token to access the locked resource."},{"function":"dav_validate_resource_state","message_template":"The locktoken specified in the \"Lock-Token:\" header is invalid because this resource has no outstanding locks.","reason":"A Lock-Token header was provided for a resource that doesn't have any locks.","resolution":"Verify the resource path and ensure you're referencing the correct locked resource."},{"function":"dav_process_if_header","message_template":"Invalid If-header: unclosed \"<\" or unexpected tagged-list production.","reason":"The If header syntax contained an unclosed URI tag or was malformed.","resolution":"Fix the client to properly format the If header according to WebDAV specifications."},{"function":"dav_process_if_header","message_template":"Invalid URI in tagged If-header.","reason":"The If header contained a URI that could not be parsed correctly.","resolution":"Ensure URIs in the If header are properly formatted and encoded."},{"function":"dav_process_if_header","message_template":"Invalid URI path tagged If-header.","reason":"The path component of a URI in the If header was invalid.","resolution":"Check for malformed path components in If header URIs and ensure proper path normalization."},{"function":"dav_process_if_header","message_template":"Invalid percent encoded URI in tagged If-header.","reason":"The URI in the If header contained invalid percent-encoding sequences.","resolution":"Ensure all percent-encoded characters in the URI follow RFC 3986 standards."},{"function":"dav_process_if_header","message_template":"Invalid If-header: unclosed \"(\".","reason":"The If header syntax contained an unclosed parenthesis in a list production.","resolution":"Ensure all opening parentheses in the If header have matching closing parentheses."},{"function":"dav_process_if_header","message_template":"Internal server error parsing \"If:\" header.","reason":"An unexpected internal error occurred while parsing the If header.","resolution":"Check server logs for additional details and report the issue to the server administrator."},{"function":"dav_process_if_header","message_template":"Invalid \"If:\" header: Multiple \"not\" entries for the same state.","reason":"The If header contained multiple negation operators for a single state token.","resolution":"Fix the client to use at most one Not operator per state token in If headers."},{"function":"dav_process_if_header","message_template":"Invalid \"If:\" header: Unexpected character in List","reason":"The If header contained an unexpected character in a list production.","resolution":"Ensure the If header follows the proper syntax according to RFC 4918."},{"function":"dav_process_if_header","message_template":"Invalid \"If:\" header: Unexpected character encountered (0x%02x, '%c').","reason":"The parser encountered an unexpected character while processing the If header.","resolution":"Check the If header for invalid characters and ensure it follows the WebDAV specification."},{"function":"dav_validate_resource_state","message_template":"an entity-tag was specified, but the resource's actual ETag does not match.","reason":"An If header specified an entity tag (ETag) that does not match the resource's current ETag.","resolution":"Update the client's cached ETag or modify the If header conditions to match the current resource state."},{"function":"dav_validate_resource_state","message_template":"an entity-tag was specified using the \"Not\" form, but the resource's actual ETag matches the provided entity-tag.","reason":"An If header used a Not condition with an entity tag that matches the resource's current ETag.","resolution":"Update the client's understanding of the resource state or modify the If header conditions."},{"function":"dav_validate_resource_state","message_template":"a State-token was supplied, but a lock database is not available for to provide the required lock.","reason":"The request included a lock token in the If header, but the server couldn't access the lock database.","resolution":"Verify the lock database configuration and ensure it's properly accessible to the server."},{"function":"dav_validate_resource_state","message_template":"User \"%s\" submitted a locktoken created by user \"%s\".","reason":"A user attempted to use a lock token that was created by a different user, which is not allowed.","resolution":"Ensure that only the user who created a lock is attempting to use that lock token."},{"function":"dav_validate_resource_state","message_template":"a State-token was supplied, which used a \"Not\" condition. The State-token was found in the locks on this resource","reason":"The If header used a Not condition for a state token that actually exists in the resource's locks.","resolution":"Update the client's understanding of the lock state or modify the If header conditions."},{"function":"dav_validate_resource_state","message_template":"a State-token was supplied, but it was not found in the locks on this resource.","reason":"The If header specified a lock token that doesn't match any of the resource's current locks.","resolution":"Verify the client is using the correct lock token for the resource."},{"function":"dav_validate_resource_state","message_template":"an unknown state token was supplied","reason":"The If header included a state token that the server doesn't recognize.","resolution":"Ensure the client is using valid state tokens in If headers."},{"function":"dav_validate_resource_state","message_template":"This resource is locked and the \"If:\" header did not specify one of the locktokens for this resource's lock(s).","reason":"The resource has an active lock, but the If header didn't include the appropriate lock token.","resolution":"Include the correct lock token in the If header to access the locked resource."},{"function":"dav_validate_resource_state","message_template":"The locktoken specified in the \"Lock-Token:\" header did not specify one of this resource's locktoken(s).","reason":"An UNLOCK request provided a lock token that doesn't match any lock on the resource.","resolution":"Verify the Lock-Token header contains the correct lock token for the resource."},{"function":"dav_validate_resource_state","message_template":"The preconditions specified by the \"If:\" header did not match this resource.","reason":"The conditions in the If header were not satisfied for this resource.","resolution":"Update the client's understanding of the resource state or modify the If header conditions."},{"function":"dav_validate_resource_state","message_template":"The precondition(s) specified by the \"If:\" header did not match this resource. At least one failure is because: %s","reason":"One or more specific conditions in the If header failed to match the resource state.","resolution":"Address the specific condition failure described in the error message."},{"function":"dav_validate_request","message_template":"DESIGN ERROR: dav_validate_request called with depth>0, but no response ptr.","reason":"Internal programming error where the validation function was called with invalid parameters.","resolution":"This is a server code issue and should be reported to the developers."},{"function":"dav_validate_request","message_template":"Cannot access parent of repository root.","reason":"An attempt was made to access the parent of the repository root, which doesn't exist.","resolution":"Modify the request to not attempt to access above the repository root."},{"function":"dav_validate_request","message_template":"A validation error has occurred on the parent resource, preventing the operation on the resource specified by the Request-URI.","reason":"The parent resource of the requested resource failed validation checks.","resolution":"Address the specific validation issues with the parent resource as described in the error details."},{"function":"dav_validate_request","message_template":"An error occurred on another resource, preventing the requested operation on this resource.","reason":"A validation error on a related resource prevented the operation from completing.","resolution":"Address the validation issues with the related resources as described in the multistatus response."},{"function":"dav_validate_request","message_template":"Error(s) occurred on resources during the validation process.","reason":"Multiple resources failed validation during a multi-resource operation.","resolution":"Review the multistatus response for details on specific resources and their errors."},{"function":"dav_get_locktoken_list","message_template":"No locktokens were specified in the \"If:\" header, so the refresh could not be performed.","reason":"A lock refresh was attempted but no lock tokens were found in the If header.","resolution":"Include appropriate lock tokens in the If header when attempting to refresh locks."},{"function":"dav_can_auto_checkout","message_template":"Auto-checkout is only enabled for locked resources, but there is no lock provider.","reason":"The server is configured to allow auto-checkout only for locked resources, but no lock provider is available.","resolution":"Configure a lock provider or change the auto-versioning configuration."},{"function":"dav_can_auto_checkout","message_template":"Cannot open lock database to determine auto-versioning behavior.","reason":"The server couldn't access the lock database to check if auto-versioning should be applied.","resolution":"Verify lock database configuration and ensure it's accessible to the server."},{"function":"dav_can_auto_checkout","message_template":"The locks could not be queried for determining auto-versioning behavior.","reason":"An error occurred when querying the lock database for auto-versioning decisions.","resolution":"Check server logs for database errors and ensure lock database is functioning properly."},{"function":"dav_auto_checkout","message_template":"Missing one or more intermediate collections. Cannot create resource %s.","reason":"An attempt was made to create a resource but one or more parent collections in the path don't exist.","resolution":"Create the necessary parent collections before creating the resource."},{"function":"dav_auto_checkout","message_template":"<DAV:cannot-modify-checked-in-parent>","reason":"An attempt was made to modify a collection that is checked in and auto-checkout is not enabled.","resolution":"Manually checkout the parent collection before modifying it or enable auto-checkout."},{"function":"dav_auto_checkout","message_template":"Unable to auto-checkout parent collection. Cannot create resource %s.","reason":"The server failed to automatically checkout the parent collection when creating a resource.","resolution":"Manually checkout the parent collection or check error logs for specific checkout failure reasons."},{"function":"dav_auto_checkout","message_template":"Unable to create versioned resource %s.","reason":"The server failed to create a version-controlled resource.","resolution":"Check server logs for specific version control errors."},{"function":"dav_auto_checkout","message_template":"<DAV:cannot-modify-version-controlled-content>","reason":"An attempt was made to modify a version-controlled resource that is checked in.","resolution":"Checkout the resource before modifying it or enable auto-checkout."},{"function":"dav_auto_checkout","message_template":"Unable to checkout resource %s.","reason":"The server failed to automatically checkout a resource.","resolution":"Check server logs for specific checkout errors or attempt a manual checkout."},{"function":"dav_auto_checkin","message_template":"Unable to undo auto-checkout of resource %s.","reason":"The server failed to undo an automatic checkout after an error occurred.","resolution":"The resource may remain checked out; manually undo the checkout if necessary."},{"function":"dav_auto_checkin","message_template":"Unable to undo auto-version-control of resource %s.","reason":"The server failed to remove version control from a resource after an error.","resolution":"The resource may remain under version control; manually remove it if necessary."},{"function":"dav_auto_checkin","message_template":"Unable to undo auto-checkout of parent collection %s.","reason":"The server failed to undo an automatic checkout of a parent collection after an error.","resolution":"The parent collection may remain checked out; manually undo the checkout if necessary."},{"function":"dav_auto_checkin","message_template":"Unable to auto-checkin resource %s.","reason":"The server failed to automatically check in a resource.","resolution":"Manually check in the resource or check server logs for specific checkin errors."},{"function":"dav_auto_checkin","message_template":"Unable to auto-checkin parent collection %s.","reason":"The server failed to automatically check in a parent collection.","resolution":"Manually check in the parent collection or check server logs for specific checkin errors."}],"project":"apache\/httpd"}