{"module":"mod_dav_lock.c","summary":"This module implements generic DAV lock functionality for Apache. It provides a DBM-based storage mechanism for WebDAV locks, supporting both direct and indirect locks with various scopes and types.","logs":[{"function":"dav_generic_dbm_new_error","message_template":"Could not open property database.","reason":"Failed to open the DBM property database. This occurs when the database file cannot be opened or created.","resolution":"Check file permissions, directory existence, and ensure the web server has write access to the location specified in DAVGenericLockDB directive."},{"function":"dav_generic_parse_locktoken","message_template":"The lock token uses an unknown State-token format and could not be parsed.","reason":"Received a lock token that doesn't use the expected 'opaquelocktoken:' prefix format. This happens when clients send malformed or non-standard lock tokens.","resolution":"Check the client application for compliance with WebDAV standards. This is typically a client-side issue."},{"function":"dav_generic_parse_locktoken","message_template":"The opaquelocktoken has an incorrect format and could not be parsed.","reason":"The lock token uses the correct prefix but has invalid UUID format. This occurs when clients send tokens with the right scheme but malformed content.","resolution":"Check the client application for compliance with WebDAV standards. The token should follow the opaquelocktoken scheme with a valid UUID."},{"function":"dav_generic_really_open_lockdb","message_template":"mod_dav_lock: The DBM library '%s' could not be loaded: %s","reason":"The required DBM library failed to load. This can occur due to missing libraries or incompatible versions.","resolution":"Ensure the required DBM library is installed and compatible with your Apache version. Check system dependencies and Apache configuration."},{"function":"dav_generic_really_open_lockdb","message_template":"Could not load library for property database.","reason":"Failed to load the required database library. This is a more generic version of the previous error.","resolution":"Verify APR DBM support is properly installed and configured with Apache."},{"function":"dav_generic_really_open_lockdb","message_template":"Could not open the lock database.","reason":"The lock database file could not be opened. This could be due to filesystem permissions, missing directories, or corruption.","resolution":"Check that the path specified in DAVGenericLockDB exists and is writable by the Apache process."},{"function":"dav_generic_open_lockdb","message_template":"A lock database was not specified with the DAVGenericLockDB directive. One must be specified to use the locking functionality.","reason":"The DAVGenericLockDB directive is missing from the configuration. This occurs when WebDAV locking is used without proper configuration.","resolution":"Add the DAVGenericLockDB directive to your Apache configuration, specifying a valid path for the lock database."},{"function":"dav_generic_save_lock_record","message_template":"INTERNAL DESIGN ERROR: the lockdb was opened readonly, but an attempt to save locks was performed.","reason":"Internal logic error where the code attempts to write to a database opened in read-only mode. This is a programming error in the module.","resolution":"This is likely a bug in the module. Report the issue to Apache with steps to reproduce. As a workaround, ensure proper write permissions for the lock database."},{"function":"dav_generic_save_lock_record","message_template":"Could not save lock information.","reason":"Failed to write lock data to the database. This could be due to disk space, permissions, or database corruption.","resolution":"Check disk space, file permissions, and ensure the web server has write access to the lock database file."},{"function":"dav_generic_load_lock_record","message_template":"The lock database was found to be corrupt. offset %, c=%02x","reason":"Database corruption detected while reading lock records. This occurs when the database file has been damaged.","resolution":"You may need to delete and recreate the lock database file. Back up the file first if you need to recover lock information."},{"function":"dav_generic_resolve","message_template":"The lock database was found to be corrupt. An indirect lock's direct lock could not be found.","reason":"Database integrity issue where an indirect lock references a non-existent direct lock. This indicates database corruption or synchronization issues.","resolution":"The lock database may need to be reset. This could happen after a server crash or abrupt shutdown. Consider backing up and recreating the database."},{"function":"dav_generic_get_locks","message_template":"INTERNAL DESIGN ERROR: DAV_GETLOCKS_COMPLETE is not yet supported","reason":"An unsupported lock operation was requested. This indicates a programming error where code is calling an unimplemented function.","resolution":"This is a bug in the software using the lock module. Report the issue to the developers. The feature is likely planned but not yet implemented."}],"project":"apache\/httpd"}