{"project":"sendmail","module":"vacation.c","summary":"The vacation module handles automatic email responses for users who are away. It processes incoming emails, filters out automated messages, and sends customized replies while maintaining a database to prevent sending multiple replies to the same sender within a configurable interval.","logs":[{"function":"main","message_template":"vacation: can't allocate memory for alias","reason":"Logs when memory allocation for an alias structure fails in the main function, preventing proper operation of the vacation program.","resolution":"Increase system memory availability or reduce memory usage by other processes. May require system resource tuning."},{"function":"main","message_template":"vacation: no such user uid %u","reason":"Logs when the system cannot find a user corresponding to the current UID, typically when running in certain modes.","resolution":"Verify the user exists in the password database. May require recreating the user account or fixing corrupted user database entries."},{"function":"main","message_template":"vacation: no such directory %s","reason":"Logs when the user's home directory cannot be accessed, preventing the program from functioning correctly.","resolution":"Check if the directory exists and has appropriate permissions. Create the directory if missing or adjust permissions as needed."},{"function":"main","message_template":"vacation: -U requires setting both -f and -m","reason":"Logs when the -U option is used without specifying both a database file (-f) and a message file (-m).","resolution":"Add the required -f and -m parameters when using the -U option in the command line."},{"function":"main","message_template":"vacation: can't open mailbox database: %s","reason":"Logs when the mailbox database specified in the configuration cannot be opened, which prevents identifying user information.","resolution":"Verify the mailbox database exists and is accessible. Check configuration in sendmail.cf and ensure database service is running properly."},{"function":"main","message_template":"vacation: no such user %s","reason":"Logs when the specified user is not found in the mailbox database, indicating an invalid username parameter.","resolution":"Verify the username exists in the system. May require creating the user or checking for spelling errors in the command."},{"function":"main","message_template":"vacation: can't read mailbox database: %s","reason":"Logs when the mailbox database exists but cannot be read, which may be due to permission issues or database corruption.","resolution":"Check permissions on the mailbox database files. Repair or rebuild the database if it appears to be corrupted."},{"function":"main","message_template":"vacation: can't allocate memory for username","reason":"Logs when memory allocation for storing the username fails, preventing the program from proceeding.","resolution":"Increase available system memory or reduce system load. May require system tuning or upgrading hardware resources."},{"function":"main","message_template":"vacation: %s: %s","reason":"Logs when there's an error related to the database file, where the first parameter is the filename and the second is the error message.","resolution":"Check the specific error message for guidance. Typically involves file permissions, disk space, or database corruption issues."},{"function":"readheaders","message_template":"vacation: badly formatted \"%s\" line","reason":"Logs when parsing an email header and encounters a syntax error, likely due to malformed email headers.","resolution":"This usually indicates invalid or corrupted email headers and doesn't require user action. If persistent, examine mail server for configuration issues."},{"function":"readheaders","message_template":"vacation: no initial \"From \" line","reason":"Logs when processing an email that doesn't have the required 'From ' line, preventing identification of the sender.","resolution":"This indicates an improperly formatted email. If recurring, check the mail server configuration or upstream mail relay services."},{"function":"sendmessage","message_template":"vacation: no %s file","reason":"Logs when the vacation message file cannot be found at the specified absolute path.","resolution":"Create the specified message file with appropriate content for vacation replies. Ensure correct path and permissions."},{"function":"sendmessage","message_template":"vacation: no ~%s\/%s file","reason":"Logs when the vacation message file cannot be found in the user's home directory.","resolution":"Create the message file in the user's home directory. Typically, users should create a .vacation.msg file with their auto-reply message."},{"function":"sendmessage","message_template":"vacation: pipe: %s","reason":"Logs when creating a pipe to sendmail fails, preventing the vacation message from being sent.","resolution":"Check system resources like file descriptors. May indicate a system under heavy load or resource exhaustion."},{"function":"sendmessage","message_template":"vacation: fork: %s","reason":"Logs when the fork system call fails, preventing the creation of a child process to send the vacation message.","resolution":"Check system resource limits and process count. May require increasing system limits or reducing system load."},{"function":"sendmessage","message_template":"vacation: can't exec %s: %s","reason":"Logs when execution of the sendmail program fails, preventing the vacation message from being sent.","resolution":"Verify sendmail binary exists and is executable. Check path configuration and permissions on the sendmail executable."},{"function":"sendmessage","message_template":"vacation: can't open pipe to sendmail","reason":"Logs when opening a file stream to the sendmail pipe fails, preventing the vacation message from being sent.","resolution":"Check system resources and file descriptor limits. May indicate a system under heavy load or resource exhaustion."},{"function":"usage","message_template":"uid %u: usage: vacation [-a alias] [-C cfpath] [-d] [-f db] [-i] [-j] [-l] [-m msg] [-R returnaddr] [-r interval] [-s sender] [-t time] [-U] [-x] [-z] login","reason":"Logs the correct usage when incorrect command line arguments are provided.","resolution":"Follow the usage instructions provided in the message. Correct the command line arguments according to the syntax shown."},{"function":"listdb","message_template":"vacation: set cursor: %s","reason":"Logs when setting up a database cursor fails while trying to list the vacation database contents.","resolution":"Check database file integrity and permissions. May require rebuilding the vacation database."},{"function":"listdb","message_template":"vacation: %.*s invalid time stamp","reason":"Logs when an entry in the vacation database has an invalid timestamp format.","resolution":"The database may be corrupted. Consider reinitializing the vacation database with the -i option."},{"function":"listdb","message_template":"vacation: get value at cursor: %s","reason":"Logs when retrieving a value at the current cursor position fails while listing the database.","resolution":"Check database file integrity. May indicate corruption requiring database repair or regeneration using the -i option."}]}