{"module":"ap_mpm.h","summary":"The Apache Multi-Processing Module (MPM) header defines interfaces for managing server processes, threads, and handling various server lifecycle events. It provides APIs for process control, state management, and exception handling that implementations use to handle the server's concurrency model.","logs":[{"function":"ap_mpm_query","message_template":"MPM query failed or not implemented","reason":"This function may fail if an MPM-query hook has not been registered or if the requested query is not implemented by the current MPM.","resolution":"Check if the MPM supports the requested query code or ensure that the MPM has properly registered its hooks."},{"function":"ap_os_create_privileged_process","message_template":"Failed to create privileged process","reason":"The attempt to create a process with elevated privileges failed, possibly due to insufficient permissions or resource constraints.","resolution":"Check the server's user permissions, ensure proper configuration for privilege escalation, and verify that system resources are available."},{"function":"ap_mpm_resume_suspended","message_template":"Resume suspended connection failed","reason":"The MPM was unable to resume a suspended connection, likely because the operation is not supported by the current MPM or the connection is in an invalid state.","resolution":"Check if the current MPM supports connection suspension (Event MPM) and ensure the connection is in a valid state."},{"function":"ap_mpm_register_timed_callback","message_template":"Failed to register timed callback","reason":"Registration of a timed callback function failed, possibly because the MPM doesn't support this functionality.","resolution":"Check if the current MPM supports timed callbacks (primarily supported in Event MPM) and adjust server configuration accordingly."},{"function":"ap_mpm_register_poll_callback","message_template":"Failed to register poll callback","reason":"Registration of a poll callback for socket\/pipe monitoring failed, possibly due to resource limitations or lack of MPM support.","resolution":"Verify that the MPM supports asynchronous I\/O operations and check system resources for poll set limitations."},{"function":"ap_mpm_register_poll_callback_timeout","message_template":"Failed to register poll callback with timeout","reason":"Registration of a poll callback with timeout functionality failed, likely due to resource constraints or MPM limitations.","resolution":"Ensure the MPM supports asynchronous operations with timeouts and check for system resource constraints."},{"function":"child_status","message_template":"Child process state changed","reason":"Logs changes in MPM child process states (started, exited, or lost slot), which helps track process lifecycle management.","resolution":"Informational log; however, frequent child process restarts might indicate configuration issues or resource constraints."},{"function":"end_generation","message_template":"Server generation completed","reason":"Indicates that all child processes of a particular server generation have exited, typically during graceful restart operations.","resolution":"Informational log; no resolution required unless generations are ending unexpectedly, which could indicate configuration problems."},{"function":"fatal_exception","message_template":"Fatal exception in child process","reason":"A child process encountered a fatal exception (crash), which triggered the exception hook (requires EnableExceptionHook directive).","resolution":"Investigate the cause of the crash using any additional diagnostic information in the log. May require code fixes, configuration changes, or addressing resource issues."}],"project":"apache\/httpd"}