{"module":"ap_socache.h","summary":"Defines an interface for small object cache providers in Apache HTTP Server. The module provides function prototypes for creating, initializing, managing, and querying cache instances that can be implemented by different cache backends.","logs":[{"function":"create","message_template":"Error creating cache instance: %s","reason":"Returned when the cache instance cannot be created with the specified configuration. Likely due to invalid configuration parameters or resource limitations.","resolution":"Check the configuration string passed to the cache provider and ensure it follows the provider's requirements. Verify that the system has sufficient resources for the cache."},{"function":"init","message_template":"Initializing cache with name: %s","reason":"Informational message when a cache is being initialized with a specific name (like 'mod_ssl-sess').","resolution":"Information log, no resolution required."},{"function":"init","message_template":"Cache initialization failed","reason":"Logged when cache initialization fails, possibly due to filesystem permissions or resource constraints.","resolution":"Check server permissions, available disk space, and other resources needed by the specific cache implementation."},{"function":"store","message_template":"Failed to store object in cache","reason":"Occurs when an object cannot be stored in the cache, possibly due to size limitations or storage errors.","resolution":"Check cache configuration, increase cache size if needed, or investigate storage subsystem issues."},{"function":"retrieve","message_template":"Object not found in cache: APR_NOTFOUND","reason":"Logged when a requested object is not found in the cache, which may be normal but could indicate premature expiration.","resolution":"If objects are consistently missing from cache, consider adjusting cache size or expiry settings."},{"function":"remove","message_template":"Failed to remove object from cache","reason":"Occurs when an object cannot be removed from the cache, possibly due to file system issues or concurrency problems.","resolution":"Check filesystem permissions and health, and investigate if concurrent access issues might be occurring."},{"function":"status","message_template":"Cache statistics: usage=%d%, items=%d","reason":"Informational output showing cache usage statistics through mod_status.","resolution":"Information log, no resolution required unless usage is very high, in which case consider increasing cache size."},{"function":"iterate","message_template":"Cache iteration failed","reason":"Occurs when the cache cannot be iterated through, possibly due to internal errors or resource limitations.","resolution":"Check system resources and cache backend health. May require restarting the server if cache is corrupted."}],"project":"apache\/httpd"}