{"module":"apreq_cookie.h","summary":"This header file defines the API for cookie handling in the Apache Request library, providing structures and functions for managing HTTP cookies according to Netscape and RFC specifications. It includes functionality for parsing cookie headers, creating cookies, and serializing cookies for HTTP responses.","logs":[{"function":"apreq_parse_cookie_header","message_template":"APREQ_ERROR_BADSEQ","reason":"Failed to parse cookie header due to an unparsable character sequence. Likely caused by malformed cookie data in the request.","resolution":"Check the format of cookies being sent from clients. This might indicate a client sending malformed data or a potential attempt at cookie manipulation."},{"function":"apreq_parse_cookie_header","message_template":"APREQ_ERROR_MISMATCH","reason":"An RFC cookie attribute appeared in a Netscape cookie header, indicating a mixing of cookie specifications.","resolution":"Check client implementations to ensure they're using consistent cookie specifications. May require updating client code to use the correct cookie format."},{"function":"apreq_parse_cookie_header","message_template":"APR_ENOTIMPL","reason":"An unrecognized RFC cookie attribute was encountered during parsing.","resolution":"Check for non-standard cookie attributes or update the cookie parser to handle new or custom attributes that might be in use."},{"function":"apreq_parse_cookie_header","message_template":"APREQ_ERROR_NOTOKEN","reason":"A required token was missing during cookie header parsing, indicating malformed cookie data.","resolution":"Check cookie format from clients. This error often occurs when cookie name-value pairs are improperly formatted."},{"function":"apreq_parse_cookie_header","message_template":"APREQ_ERROR_BADCHAR","reason":"An unexpected character token was present in the cookie header, indicating invalid cookie format.","resolution":"Validate cookie input from clients. This could indicate a potential security issue with maliciously crafted cookies."},{"function":"apreq_cookie_serialize","message_template":"len = 0","reason":"Special case when buffer length is zero, used to calculate the required buffer size without actually writing to the buffer.","resolution":"This is an informational case, not an error. If seen in logs, it indicates normal operation of the size calculation feature."},{"function":"apreq_cookie_expires","message_template":"expires","reason":"Setting the 'expires' attribute of a cookie, which determines when browsers will delete the cookie.","resolution":"Informational only. If issues with cookie expiration occur, check the time format strings being passed to this function."},{"function":"apreq_cookie_expires","message_template":"max-age","reason":"Setting the 'max-age' attribute of an RFC cookie, which specifies the cookie's lifetime in seconds.","resolution":"Informational only. For issues with cookie lifetimes, verify the time values being used when creating cookies."}],"project":"apache\/httpd"}