{"module":"apreq_error.h","summary":"This header file defines error codes and error handling for the Apache Request (APREQ) library. It provides a function to translate error codes into human-readable messages and defines a set of specific error codes for various conditions.","logs":[{"function":"apreq_strerror","message_template":"Internal apreq error","reason":"A general internal error occurred in the APREQ library. This is a fallback error when no more specific error can be identified.","resolution":"Check application logs for more detailed error messages. Review recent changes to APREQ-related configurations."},{"function":"apreq_strerror","message_template":"Attempted to perform unsafe action with tainted data","reason":"An operation was attempted with data that has been marked as tainted, which could potentially lead to security issues.","resolution":"Review the input validation in your application. Ensure proper sanitization of user inputs before they are processed."},{"function":"apreq_strerror","message_template":"Parsing interrupted","reason":"The parsing process was interrupted before completion, possibly due to a timeout or manual intervention.","resolution":"Check for timeouts or other constraints that might be causing the interruption. Consider increasing timeout limits if appropriate."},{"function":"apreq_strerror","message_template":"Invalid input data","reason":"The input data provided to a function is invalid or malformed.","resolution":"Verify the format and content of input data. Ensure it meets the expected requirements."},{"function":"apreq_strerror","message_template":"Invalid character","reason":"An invalid character was encountered during parsing or processing.","resolution":"Check input data for special characters or encoding issues. Ensure data is properly encoded."},{"function":"apreq_strerror","message_template":"Invalid byte sequence","reason":"An invalid sequence of bytes was encountered, possibly due to encoding issues.","resolution":"Verify character encoding of input data. Ensure consistent encoding across all systems."},{"function":"apreq_strerror","message_template":"Invalid attribute","reason":"An attribute in the input data is invalid or does not conform to expected format.","resolution":"Check the structure and format of attributes in input data. Refer to documentation for correct attribute formats."},{"function":"apreq_strerror","message_template":"Invalid header","reason":"A header in the input data is invalid or malformed.","resolution":"Verify HTTP headers for proper format. Check for improperly formatted or oversized headers."},{"function":"apreq_strerror","message_template":"Invalid utf8 encoding","reason":"The input data contains improperly encoded UTF-8 characters.","resolution":"Ensure all text is properly UTF-8 encoded. Check for character set conversion issues."},{"function":"apreq_strerror","message_template":"Missing input data","reason":"Required input data is missing for the operation to proceed.","resolution":"Ensure all required data is provided for the operation. Check for empty or null inputs."},{"function":"apreq_strerror","message_template":"Missing required token","reason":"A required token is missing from the input data, such as in a parse operation.","resolution":"Check the input format for missing tokens or delimiters. Refer to documentation for required format."},{"function":"apreq_strerror","message_template":"Missing attribute","reason":"A required attribute is missing from the input data.","resolution":"Ensure all required attributes are present in the input. Check documentation for mandatory attributes."},{"function":"apreq_strerror","message_template":"Missing header","reason":"A required header is missing from the input data.","resolution":"Verify all required HTTP headers are present in the request. Check documentation for mandatory headers."},{"function":"apreq_strerror","message_template":"Missing parser","reason":"No appropriate parser was found for the given input data.","resolution":"Ensure appropriate parser configuration. Verify content type matches available parsers."},{"function":"apreq_strerror","message_template":"Conflicting information","reason":"The input data contains conflicting information that cannot be reconciled.","resolution":"Check for inconsistent data in the input. Resolve conflicts in configuration or input data."},{"function":"apreq_strerror","message_template":"Exceeds configured maximum limit","reason":"The input data exceeds a configured maximum limit, such as file size or parameter count.","resolution":"Adjust the relevant configuration limits if appropriate, or reduce the size of input data."},{"function":"apreq_strerror","message_template":"Below configured minimum limit","reason":"The input data is below a configured minimum limit.","resolution":"Check if input data meets minimum size or count requirements. Adjust configuration if needed."},{"function":"apreq_strerror","message_template":"Setting already configured","reason":"An attempt was made to configure a setting that is already set.","resolution":"Review configuration code to avoid redundant settings. Clear settings before reconfiguring if needed."}],"project":"apache\/httpd"}