{"module":"http_config.h","summary":"Apache HTTP server configuration header file defining data structures and functions for configuration parsing, command handling, and module management. It provides the core interfaces for directives processing and module initialization.","logs":[{"function":"ap_set_deprecated","message_template":"The Foo directive is no longer supported, use Bar","reason":"This message is generated when a deprecated directive is used in the configuration. The example shows a 'Foo' directive that has been replaced by 'Bar'.","resolution":"Update configuration files to use the recommended replacement directive instead of the deprecated one. In this example, replace 'Foo' with 'Bar' in all configuration files."},{"function":"ap_pcfg_strerror","message_template":"Configuration file error","reason":"This function converts configuration file error codes to human-readable strings when errors occur during configuration processing.","resolution":"Check the specific error message for details. Typically, this involves fixing syntax errors in configuration files or addressing file permission issues."},{"function":"ap_process_resource_config","message_template":"Error processing configuration file","reason":"An error occurred while processing an Apache configuration file, which could be due to syntax errors, missing files, or permission issues.","resolution":"Verify the syntax of the configuration file, ensure it exists at the specified path, and check file permissions. Use 'apachectl configtest' to validate configuration files."},{"function":"ap_parse_htaccess","message_template":"Error parsing .htaccess file","reason":"An error occurred while parsing an .htaccess file, which could be due to syntax errors or directives not allowed in .htaccess context.","resolution":"Check the .htaccess file for syntax errors. Verify that all directives used are allowed in .htaccess context according to the AllowOverride settings."},{"function":"ap_soak_end_container","message_template":"Error parsing configuration container","reason":"Encountered an error while parsing a configuration directive container (such as <Directory>...<\/Directory>).","resolution":"Check the configuration file for syntax errors, particularly ensuring that all container directives have proper opening and closing tags."}],"project":"apache\/httpd"}