{"module":"http_log.h","summary":"Apache HTTP Server's core logging infrastructure. This header defines the logging APIs, including functions for logging errors, warnings, and informational messages at various levels of severity, as well as configuration for log destinations and formats.","logs":[{"function":"APLOGNO","message_template":"AH#####: ","reason":"Creates a standardized tag prefix for log messages that includes a unique identifier. This helps in identifying and referencing specific log messages in documentation.","resolution":"This is an informational log template. If you see this in logs, it indicates the Apache HTTP Server is working as expected and following its standard logging format."},{"function":"ap_log_error","message_template":"%s","reason":"Generic template for server-level log messages. This function is used throughout the server code to log errors and informational messages not tied to a specific request or connection.","resolution":"The resolution depends on the specific message content. Check the full log message for details about the issue being reported."},{"function":"ap_log_rerror","message_template":"%s","reason":"Template for request-specific log messages. This function is used to log errors and informational messages related to a specific HTTP request.","resolution":"The resolution depends on the specific error. Examine the complete log message for details about the issue with the request being processed."},{"function":"ap_log_cerror","message_template":"%s","reason":"Template for connection-specific log messages. This function is used to log errors and informational messages related to a specific client connection.","resolution":"The resolution depends on the specific error. Review the full message for details about the connection issue being reported."},{"function":"ap_log_perror","message_template":"%s","reason":"Template for pool-related log messages. This function is used to log errors and informational messages related to memory management.","resolution":"The resolution depends on the specific error. Check the complete message for details about the memory allocation or pool issue."},{"function":"ap_log_cserror","message_template":"%s","reason":"Template for log messages related to both a connection and a specific virtual host. Used particularly before a request object is fully created.","resolution":"The resolution depends on the specific error. Examine the full message for details about the connection or virtual host issue."},{"function":"APLOG_TOCLIENT","message_template":"error-notes","reason":"Stores error text in request_rec->notes that might be shown to clients in ErrorDocument responses. Triggered when log severity is WARNING or higher.","resolution":"These errors may be visible to clients. Check server configuration for ErrorDocument settings to control how these errors are presented to users."}],"project":"apache\/httpd"}