{"module":"mpm_common.h","summary":"This header file defines the interfaces and structures for Apache's Multi-Processing Modules (MPMs), which handle process and thread management. It provides functions for child process management, signal handling, graceful shutdown, and other server lifecycle operations common to multiple MPM implementations.","logs":[{"function":"ap_process_child_status","message_template":"Child process [pid] exited with status [status]","reason":"Logs when a child process has died with an unexpected status code. This helps diagnose why worker processes are terminating.","resolution":"Check the process exit code to determine the cause. Common issues include memory problems, segmentation faults, or reaching MaxRequestsPerChild limit."},{"function":"ap_mpm_pod_signal","message_template":"Signaling child process to die","reason":"Indicates that the server is asking a child process to terminate, typically during shutdown or restart.","resolution":"This is an informational message during normal server operation; no resolution needed unless child processes aren't responding."},{"function":"ap_mpm_pod_killpg","message_template":"Signaling all child processes to die","reason":"Indicates that the server is terminating all child processes, typically during server shutdown.","resolution":"This is an informational message during normal server shutdown; no resolution needed unless processes are hanging."},{"function":"ap_mpm_podx_signal","message_template":"Signaling child process for graceful restart","reason":"Indicates that the server is requesting a graceful restart of a child process using SIGUSR1.","resolution":"This is an informational message during normal server restart; no resolution needed."},{"function":"ap_signal_server","message_template":"Received signal [signal], shutting down","reason":"The server received a shutdown signal and is initiating the shutdown sequence.","resolution":"This is an informational message during normal server operation, unless the shutdown was unexpected. In that case, check what process sent the signal."},{"function":"ap_fatal_signal_setup","message_template":"Setting up fatal signal handlers","reason":"The server is configuring handlers for fatal signals like SIGSEGV that can cause server crashes.","resolution":"Informational message during server startup; no resolution required."},{"function":"ap_mpm_set_graceful_shutdown","message_template":"GracefulShutdownTimeout set to [timeout] seconds","reason":"Configuration setting for how long the server will wait for child processes to complete transactions during shutdown.","resolution":"This is a configuration message. If shutdowns are taking too long, consider adjusting this timeout value."},{"function":"drop_privileges_hook","message_template":"Failed to drop privileges","reason":"The server was unable to switch to a less privileged user\/group as configured, which is a security risk.","resolution":"Check that the configured user and group exist on the system and that the server has permission to switch to them."},{"function":"suspend_connection_hook","message_template":"Connection suspended","reason":"A connection is being suspended, typically in event-based MPMs when the connection is waiting for I\/O.","resolution":"Informational message during normal operation. If many connections are suspended, check for network or backend service issues."},{"function":"resume_connection_hook","message_template":"Connection resumed","reason":"A previously suspended connection is being resumed to continue processing.","resolution":"Informational message during normal operation. No resolution required."},{"function":"child_stopping_hook","message_template":"Child process is stopping [graceful=yes\/no]","reason":"A child process is beginning its shutdown sequence, either gracefully or immediately.","resolution":"Informational message during server shutdown or restart. No resolution required unless processes aren't stopping properly."},{"function":"child_stopped_hook","message_template":"Child process has stopped [graceful=yes\/no]","reason":"A child process has completed its shutdown sequence and is about to exit.","resolution":"Informational message during server shutdown or restart. No resolution required."}],"project":"apache\/httpd"}