{"module":"util_script.h","summary":"This module defines Apache script tools functions for CGI script handling including environment creation, path info handling, CGI variable addition, script header scanning, and query argument parsing. It provides interfaces for processing CGI scripts and handling their input\/output in a standardized way.","logs":[{"function":"ap_scan_script_header_err","message_template":"Error while scanning script headers: %s","reason":"This would likely log when a script produces invalid or malformed headers. The actual error message would depend on the specific issue encountered with the script's output.","resolution":"Check the CGI script for proper header formatting. Ensure it outputs valid headers with proper line endings and correct format. Common issues include missing status line, invalid header format, or improperly terminated headers."},{"function":"ap_scan_script_header_err_ex","message_template":"Error while scanning script headers: %s","reason":"Similar to ap_scan_script_header_err but with module-specific logging. Triggered when scripts produce invalid headers, with errors attributed to the correct module.","resolution":"Review the CGI script's header output. Fix any malformed headers, ensure proper Content-Type and other required headers are present, and check for proper line endings (CRLF)."},{"function":"ap_scan_script_header_err_brigade","message_template":"Error while scanning script headers from brigade: %s","reason":"Logs errors when processing script headers from a bucket brigade data structure. May occur when scripts produce invalid output or when there are IO errors.","resolution":"Investigate script output format. Check for memory constraints if handling large headers. Ensure the script produces valid HTTP headers and that there are no IO issues with the system."},{"function":"ap_scan_script_header_err_strs","message_template":"Error while scanning script header strings: %s","reason":"Logs errors when processing headers provided as direct strings. Typically occurs with hardcoded or pre-processed header strings that don't follow HTTP specifications.","resolution":"Review the string format of headers being passed to this function. Ensure they follow HTTP header specifications with proper line endings and format."},{"function":"ap_scan_script_header_err_core","message_template":"Error in core script header processing: %s","reason":"Core function that other header scanning functions use internally. Logs fundamental errors in script header processing regardless of input method.","resolution":"This is a low-level error; check script output format, ensure proper HTTP headers, verify system resources are sufficient, and that there are no IO issues."},{"function":"ap_args_to_table","message_template":"Error processing query arguments: %s","reason":"May log errors when query arguments cannot be properly parsed or when memory allocation fails during table creation.","resolution":"Check query string format for malformed URL encoding. Ensure system has sufficient memory resources. Verify that query parameters follow proper URL query string format."},{"function":"AP_TRUST_CGILIKE_CL_ENVVAR","message_template":"Trusting CGI-like Content-Length headers due to ap_trust_cgilike_cl environment setting","reason":"This environment variable controls whether Apache trusts Content-Length headers from CGI scripts, which can impact security and logging behavior.","resolution":"This is usually an informational message. Only set this environment variable if you fully trust your CGI scripts, as incorrect Content-Length headers can lead to security vulnerabilities or request handling issues."}],"project":"apache\/httpd"}