{"module":"util_filter.h","summary":"Apache filter library providing a framework for filter chaining. Defines structures and functions for registering, adding, and managing input and output filters that can process content being served by the Apache HTTP server.","logs":[{"function":"ap_pass_brigade_fchk","message_template":"ap_pass_brigade returned","reason":"The filter chain failed to process the brigade. The function checks for errors when passing a bucket brigade through the filter chain.","resolution":"Check the error logs for more details about the specific filter that failed. Investigate filter configuration or potential bugs in custom filters. This could be caused by memory issues, network problems, or bugs in filter implementations."},{"function":"ap_filter_setaside_brigade","message_template":"Failed to set aside brigade","reason":"Setting aside a bucket brigade for later processing failed, likely due to memory allocation issues.","resolution":"Check server memory resources and reduce memory usage in filters or increase available memory for the server. Consider adjusting MaxRequestWorkers or other resource-related configuration directives."},{"function":"ap_filter_reinstate_brigade","message_template":"Failed to reinstate brigade","reason":"Reinstating a previously set-aside bucket brigade failed, possibly due to memory corruption or resource issues.","resolution":"This may indicate a bug in a filter module. Check for filter modules that might be corrupting memory or not properly handling brigade data."},{"function":"ap_filter_should_yield","message_template":"Filter chain blocked","reason":"The filter determined that passing data downstream might block, indicating potential performance issues.","resolution":"Review filter chain configuration for bottlenecks. Consider optimizing slow filters or adjusting buffer sizes. May indicate network congestion or slow client connections."},{"function":"ap_filter_output_pending","message_template":"Output filter has pending data","reason":"Unwritten data remains in output filters, which could indicate buffering issues or blocked connections.","resolution":"If this message appears frequently, check for slow clients or network issues. Consider adjusting timeout settings or implementing rate limiting if appropriate."},{"function":"ap_filter_input_pending","message_template":"Input filter has pending data","reason":"Data has been read from the socket but not yet returned to the application, which could indicate processing delays.","resolution":"Review input filter chain for efficiency issues. Consider simplifying complex input filters or increasing server resources if processing is CPU-bound."},{"function":"ap_bucket_wc_create","message_template":"Failed to create Write Completion bucket","reason":"Memory allocation for a Write Completion bucket failed, indicating resource constraints.","resolution":"Check server memory usage and increase available resources if needed. Consider reducing the number of concurrent connections or optimizing memory usage in modules."}],"project":"apache\/httpd"}