{"module":"util_cookies.h","summary":"This module provides an Apache cookie library for handling HTTP cookies in compliance with RFC2109 and RFC2965. It allows reading, writing, and removing cookies, with functions to handle attributes like HttpOnly, Secure, and Max-Age.","logs":[{"function":"ap_cookie_write","message_template":"Error writing cookie","reason":"Function failed to write an RFC2109 compliant cookie. This could happen due to invalid cookie parameters, memory allocation issues, or other internal errors.","resolution":"Check that cookie name and value are valid strings. Ensure the cookie attributes are properly formatted and maxage is a valid value. Examine server logs for more specific error information."},{"function":"ap_cookie_write2","message_template":"Error writing RFC2965 cookie","reason":"Function failed to write an RFC2965 compliant cookie. Similar to ap_cookie_write, this could be due to invalid parameters or internal errors.","resolution":"Verify the cookie name, value, and attributes are valid. Check that the RFC2965 specific requirements are met in the cookie format."},{"function":"ap_cookie_remove","message_template":"Error removing cookie","reason":"Function failed to remove an RFC2109 compliant cookie, likely due to issues with request object or cookie parameters.","resolution":"Check that the request object is valid and the cookie name exists. Ensure the attributes parameter is properly formatted."},{"function":"ap_cookie_remove2","message_template":"Error removing RFC2965 cookie","reason":"Function failed to remove an RFC2965 compliant cookie, similar to ap_cookie_remove but for RFC2965 cookies.","resolution":"Verify the request object is valid and the cookie name exists. Check that RFC2965 specific requirements are met in the cookie format."},{"function":"ap_cookie_read","message_template":"Duplicate cookie detected","reason":"Function detected a duplicate cookie while reading. This means the same cookie name appears multiple times in the headers, which may indicate a client-side issue or potential security problem.","resolution":"Investigate why duplicate cookies are being sent. This could be due to misconfigured client applications or potential cookie manipulation attempts."},{"function":"ap_cookie_check_string","message_template":"Invalid cookie name","reason":"Function detected an invalid cookie name containing illegal characters such as '=', ';', or '&', or the name is empty or null.","resolution":"Modify the cookie name to comply with cookie standards. Cookie names should not contain special characters like '=', ';', or '&' and should not be empty."}],"project":"apache\/httpd"}