{"module":"firehose.c","summary":"Firehose is a program that demultiplexes streams of multiplexed connections, writing each connection to a file or socket. It processes fragment headers and bodies, tracks connections by UUID, and can filter connections by prefix.","logs":[{"function":"finalise_body","message_template":"Could not rename file '%s' to '%s' for fragment write: %pm","reason":"Indicates a failure when trying to rename a temporary file to its final name after a fragment has been fully processed.","resolution":"Check file system permissions, available disk space, and ensure the target filename doesn't already exist. May require manual cleanup of temporary files."},{"function":"finalise_body","message_template":"Could not set mtime on file '%s' to '%' for fragment write: %pm","reason":"Occurs when the program fails to set the modification time on a file, which is used to preserve the timestamp of the original data.","resolution":"Check file system permissions and capabilities. The file itself may still be valid even if the timestamp couldn't be set."},{"function":"finalise_body","message_template":"Could not merge directory '%s' with file '%s': %pm","reason":"Failure when creating a path by combining the output directory with a filename.","resolution":"Verify that the output directory path is valid and accessible. Check for special characters in filenames that might cause path issues."},{"function":"process_body","message_template":"Could not write fragment body to file '%s': %pm","reason":"Writing a fragment of data to the output file failed, possibly due to disk space or permission issues.","resolution":"Check disk space availability, file system permissions, and whether the filesystem is read-only or has issues."},{"function":"process_body","message_template":"Could not open file '%s' for fragment write: %pm","reason":"Failed to open or create the output file for writing a fragment.","resolution":"Verify directory exists and has proper permissions. Check if the file is locked by another process or if there are too many open files."},{"function":"process_body","message_template":"Could not merge directory '%s' with file '%s': %pm","reason":"Failure when creating a path by combining the output directory with a filename for a fragment.","resolution":"Ensure the output directory exists and has proper permissions. Check for invalid characters in filenames."},{"function":"demux","message_template":"Could not read fragment body from input file: %pm","reason":"Occurs when there's an error reading the body of a fragment from the input stream, possibly due to corruption or premature end of file.","resolution":"Verify that the input file is complete and not corrupted. Check if there might be competing processes reading from the same pipe."},{"function":"demux","message_template":"Could not read fragment header from input file: %pm","reason":"Failure reading a fragment header from the input stream, which can happen if the input data is malformed or unexpectedly terminated.","resolution":"Check if the input file is correctly formatted and complete. The file may be corrupted or not in the expected format."},{"function":"main","message_template":"Could not open file '%s' for read: %pm","reason":"Occurs when the program cannot open the specified input file for reading.","resolution":"Verify the file exists, has proper permissions, and isn't locked by another process. Check that the path is correct."},{"function":"main","message_template":"Directory '%s' could not be found: %pm","reason":"The specified output directory could not be found or accessed.","resolution":"Create the directory if it doesn't exist, or check permissions if it does. Ensure the path is correct and accessible to the user running the program."},{"function":"main","message_template":"Path '%s' isn't a directory","reason":"The path specified for the output directory exists but is not a directory (e.g., it's a regular file).","resolution":"Either choose a different path that is a directory, or remove\/rename the existing file to create a directory in its place."},{"function":"main","message_template":"Warning: % bytes skipped, % fragments dropped.","reason":"This is a summary warning indicating that some data was skipped or fragments were dropped during processing, which might indicate data loss or corruption.","resolution":"Check if the input file is correctly formatted. If many bytes are skipped, the input may be in an unexpected format or corrupted."},{"function":"version","message_template":"%s (%s)","reason":"Displays the program name and version when the --version flag is used.","resolution":"Informational log, no resolution required."},{"function":"help","message_template":"Usage : %s [options] [prefix1 [prefix2 ...]]","reason":"Displays usage information when the --help flag is used.","resolution":"Informational log, no resolution required."}],"project":"apache\/httpd"}