{"module":"htcacheclean.c","summary":"A utility program for cleaning the disk cache of the Apache HTTP server. It can operate in one-time run mode or as a daemon that periodically cleans the cache. The program can limit cache size by total size or number of inodes, and can delete specific URLs.","logs":[{"function":"fake_file_remove","message_template":"would delete %s","reason":"Debug message that indicates which file would be deleted in dry run mode","resolution":"Informational only, no resolution required. Will appear when using the -D option."},{"function":"setterm","message_template":"interrupt","reason":"Debug message that indicates program received a signal (SIGINT or SIGTERM)","resolution":"Informational only, no resolution required. Indicates user or system requested program termination."},{"function":"printstats","message_template":"Cleaned %s. Statistics:","reason":"Indicates the cache cleaning operation has completed and shows the path that was cleaned","resolution":"Informational only, no resolution required. Will appear when using the -v option."},{"function":"printstats","message_template":"unsolicited size %d.%d%c","reason":"Reports the size of unsolicited files that were deleted during cache cleaning","resolution":"Informational only, no resolution required. Will appear when using the -v option and when unsolicited files were found."},{"function":"printstats","message_template":"size limit %.0%c","reason":"Reports the configured maximum size limit for the cache","resolution":"Informational only, no resolution required. Will appear when using the -v option."},{"function":"printstats","message_template":"inodes limit %","reason":"Reports the configured maximum inode limit for the cache","resolution":"Informational only, no resolution required. Will appear when using the -v option."},{"function":"printstats","message_template":"total size was %.%, total size now %.%","reason":"Reports the total size of the cache before and after cleaning","resolution":"Informational only, no resolution required. Will appear when using the -v option."},{"function":"printstats","message_template":"total inodes was %, total %sinodes now %","reason":"Reports the total number of inodes before and after cleaning","resolution":"Informational only, no resolution required. Will appear when using the -v option."},{"function":"printstats","message_template":"total entries was %, total entries now %","reason":"Reports the total number of cache entries before and after cleaning","resolution":"Informational only, no resolution required. Will appear when using the -v option."},{"function":"printstats","message_template":"% entries deleted (% from future, % expired, % fresh)","reason":"Reports the number of cache entries deleted, broken down by category (from future, expired, fresh)","resolution":"Informational only, no resolution required. Will appear when using the -v option."},{"function":"list_urls","message_template":"%s","reason":"Lists a URL stored in the cache","resolution":"Informational only, no resolution required. Will appear when using the -a option."},{"function":"list_urls","message_template":"%s % % %d % % % % % %d %d","reason":"Lists a URL stored in the cache along with its attributes","resolution":"Informational only, no resolution required. Will appear when using the -A option."},{"function":"remove_directory","message_template":"Could not open directory %s: %pm","reason":"Error when a directory cannot be opened for removal","resolution":"Check file system permissions and make sure the directory exists. This can also occur if the directory has already been removed by another process."},{"function":"remove_directory","message_template":"Could not remove file '%s': %pm","reason":"Error when a file cannot be removed during directory cleanup","resolution":"Check file system permissions and make sure the file exists. May also occur if the file is being used by another process."},{"function":"remove_directory","message_template":"Could not remove directory %s: %pm","reason":"Error when a directory cannot be removed","resolution":"Check file system permissions and make sure the directory is empty. May also occur if the directory is in use by another process."},{"function":"find_directory","message_template":"Could not open directory %s: %pm","reason":"Error when a directory cannot be opened while searching for a URL to delete","resolution":"Check file system permissions and make sure the directory exists."},{"function":"find_directory","message_template":"Could not remove file %s: %pm","reason":"Error when a file cannot be removed while deleting a URL","resolution":"Check file system permissions and make sure the file exists. May also occur if the file is being used by another process."},{"function":"usage","message_template":"%s error: %s","reason":"Error message displayed when incorrect command-line options are provided","resolution":"Follow the usage instructions to correct the command-line options."},{"function":"usage","message_template":"%s -- program for cleaning the disk cache.","reason":"Usage message displayed when the program is invoked incorrectly","resolution":"Follow the usage instructions to correct the command-line options."},{"function":"usage_repeated_arg","message_template":"The option '%c' cannot be specified more than once","reason":"Error when a command-line option is specified multiple times","resolution":"Remove duplicate options from the command line."},{"function":"log_pid","message_template":"Could not write the pid file '%s': %pm","reason":"Error when the PID file cannot be written","resolution":"Check file system permissions and make sure the directory for the PID file exists and is writable."},{"function":"main","message_template":"Invalid limit: %s","reason":"Error when an invalid cache size limit is specified","resolution":"Specify a valid numeric limit, optionally with a suffix (K, M, or G)."},{"function":"main","message_template":"Invalid round value: %s","reason":"Error when an invalid round value is specified","resolution":"Specify a valid numeric round value."},{"function":"main","message_template":"Round value must be positive: %s","reason":"Error when a negative round value is specified","resolution":"Specify a positive round value."},{"function":"main","message_template":"Could not set filepath to '%s': %pm","reason":"Error when the specified cache directory path cannot be set","resolution":"Check that the specified path exists and is accessible."},{"function":"main","message_template":"Option -p must be specified","reason":"Error when the required -p option (specifying the cache directory) is missing","resolution":"Add the -p option followed by the path to the cache directory."},{"function":"main","message_template":"Option -d cannot be used with URL arguments, aborting","reason":"Error when both the -d option (daemon mode) and URL arguments are specified","resolution":"Either run in daemon mode without URL arguments, or specify URL arguments without the -d option."},{"function":"main","message_template":"Option -i cannot be used with URL arguments, aborting","reason":"Error when both the -i option (intelligent mode) and URL arguments are specified","resolution":"Either use intelligent mode without URL arguments, or specify URL arguments without the -i option."},{"function":"main","message_template":"Option -l and -L cannot be used with URL arguments, aborting","reason":"Error when both size limit options (-l or -L) and URL arguments are specified","resolution":"Either specify size limits without URL arguments, or specify URL arguments without size limits."},{"function":"main","message_template":"Removed: %s","reason":"Confirmation that a URL was successfully removed from the cache","resolution":"Informational only, no resolution required."},{"function":"main","message_template":"Not cached: %s","reason":"Indicates that a URL specified for removal was not found in the cache","resolution":"Verify the URL format and check if it should be in the cache."},{"function":"main","message_template":"Error while removed: %s","reason":"Error when attempting to remove a URL from the cache","resolution":"Check file system permissions and verify the URL format."},{"function":"main","message_template":"Option -d must be greater than zero","reason":"Error when the -d option (daemon mode interval) is specified with a non-positive value","resolution":"Specify a positive interval value with the -d option."},{"function":"main","message_template":"Option -d cannot be used with -v, -r, -L or -D","reason":"Error when incompatible options are specified with daemon mode (-d)","resolution":"Remove incompatible options (-v, -r, -L, -D) when using daemon mode."},{"function":"main","message_template":"Option -i cannot be used without -d","reason":"Error when the -i option (intelligent mode) is specified without the -d option (daemon mode)","resolution":"Either add the -d option or remove the -i option."},{"function":"main","message_template":"At least one of option -l or -L must be greater than zero","reason":"Error when neither size limit (-l) nor inode limit (-L) is specified","resolution":"Specify at least one of the -l or -L options with a positive value."},{"function":"main","message_template":"Could not get the filepath: %pm","reason":"Error when the current file path cannot be retrieved","resolution":"This is a system-level error. Check file system permissions and ensure the program has access to the current directory."},{"function":"main","message_template":"An error occurred, cache cleaning aborted.","reason":"General error message when cache cleaning is aborted due to an error","resolution":"Check previous error messages for more specific information about the error."},{"function":"main","message_template":"Cache cleaning aborted due to user request.","reason":"Message when cache cleaning is aborted due to a user interrupt (SIGINT or SIGTERM)","resolution":"Informational only, no resolution required. Indicates the user requested termination."}],"project":"apache\/httpd"}