{"module":"htdigest.c","summary":"A utility for creating and managing HTTP digest authentication password files for Apache. It allows creating new password files, adding users, and changing passwords for existing users in specified realms using MD5 hashing.","logs":[{"function":"add_password","message_template":"New password: ","reason":"Prompts the user to enter a new password for authentication","resolution":"Informational prompt, no resolution required"},{"function":"add_password","message_template":"password too long","reason":"The entered password exceeds the maximum allowed length (MAX_STRING_LEN)","resolution":"User should enter a shorter password that fits within the system limit"},{"function":"add_password","message_template":"Re-type new password: ","reason":"Prompts the user to confirm the password by typing it again","resolution":"Informational prompt, no resolution required"},{"function":"add_password","message_template":"They don't match, sorry.\n","reason":"The two password entries don't match, indicating a typing error","resolution":"User should try the password creation process again, ensuring both entries match exactly"},{"function":"usage","message_template":"Usage: htdigest [-c] passwordfile realm username\n","reason":"Displays the correct command syntax when improper arguments are provided","resolution":"User should follow the specified syntax to properly use the tool"},{"function":"usage","message_template":"The -c flag creates a new file.\n","reason":"Explains the purpose of the -c option as part of the usage information","resolution":"Informational message, no resolution required"},{"function":"interrupted","message_template":"Interrupted.\n","reason":"The program was interrupted by a signal (SIGINT, typically Ctrl+C)","resolution":"If interruption was unintentional, restart the command; otherwise, no action needed"},{"function":"main","message_template":"apr_xlate_open(): %pm (%d)\n","reason":"Error initializing character encoding translation (in EBCDIC environments)","resolution":"This is likely a system configuration issue. Check that the required character encodings are available on the system"},{"function":"main","message_template":"Could not open passwd file %s for writing: %pm\n","reason":"Failed to open the password file for writing when creating a new file","resolution":"Check file permissions, directory existence, and disk space. Ensure the user running the command has write access to the specified location"},{"function":"main","message_template":"Adding password for %s in realm %s.\n","reason":"Informational message indicating a new password is being added for the specified user and realm","resolution":"Informational message, no resolution required"},{"function":"main","message_template":"%s: could not determine temp dir\n","reason":"The system couldn't identify a temporary directory for creating intermediate files","resolution":"Check that TMPDIR, TMP, or TEMP environment variables are set correctly and point to a valid, writable directory"},{"function":"main","message_template":"Could not open temp file %s.\n","reason":"Failed to create or open a temporary file needed for updating the password file","resolution":"Check permissions on the temp directory, disk space, and file system permissions"},{"function":"main","message_template":"Could not open passwd file %s for reading.\n","reason":"Failed to open the existing password file for reading when updating it","resolution":"Verify the file exists and the user has read permissions for it"},{"function":"main","message_template":"Use -c option to create new one.\n","reason":"Suggestion to use -c option when attempting to modify a non-existent password file","resolution":"Run the command again with the -c option to create a new password file"},{"function":"main","message_template":"The following line contains a string longer than the allowed maximum size (%i): %s\n","reason":"Found a line in the password file with a username or realm that exceeds the allowed length","resolution":"Manually edit the password file to correct the oversized entries, or recreate the affected entries with shorter values"},{"function":"main","message_template":"Changing password for user %s in realm %s\n","reason":"Informational message indicating a password is being changed for an existing user","resolution":"Informational message, no resolution required"},{"function":"main","message_template":"Adding user %s in realm %s\n","reason":"Informational message indicating a new user is being added to the password file","resolution":"Informational message, no resolution required"},{"function":"main","message_template":"%s: unable to update file %s\n","reason":"Failed to update the original password file with the new data from the temporary file","resolution":"Check file permissions, disk space, and whether another process might be locking the destination file"}],"project":"apache\/httpd"}