{"module":"htpasswd.c","summary":"A utility for managing password files for the Apache HTTP server. It allows creating, updating, deleting, and verifying user credentials in password files with support for various hashing algorithms including MD5, SHA-1, SHA-256, SHA-512, and bcrypt.","logs":[{"function":"mkrecord","message_template":"resultant record too long","reason":"The generated password record exceeds the maximum allowed length (MAX_STRING_LEN).","resolution":"Use a shorter username or password that will result in a hash record within the length limits."},{"function":"usage","message_template":"Usage:\n\thtpasswd [-cimB25dpsDv] [-C cost] [-r rounds] passwordfile username\n\thtpasswd -b[cmB25dpsDv] [-C cost] [-r rounds] passwordfile username password\n\n\thtpasswd -n[imB25dps] [-C cost] [-r rounds] username\n\thtpasswd -nb[mB25dps] [-C cost] [-r rounds] username password","reason":"Displays the command usage information when incorrect command-line arguments are provided.","resolution":"Review the command syntax and ensure you're using the correct command-line options."},{"function":"check_args","message_template":"%s: %s","reason":"Reports errors from parsing command line options. The first %s is replaced with the program name and the second with the error message.","resolution":"Check the command-line arguments being passed and ensure they conform to the expected format."},{"function":"check_args","message_template":"%s: only one of -c -n -v -D may be specified","reason":"Multiple mutually exclusive options were provided on the command line.","resolution":"Use only one of the specified options: -c (create new file), -n (display results only), -v (verify password), or -D (delete user)."},{"function":"check_args","message_template":"%s: filename too long","reason":"The specified password file name exceeds the maximum allowed path length (APR_PATH_MAX).","resolution":"Use a shorter path or filename that does not exceed the system path length limit."},{"function":"check_args","message_template":"%s: username too long (> %d)","reason":"The username exceeds the maximum allowed length (MAX_STRING_LEN-1).","resolution":"Use a shorter username that stays within the allowed length limit."},{"function":"check_args","message_template":"%s: username contains illegal character '%c'","reason":"The username contains a colon character, which is not allowed since colons are used as field separators in the password file.","resolution":"Choose a username that does not contain the colon (:) character."},{"function":"check_args","message_template":"%s: password too long (> %d)","reason":"The password exceeds the maximum allowed length (MAX_STRING_LEN-1).","resolution":"Use a shorter password that stays within the allowed length limit."},{"function":"verify","message_template":"password verification failed","reason":"The entered password does not match the stored hash for the specified user.","resolution":"Ensure you're entering the correct password for the user. If you've forgotten the password, you may need to reset it using the update functionality."},{"function":"verify","message_template":"Could not verify password: %pm","reason":"An error occurred during the password verification process.","resolution":"Check if the password file is corrupted or if the hash format is unsupported. You may need to recreate the user entry."},{"function":"main","message_template":"apr_xlate_open(to ASCII)->%d","reason":"An error occurred when initializing character translation from EBCDIC to ASCII (only relevant on EBCDIC systems).","resolution":"Check if the system's character translation libraries are properly installed and configured."},{"function":"main","message_template":"apr_SHA1InitEBCDIC()->%d","reason":"An error occurred when initializing the SHA1 algorithm for EBCDIC (only relevant on EBCDIC systems).","resolution":"Verify that the crypto libraries are properly installed and compatible with the system's character encoding."},{"function":"main","message_template":"apr_MD5InitEBCDIC()->%d","reason":"An error occurred when initializing the MD5 algorithm for EBCDIC (only relevant on EBCDIC systems).","resolution":"Verify that the crypto libraries are properly installed and compatible with the system's character encoding."},{"function":"main","message_template":"%s: cannot open file %s for read\/write access","reason":"The specified password file cannot be opened for both reading and writing.","resolution":"Check file permissions and ensure the user running the command has read and write access to the file."},{"function":"main","message_template":"%s: cannot open file %s for read access","reason":"The specified password file cannot be opened for reading.","resolution":"Check file permissions and ensure the user running the command has read access to the file."},{"function":"main","message_template":"%s: cannot modify file %s; use '-c' to create it","reason":"The specified password file does not exist and the -c option was not provided to create it.","resolution":"Use the -c option to create a new password file if it doesn't exist, or verify that the file path is correct."},{"function":"main","message_template":"%s: cannot create file %s","reason":"The program cannot create the specified password file.","resolution":"Ensure the user has write permissions in the directory where the file should be created."},{"function":"main","message_template":"%s: could not determine temp dir","reason":"The program could not determine a temporary directory for creating temporary files.","resolution":"Check that the system's temporary directory (usually \/tmp) exists and is accessible. Ensure environment variables like TMPDIR are properly set."},{"function":"main","message_template":"%s: unable to create temporary file %s","reason":"The program could not create a temporary file needed for safely updating the password file.","resolution":"Verify that the user has write access to the system's temporary directory and that there's enough disk space available."},{"function":"main","message_template":"%s: unable to read file %s","reason":"The program cannot read the password file, even though it appears to exist.","resolution":"Check file permissions and ensure the file is not corrupted or locked by another process."},{"function":"main","message_template":"%s: The file %s does not appear to be a valid htpasswd file.","reason":"The format of the password file is invalid (lines don't contain the expected colon-separated format).","resolution":"The file may be corrupted or not an htpasswd file. Use -c to create a new file if necessary, or manually verify the file format."},{"function":"main","message_template":"Deleting ","reason":"Indicates that a user entry is being deleted from the password file.","resolution":"Informational message, no resolution required."},{"function":"main","message_template":"Empty hash for user %s","reason":"The password hash for the specified user is empty in the password file.","resolution":"The password file may be corrupted. You should either delete and recreate the user entry or fix the password file."},{"function":"main","message_template":"Updating ","reason":"Indicates that the password for an existing user is being updated.","resolution":"Informational message, no resolution required."},{"function":"main","message_template":"User %s not found","reason":"The specified user does not exist in the password file. This message can appear in different contexts (delete, verify, or update operations).","resolution":"Verify the username and ensure it exists in the password file. For adding a new user, this is normal behavior."},{"function":"main","message_template":"Adding ","reason":"Indicates that a new user entry is being added to the password file.","resolution":"Informational message, no resolution required."},{"function":"main","message_template":"Password for user %s correct.","reason":"Indicates successful password verification for the specified user.","resolution":"Informational message, no resolution required."},{"function":"main","message_template":"password for user %s","reason":"Indicates that the password for a user has been processed (added, updated, or verified).","resolution":"Informational message, no resolution required."},{"function":"main","message_template":"%s: unable to update file %s","reason":"The program failed to update the password file with the new information.","resolution":"Check file permissions, ensure enough disk space is available, and verify that no other process is locking the file."}],"project":"apache\/httpd"}