{"module":"logresolve.c","summary":"The logresolve utility resolves IP addresses in Apache log files to hostnames, improving readability of logs for analysis. It reads from stdin, performs DNS lookups (with optional verification) for each IP address, and outputs the result to stdout. It uses a cache to minimize DNS lookups and can optionally record statistics.","logs":[{"function":"usage","message_template":"%s -- Resolve IP-addresses to hostnames in Apache log files.","reason":"Displays usage information when the program is invoked with invalid command-line arguments or the help option.","resolution":"Read the usage instructions and provide valid command-line arguments."},{"function":"usage","message_template":"Usage: %s [-s STATFILE] [-c]","reason":"Shows the command-line syntax for the program.","resolution":"Follow the syntax shown in the message to correctly use the program."},{"function":"usage","message_template":"Options:","reason":"Header for the options section in the usage information.","resolution":"Informational message, no resolution required."},{"function":"usage","message_template":"  -s   Record statistics to STATFILE when finished.","reason":"Explains the -s option for writing statistics to a file.","resolution":"Informational message, no resolution required."},{"function":"usage","message_template":"  -c   Perform double lookups when resolving IP addresses.","reason":"Explains the -c option for performing additional verification of hostname lookups.","resolution":"Informational message, no resolution required."},{"function":"print_statistics","message_template":"logresolve Statistics:","reason":"Header for statistics output when the -s option is used.","resolution":"Informational message, no resolution required."},{"function":"print_statistics","message_template":"Entries: %d","reason":"Reports the total number of log entries processed.","resolution":"Informational message, no resolution required."},{"function":"print_statistics","message_template":"    With name   : %d","reason":"Reports the number of entries that already had hostnames instead of IP addresses.","resolution":"Informational message, no resolution required."},{"function":"print_statistics","message_template":"    Resolves    : %d","reason":"Reports the number of entries successfully parsed as IP addresses.","resolution":"Informational message, no resolution required."},{"function":"print_statistics","message_template":"    - No reverse : %d","reason":"Reports the number of IP addresses that could not be resolved to hostnames.","resolution":"If this number is high, check DNS configuration or consider if these are private\/internal IP addresses."},{"function":"print_statistics","message_template":"    - Double lookup failed : %d","reason":"Reports the number of hostnames that failed verification (when using -c option).","resolution":"High numbers may indicate DNS poisoning or misconfiguration. Investigate DNS configuration if this number is unexpectedly high."},{"function":"print_statistics","message_template":"Cache hits      : %d","reason":"Reports how many IP addresses were found in the cache instead of requiring a new DNS lookup.","resolution":"Informational message, no resolution required."},{"function":"print_statistics","message_template":"Cache size      : %d","reason":"Reports the number of unique IP addresses encountered and stored in the cache.","resolution":"Informational message, no resolution required."},{"function":"main","message_template":"%s: Could not open %s for writing.","reason":"Error message when the program fails to open the statistics file specified with -s option.","resolution":"Check if the specified directory exists, is writable, and has sufficient disk space. Also verify that you have permissions to write to that location."},{"function":"main","message_template":"parsed as an IP address","reason":"Internal comment in the code explaining the meaning of 'resolves' in the statistics.","resolution":"Not an actual log message, this is a code comment."}],"project":"apache\/httpd"}