{"module":"suexec.c","summary":"A security wrapper program for Apache that allows CGI scripts to run as specific users and groups. It performs extensive security checks including user\/group validation, directory permissions, and proper containment within document roots before executing the requested command.","logs":[{"function":"err_output","message_template":"suexec failure: could not open log file","reason":"The suexec utility cannot open its log file for writing error messages. This prevents proper logging of security issues.","resolution":"Check permissions on the log directory and ensure Apache has write access to it. Verify the log path specified in AP_LOG_EXEC is correct and accessible."},{"function":"err_output","message_template":"suexec policy violation: see suexec log for more details","reason":"A generic message sent to stderr when a security policy violation is detected. Detailed information is written to the suexec log.","resolution":"Check the suexec log file for specific violation details. This is an informational message directing administrators to look at the log file."},{"function":"clean_env","message_template":"failed to malloc memory for environment","reason":"Memory allocation failed when attempting to create a clean environment for the CGI script. Likely due to system resource constraints.","resolution":"Check system memory usage and possibly increase available memory. Consider limiting concurrent CGI executions if this occurs frequently."},{"function":"main","message_template":"crit: invalid uid: (%lu)","reason":"The user ID of the process running suexec cannot be mapped to a valid username via getpwuid(). The system's user database may be corrupted.","resolution":"Verify the user database (typically \/etc\/passwd) is intact and not corrupted. Check that the Apache user exists in the system."},{"function":"main","message_template":"user mismatch (%s instead of %s)","reason":"The suexec program is being executed by a user other than the one defined in AP_HTTPD_USER (typically 'apache' or 'www-data').","resolution":"Ensure the suexec binary is only executable by the Apache user. Check file permissions and ownership of the suexec binary."},{"function":"main","message_template":"too few arguments","reason":"Suexec was invoked with fewer than the required arguments. It needs at least the target username, group name, and command.","resolution":"This is likely an Apache configuration issue. Check the SuexecUserGroup directive in your virtual host configuration."},{"function":"main","message_template":"invalid command (%s)","reason":"The command to be executed has an absolute path or contains path traversal sequences like '..\/'. This is a security violation.","resolution":"Modify the command to be relative to the document root without path traversal. This may indicate an attempt to exploit the system."},{"function":"main","message_template":"invalid target user name: (%s)","reason":"The target username specified does not exist in the password database. The user must exist for suexec to function.","resolution":"Create the specified user account in the system, or correct the username in the SuexecUserGroup directive."},{"function":"main","message_template":"invalid target user id: (%s)","reason":"The target user ID specified is invalid or cannot be mapped to a username.","resolution":"Verify the user ID exists in the system's user database. Use a valid username instead of a numeric ID if possible."},{"function":"main","message_template":"invalid target group name: (%s)","reason":"The target group name specified does not exist in the group database.","resolution":"Create the specified group in the system, or correct the group name in the SuexecUserGroup directive."},{"function":"main","message_template":"invalid target group id: (%s)","reason":"The target group ID specified is invalid or cannot be mapped to a group name.","resolution":"Verify the group ID exists in the system's group database. Use a valid group name instead of a numeric ID if possible."},{"function":"main","message_template":"failed to alloc memory","reason":"Memory allocation failed for storing user\/group information. Likely due to system resource constraints.","resolution":"Check system memory usage and possibly increase available memory. Consider limiting concurrent CGI executions."},{"function":"main","message_template":"failed to setup bs2000 environment for user %s: %s","reason":"On BS2000\/OSD systems, environment setup for the target user failed. This is platform-specific.","resolution":"Check the BS2000-specific user environment settings. This only applies to BS2000\/OSD systems."},{"function":"main","message_template":"uid: (%s\/%s) gid: (%s\/%s) cmd: %s","reason":"Informational log entry recording the execution of a command, showing the target and actual user\/group names.","resolution":"This is an informational message for auditing purposes, no resolution needed."},{"function":"main","message_template":"cannot run as forbidden uid (%lu\/%s)","reason":"The target user ID is either root (0) or below the minimum UID threshold defined by AP_UID_MIN. This is a security restriction.","resolution":"Use a user ID above the minimum threshold. Never attempt to run CGI scripts as root or system users."},{"function":"main","message_template":"cannot run as forbidden gid (%lu\/%s)","reason":"The target group ID is either root (0) or below the minimum GID threshold defined by AP_GID_MIN. This is a security restriction.","resolution":"Use a group ID above the minimum threshold. Never attempt to run CGI scripts as root or system groups."},{"function":"main","message_template":"failed to setgid\/initgroups (%lu: %s): %s","reason":"System call to set the group ID or initialize group access list failed. Often due to permission issues.","resolution":"Ensure suexec is running with sufficient privileges (typically setuid root) to change user\/group IDs."},{"function":"main","message_template":"failed to setuid (%lu: %s): %s","reason":"System call to set the user ID failed. Often due to permission issues or resource constraints.","resolution":"Ensure suexec is running with sufficient privileges (typically setuid root) to change user IDs."},{"function":"main","message_template":"cannot get current working directory","reason":"The getcwd() system call failed. This could be due to permission issues or the directory being deleted.","resolution":"Check permissions on the current working directory and its parent directories. Ensure the directory exists and is accessible."},{"function":"main","message_template":"cannot get docroot information (%s)","reason":"Failed to access or change to the document root directory. Either the user's home directory or the server's document root.","resolution":"Verify the document root or user home directory exists and has appropriate permissions. For ~userdir, ensure AP_USERDIR_SUFFIX is correctly configured."},{"function":"main","message_template":"command not in docroot (%s\/%s)","reason":"The command to be executed is not within the document root directory. This is a security restriction.","resolution":"Move the script into the appropriate document root or user directory. Never try to execute scripts outside the document root."},{"function":"main","message_template":"cannot stat directory: (%s)","reason":"The lstat() call on the current working directory failed, or the path is not a directory.","resolution":"Verify the directory exists and is actually a directory, not a symbolic link or other file type. Check permissions."},{"function":"main","message_template":"directory is writable by others: (%s)","reason":"The current working directory has write permissions for group or others, which is a security risk.","resolution":"Remove write permissions for group and others on the directory. Use 'chmod o-w,g-w directory' to fix permissions."},{"function":"main","message_template":"cannot stat program: (%s)","reason":"The lstat() call on the command to be executed failed, or the command is a symbolic link (which is not allowed).","resolution":"Ensure the script exists and is not a symbolic link. Symbolic links are not allowed for security reasons."},{"function":"main","message_template":"file is writable by others: (%s\/%s)","reason":"The command file has write permissions for group or others, which is a security risk.","resolution":"Remove write permissions for group and others on the script file. Use 'chmod o-w,g-w scriptfile' to fix permissions."},{"function":"main","message_template":"file is either setuid or setgid: (%s\/%s)","reason":"The command file has setuid or setgid bits set, which is a security risk.","resolution":"Remove setuid and setgid bits from the script file. Use 'chmod u-s,g-s scriptfile' to fix permissions."},{"function":"main","message_template":"target uid\/gid (%lu\/%lu) mismatch with directory (%lu\/%lu) or program (%lu\/%lu)","reason":"The ownership of the current directory or command file doesn't match the target user\/group IDs, which is a security risk.","resolution":"Change ownership of the directory and script file to match the target user and group. Use 'chown user:group directory scriptfile'."},{"function":"main","message_template":"file has no execute permission: (%s\/%s)","reason":"The command file does not have execute permission for the user, which would cause a cryptic error in Apache logs.","resolution":"Add execute permission for the owner of the script file. Use 'chmod u+x scriptfile' to fix permissions."},{"function":"main","message_template":"notice: AP_SUEXEC_UMASK of %03o allows write permission to group and\/or other","reason":"The configured umask for suexec allows write permissions, which could be a security risk.","resolution":"Consider changing the AP_SUEXEC_UMASK configuration to a more restrictive value (022 or 027) during compilation."},{"function":"main","message_template":"error: can't set close-on-exec flag","reason":"Failed to set the close-on-exec flag on the log file descriptor, which could lead to the CGI script accessing the log file.","resolution":"This is likely due to a system resource issue. Check for open file descriptor limits or other system constraints."},{"function":"main","message_template":"(%d)%s: exec failed (%s)","reason":"The execv() system call to execute the command failed. The specific error is included in the message.","resolution":"Check that the script exists, is executable, has a valid shebang line, and that system resources are sufficient. Common errors include 'Permission denied' or 'No such file or directory'."}],"project":"apache\/httpd"}