{"module":"apreq_custom_module.c","summary":"This module implements a custom request handler for the Apache Request library. It processes HTTP requests with customizable parsing of cookies, query strings, and request bodies, while enforcing configurable read limits.","logs":[{"function":"custom_parse_brigade","message_template":"APREQ_ERROR_OVERLIMIT status code","reason":"The request body size has exceeded the configured read limit. This occurs when a client sends more data than the server is configured to accept.","resolution":"Increase the read_limit configuration if larger requests are expected and legitimate. Otherwise, this may indicate an attempted DoS attack or misconfigured client."},{"function":"apreq_handle_custom","message_template":"APREQ_ERROR_NODATA status code for cookie data","reason":"No cookie data was provided in the request. This occurs when the cookie parameter is NULL.","resolution":"This is an informational status. If cookies are expected, verify the client is sending cookies and the application is correctly passing cookie data to this function."},{"function":"apreq_handle_custom","message_template":"APREQ_ERROR_NODATA status code for query string","reason":"No query string data was provided in the request. This occurs when the query_string parameter is NULL.","resolution":"This is an informational status. If query parameters are expected, verify the client is sending them and the application is correctly passing query string data to this function."},{"function":"custom_parser_set","message_template":"APR_ENOTIMPL status code","reason":"An attempt was made to set a new parser on an existing handle, but this functionality is not implemented.","resolution":"Create a new handle with the desired parser instead of trying to change the parser on an existing handle."},{"function":"custom_brigade_limit_set","message_template":"APR_ENOTIMPL status code","reason":"An attempt was made to set a new brigade limit, but this functionality is not implemented.","resolution":"Create a new handle with the desired brigade limit instead of trying to change it on an existing handle."},{"function":"custom_read_limit_set","message_template":"APR_ENOTIMPL status code","reason":"An attempt was made to set a new read limit, but this functionality is not implemented.","resolution":"Create a new handle with the desired read limit instead of trying to change it on an existing handle."},{"function":"custom_temp_dir_set","message_template":"APR_ENOTIMPL status code","reason":"An attempt was made to set a new temporary directory, but this functionality is not implemented.","resolution":"Create a new handle with the desired temporary directory instead of trying to change it on an existing handle."}],"project":"apache\/httpd"}