{"module":"apreq_parser.c","summary":"This module provides functionality for creating, registering, and managing parsers that handle different HTTP content types. It includes parsers for common formats like URL-encoded and multipart form data, as well as a framework for applying hooks during the parsing process.","logs":[{"function":"PARSER_STATUS_CHECK macro","message_template":"APREQ_ERROR_GENERAL","reason":"The parser context is in an error state, indicating a general failure in parsing the request content.","resolution":"Check the request content against the expected format for the content type. Look for malformed input or examine preceding errors that might have caused this state."},{"function":"PARSER_STATUS_CHECK macro","message_template":"APR_INCOMPLETE","reason":"The parser has not received a complete request (no brigade provided), so parsing cannot be completed yet.","resolution":"This is an informational status and generally does not require resolution. It indicates more data is expected."},{"function":"apreq_pre_initialize","message_template":"APR_SUCCESS","reason":"The parser initialization was successful or was already initialized.","resolution":"Information log, no resolution required."},{"function":"apreq_pre_initialize","message_template":"APREQ_ERROR_GENERAL","reason":"Parser initialization failed due to default_parsers_lock being set, indicating another initialization in progress.","resolution":"Ensure proper sequencing of initialization calls and avoid concurrent initialization attempts."},{"function":"apreq_post_initialize","message_template":"APREQ_ERROR_GENERAL","reason":"Post-initialization failed because pre-initialization was not completed successfully.","resolution":"Ensure apreq_pre_initialize is called and succeeds before calling apreq_post_initialize."},{"function":"apreq_register_parser","message_template":"APR_EINIT","reason":"Parser registration failed because the default_parsers hash has not been initialized.","resolution":"Ensure apreq_pre_initialize is called before attempting to register parsers."},{"function":"apreq_register_parser","message_template":"APR_EINVAL","reason":"Parser registration failed because a NULL enctype was provided.","resolution":"Provide a valid content type string when registering a parser."},{"function":"apreq_register_parser","message_template":"APREQ_ERROR_GENERAL","reason":"Parser registration failed because the parser registry is locked after post-initialization.","resolution":"Register all parsers before calling apreq_post_initialize or apreq_initialize."},{"function":"apreq_parser","message_template":"NULL return","reason":"No parser was found for the specified content type, or default_parsers_lock is 0 (not initialized).","resolution":"Ensure the system is properly initialized and that a parser is registered for the content type being processed."},{"function":"apreq_hook_disable_uploads","message_template":"APREQ_ERROR_GENERAL","reason":"An attempt was made to upload content while uploads are disabled.","resolution":"If uploads are needed, don't use the disable_uploads hook. Otherwise, this is expected behavior to prevent uploads."},{"function":"apreq_parse_generic","message_template":"APR_ENOMEM","reason":"The generic parser failed to create a parameter due to memory allocation failure.","resolution":"Check system resources and memory utilization. The system might be under heavy load or running out of memory."},{"function":"apreq_parse_generic","message_template":"GEN_ERROR","reason":"The generic parser encountered an error, likely while processing hooks or concatenating brigades.","resolution":"Examine the specific error returned from the hook or brigade operation. Check for malformed input or resource limitations."},{"function":"apreq_hook_apr_xml_parser","message_template":"XML_ERROR","reason":"The XML parser hook encountered an error while parsing XML content, either in reading data or in XML parsing.","resolution":"Check the XML content for well-formedness. Examine any specific XML parsing errors that might have been reported."},{"function":"apreq_parser_add_hook","message_template":"APR_SUCCESS","reason":"A hook was successfully added to the parser's hook chain.","resolution":"Information log, no resolution required."}],"project":"apache\/httpd"}