{"module":"apreq_parser_header.c","summary":"This module implements HTTP header parsing for the Apache Request library (apreq). It validates and extracts HTTP headers from a bucket brigade data structure, ensuring they conform to RFC standards for HTTP headers, and handles folded headers and various error conditions.","logs":[{"function":"PARSER_STATUS_CHECK","message_template":"APREQ_ERROR_GENERAL","reason":"Generic error condition encountered during header parsing. Triggered when the parser context status is already in an error state.","resolution":"Check the request headers for compliance with HTTP specifications. This is likely due to malformed request headers or unexpected input format."},{"function":"consume_header_line","message_template":"APR_ENOMEM","reason":"Memory allocation failure when trying to create a new parameter for a header.","resolution":"Check system memory resources. This likely indicates the server is running out of memory or there are resource constraints. Consider increasing memory allocation or implementing request throttling."},{"function":"apreq_parse_headers","message_template":"APREQ_ERROR_BADHEADER","reason":"Invalid header format detected. This can occur when a header has no name (empty before colon) or when line ending characters are improperly formatted.","resolution":"Validate client request headers. This likely indicates a malformed request from a client or a non-compliant HTTP implementation. Check for programming errors in clients sending requests."},{"function":"apreq_parse_headers","message_template":"APREQ_ERROR_BADCHAR","reason":"Invalid character detected in a header. Headers may only contain certain characters as defined by HTTP specifications.","resolution":"Check request headers for invalid characters. This may indicate a malicious request or a client using a non-compliant encoding. Ensure proper character encoding in request headers."},{"function":"apreq_parse_headers","message_template":"APR_INCOMPLETE","reason":"Header parsing is incomplete because more data is needed to complete the operation.","resolution":"This is an informational status, not an error. Wait for more data to arrive before completing the header parsing operation."}],"project":"apache\/httpd"}