{"module":"http_config.c","summary":"Core module responsible for reading and processing Apache HTTP Server configuration files, managing directives, handling modules registration, and setting up virtual hosts. Provides the foundation for server configuration processing including .htaccess files and directory context handling.","logs":[{"function":"ap_invoke_handler","message_template":"handler \"%s\" not found for: %s","reason":"Logs a warning when a specified handler (content processor) cannot be found for a particular resource. This typically occurs when a handler directive refers to a non-existent or unloaded module.","resolution":"Check the configuration to ensure the handler name is spelled correctly and that the corresponding module is loaded. This may require installing or enabling the module that provides the desired handler."},{"function":"ap_invoke_handler","message_template":"Handler for %s returned invalid result code %d","reason":"Logs an error when a content handler returns a result code that is neither a standard HTTP status code nor a recognized special value. This indicates a bug in the handler module.","resolution":"This is typically a module bug that needs to be reported to the module's maintainer. Check for an updated version of the problematic module or consider disabling it if it's not critical."},{"function":"ap_register_hooks","message_template":"Registering hooks for %s","reason":"Debug message that shows when modules are registering their hooks during server initialization. Only shown when SHOW_HOOKS environment variable is set.","resolution":"Informational log only, no resolution required. Useful for debugging module loading issues."},{"function":"ap_add_module","message_template":"Module \"%s\" is not compatible with this version of Apache (found %d, need %d). Please contact the vendor for the correct version.","reason":"Logs an error when attempting to load a module that was compiled for a different version of Apache. This indicates a version mismatch between the module and the server.","resolution":"Obtain a module version compiled specifically for your Apache version. Either upgrade\/downgrade Apache or find a compatible module version. For custom modules, recompile them against your current Apache installation."},{"function":"ap_add_module","message_template":"Module \"%s\" could not be loaded, because the dynamic module limit was reached. Please increase DYNAMIC_MODULE_LIMIT and recompile.","reason":"Logs an error when the server has reached the maximum number of dynamically loaded modules. This indicates a configuration with too many modules.","resolution":"Either remove unnecessary modules or recompile Apache with a higher DYNAMIC_MODULE_LIMIT value. Consider consolidating functionality to reduce the number of modules needed."},{"function":"ap_remove_module","message_template":"Cannot remove module %s: not found in module list","reason":"Logs an error when attempting to remove a module that isn't actually loaded or registered. This indicates a programming error in module management.","resolution":"This is usually an internal server error. Check the module loading sequence in your configuration and ensure that any LoadModule directives are correctly specified."},{"function":"ap_setup_prelinked_modules","message_template":"Ouch! Out of memory in ap_setup_prelinked_modules()!","reason":"Logs a critical error when the server cannot allocate memory to initialize modules during startup. This indicates system resource exhaustion.","resolution":"Increase available memory on the system or reduce memory usage by disabling unnecessary modules. On constrained systems, consider configuring the server to use less memory through settings like MaxClients\/MaxRequestWorkers."},{"function":"ap_walk_config_sub","message_template":"Unknown directive %s perhaps misspelled or defined by a module not included in the server configuration","reason":"Logs a warning when a configuration directive is not recognized by any loaded module. Typically caused by typos or missing modules.","resolution":"Check for typos in directive names. If the directive is correct, ensure that the module providing this directive is loaded. May require adding LoadModule directive or installing additional modules."},{"function":"ap_build_config_sub","message_template":"Invalid command '%s', perhaps misspelled or defined by a module not included in the server configuration","reason":"Logs an error when a configuration directive cannot be processed because it's not recognized. Similar to 'Unknown directive' but treated as a hard error.","resolution":"Check directive spelling and ensure the required module is loaded. Review Apache documentation for the correct directive syntax and module requirements."},{"function":"ap_process_resource_config","message_template":"Could not open configuration file %s: %pm","reason":"Logs an error when a specified configuration file cannot be opened. This may be due to permission issues or the file not existing.","resolution":"Verify that the configuration file exists at the specified path and that the Apache process has read permissions for it. Check ownership and file permissions."},{"function":"ap_process_resource_config","message_template":"Syntax error on line %d of %s: %s","reason":"Logs an error when a syntax error is found in a configuration file. The error includes the line number and specific error message.","resolution":"Review the indicated line in the configuration file and fix the syntax error. The specific error message should provide guidance on what needs to be corrected."},{"function":"ap_process_fnmatch_configs","message_template":"Include must have an absolute path, %s","reason":"Logs an error when an Include directive uses a relative path instead of an absolute path. Apache requires absolute paths for security reasons.","resolution":"Modify the Include directive to use an absolute path. If server-relative paths are needed, use the ServerRoot directive as a prefix."},{"function":"ap_process_fnmatch_configs","message_template":"Include has a bad path, %s","reason":"Logs an error when an Include directive specifies a path that is invalid or cannot be processed. This could be due to malformed paths.","resolution":"Review and correct the path in the Include directive. Ensure it is a valid filesystem path that Apache can access."},{"function":"ap_parse_htaccess","message_template":"%s pcfg_openfile: unable to check htaccess file, ensure it is readable and that '%s' is executable","reason":"Logs a critical error when an .htaccess file cannot be checked, often due to permission issues with either the file or its parent directory.","resolution":"Check permissions on both the .htaccess file (should be readable) and the directory containing it (should be executable\/searchable). Ensure the Apache process has appropriate access rights."},{"function":"ap_parse_htaccess","message_template":"Server unable to read htaccess file, denying access to be safe","reason":"Logs a note in the request when access is denied because an .htaccess file could not be properly read. This is a security measure.","resolution":"Check permissions on the .htaccess file and ensure the Apache process can read it. This error often appears in the browser as a 403 Forbidden response."},{"function":"init_server_config","message_template":"initialisation: bug or getaddrinfo fail","reason":"Logs a critical error when the server fails to initialize address information during startup. This may indicate networking configuration issues.","resolution":"Check the system's network configuration. This could indicate DNS issues, improper hostname resolution, or insufficient network privileges for the Apache process."},{"function":"ap_read_config","message_template":"Invalid config file path %s","reason":"Logs a critical error when the specified configuration file path is invalid and cannot be resolved relative to the server root.","resolution":"Check the path to the configuration file. Ensure it exists and is specified correctly. If using a relative path, make sure ServerRoot is correctly set."},{"function":"ap_build_config_sub","message_template":"Expected <\/%s> but saw %s>","reason":"Logs an error when there's a mismatch in container directive closing tags. For example, opening with <Directory> but closing with <\/Location>.","resolution":"Fix the configuration to properly match opening and closing container directives. Ensure nested containers are properly closed in the correct order."},{"function":"ap_build_config","message_template":"%s:%u: %s> was not closed.","reason":"Logs an error when a container directive (e.g., <Directory>) is opened but never closed in the configuration file.","resolution":"Add the missing closing directive (e.g., <\/Directory>) to the configuration file at the appropriate location."},{"function":"ap_soak_end_container","message_template":"Expected <\/%s> before end of configuration","reason":"Logs an error when a configuration section is not properly closed before the end of the file.","resolution":"Add the missing closing directive to properly close all open configuration sections."},{"function":"ap_invoke_handler","message_template":"HTTP_IGNORE_RANGE","reason":"Used as a note key when a module is deliberately returning a non-standard response code that should be allowed.","resolution":"Informational only, no resolution required. Used internally by modules that need special handling of response codes."},{"function":"ap_check_mpm","message_template":"Configuration error: %s","reason":"Logs a critical error when there's a problem with the MPM (Multi-Processing Module) configuration during server startup.","resolution":"Review MPM configuration settings. Check that the selected MPM is compatible with other loaded modules and server configuration settings."}],"project":"apache\/httpd"}