{"module":"http_connection.c","summary":"This module manages HTTP connection lifecycles in Apache HTTP Server, handling connection creation, processing, and orderly termination. It implements the lingering close mechanism that ensures reliable delivery of response data by properly handling TCP connection shutdown sequences.","logs":[{"function":"ap_create_connection","message_template":"Invalid outgoing parameter value","reason":"The function returns NULL if the outgoing parameter is greater than 1, which would likely result in errors logged elsewhere in the codebase when the caller attempts to use the NULL connection.","resolution":"Ensure that the outgoing parameter passed to ap_create_connection is either 0 or 1. Check the calling code for incorrect parameter values."},{"function":"ap_prep_lingering_close","message_template":"SERVER_CLOSING","reason":"Updates the scoreboard with SERVER_CLOSING status to indicate that a connection is in the process of closing. This helps in monitoring the server state.","resolution":"This is an informational status update rather than an error. If you see many connections in this state, it may indicate clients aren't closing connections properly or there might be network issues."},{"function":"ap_lingering_close","message_template":"short-lingering-close","reason":"Indicates that a connection is using a shortened lingering close period (2 seconds instead of 30) which can help mitigate certain DoS attacks by limiting resource allocation time.","resolution":"This is a security feature that can be triggered by adding this note to the connection. If you see many short lingering closes, investigate potential DoS attack patterns in your access logs."},{"function":"ap_process_connection","message_template":"Virtual host resolution","reason":"The ap_update_vhost_given_ip function is called to determine which virtual host should handle the connection based on the client's IP address.","resolution":"If virtual host resolution issues occur, check your virtual host configuration, especially IP-based virtual hosts, and ensure DNS resolution is working correctly if hostname-based virtual hosts are used."},{"function":"ap_shutdown_conn","message_template":"Connection shutdown failure","reason":"When shutting down a connection, if passing the end-of-connection bucket through the output filter chain fails, it could lead to incomplete responses or lingering connections.","resolution":"Check for filter-related issues or connection problems if you see these errors. This could indicate network instability or issues with custom output filters."},{"function":"ap_start_lingering_close","message_template":"Socket shutdown failure","reason":"Failure to properly shut down the write side of a socket can prevent the TCP FIN packet from being sent, leading to improper connection termination.","resolution":"Network or socket configuration issues might cause this. Check system resources, socket limits, and network stability if these errors appear frequently."}],"project":"apache\/httpd"}