{"module":"ap_listen.c","summary":"This module handles network socket creation, binding, and listening for Apache HTTP Server. It processes the Listen directive to configure which addresses and ports the server responds on, and manages socket options like buffer sizes, IPv6 settings, and systemd socket activation.","logs":[{"function":"make_sock","message_template":"make_sock: for address %pI, apr_socket_opt_set: (SO_REUSEADDR)","reason":"Failed to set the SO_REUSEADDR option on a socket, which allows the server to bind to a port even if it was recently used.","resolution":"Check operating system socket limits and configuration. This is a critical error that prevents the server from starting properly."},{"function":"make_sock","message_template":"make_sock: for address %pI, apr_socket_opt_set: (SO_KEEPALIVE)","reason":"Failed to set the SO_KEEPALIVE option on a socket, which helps detect disconnected clients.","resolution":"This issue might be due to operating system limitations. Review system socket configuration and consult OS documentation."},{"function":"make_sock","message_template":"make_sock: failed to set SendBufferSize for address %pI, using default","reason":"The server was unable to set the requested send buffer size for the socket and will use the system default instead.","resolution":"This is a warning, not an error. The server will continue to function, but possibly with suboptimal performance. Consider adjusting the SendBufferSize directive if high-throughput connections are needed."},{"function":"make_sock","message_template":"make_sock: failed to set ReceiveBufferSize for address %pI, using default","reason":"The server was unable to set the requested receive buffer size for the socket and will use the system default instead.","resolution":"This is a warning, not an error. The server will continue to function with the system default. Adjust the ReceiveBufferSize directive if needed for high-traffic situations."},{"function":"make_sock","message_template":"make_sock: for address %pI, apr_socket_opt_set: (SO_REUSEPORT)","reason":"Failed to set the SO_REUSEPORT option on a socket, which allows multiple processes to bind to the same port for better load distribution.","resolution":"This option may not be supported on all operating systems. In some cases, you may need to disable the reuseport option in your Listen directive."},{"function":"make_sock","message_template":"make_sock: apr_socket_opt_set: error setting APR_SO_FREEBIND","reason":"Failed to set the FREEBIND option, which allows binding to an IP address that might not exist yet on the system.","resolution":"This feature is primarily useful in advanced networking setups. Check if your kernel supports this option (generally available on Linux systems) and remove the 'freebind' option from Listen directives if not supported."},{"function":"make_sock","message_template":"make_sock: for address %pI, apr_socket_opt_set: (IPV6_V6ONLY)","reason":"Failed to configure IPv6 socket options, specifically whether the socket should accept only IPv6 connections or also handle mapped IPv4 addresses.","resolution":"This error often occurs on systems with limited or misconfigured IPv6 support. Check operating system IPv6 configuration and possibly adjust the v6only option in Listen directives."},{"function":"make_sock","message_template":"make_sock: could not bind to address %pI","reason":"The server failed to bind to the specified address and port, likely because the port is already in use or the process doesn't have permissions to bind to it.","resolution":"Ensure no other process is using the port (use 'netstat -tuln' or equivalent). If running on a privileged port (<1024), make sure the server has proper permissions. You may need to change the port in your Listen directive."},{"function":"make_sock","message_template":"make_sock: unable to listen for connections on address %pI","reason":"The socket was created and bound successfully, but the server failed to put it in listening mode.","resolution":"This is usually due to system resource limitations. Check system limits for maximum number of file descriptors and network connections. Consider increasing system limits or reducing ListenBacklog value."},{"function":"ap_set_listener","message_template":"Failed to enable the '%s' Accept Filter","reason":"The server failed to enable the specified accept filter for a listener.","resolution":"This often happens when the specified accept filter isn't supported by the operating system. On FreeBSD\/NetBSD, ensure the appropriate accept filter kernel module is loaded. On Linux, this typically uses TCP_DEFER_ACCEPT instead."},{"function":"ap_set_listener","message_template":"Failed to enable APR_TCP_DEFER_ACCEPT","reason":"The server couldn't enable the TCP_DEFER_ACCEPT socket option, which improves performance by only waking up the server when data is available.","resolution":"This feature might not be supported on all operating systems. The server will continue functioning normally but might be slightly less efficient. No action is typically required."},{"function":"alloc_systemd_listener","message_template":"getsockname on %d failed.","reason":"Failed to get socket name information from a systemd-provided socket.","resolution":"This likely indicates a problem with systemd socket activation. Verify your systemd socket configuration and ensure it matches your Apache configuration."},{"function":"alloc_systemd_listener","message_template":"apr_os_sock_make on %d failed.","reason":"Failed to create an APR socket from the file descriptor provided by systemd.","resolution":"This indicates a compatibility issue between Apache's APR library and the socket provided by systemd. Check your systemd configuration and ensure it's properly set up for Apache."},{"function":"alloc_systemd_listener","message_template":"apr_socket_addr_get on %d failed.","reason":"Failed to get address information for a systemd-provided socket.","resolution":"This could indicate a corrupt socket state or incompatible socket type provided by systemd. Review your systemd socket unit configuration and ensure it's correctly formatted."},{"function":"ap_set_listener","message_template":"Systemd socket activation is used, but mod_systemd is probably not loaded","reason":"Systemd socket activation is being attempted, but the required mod_systemd module isn't loaded in Apache.","resolution":"Ensure that mod_systemd is compiled and loaded in your Apache configuration if you plan to use systemd socket activation. Add 'LoadModule systemd_module modules\/mod_systemd.so' to your configuration."},{"function":"ap_set_listener","message_template":"Systemd socket activation is used, but this port is not configured in systemd","reason":"The server is configured to use a port via systemd socket activation, but systemd isn't configured to provide that port.","resolution":"Ensure your systemd socket unit files match the ports specified in your Apache configuration. You might need to add or modify systemd socket units and restart systemd socket services."},{"function":"ap_set_listener","message_template":"Failed to setup socket passed by systemd using socket activation","reason":"The server encountered a general error when trying to use a socket provided by systemd.","resolution":"This is a generic error that could have various causes. Check both Apache and systemd logs for more specific error messages. Ensure systemd is correctly passing socket information to Apache."},{"function":"alloc_listener","message_template":"Cannot define multiple Listeners on the same IP:port","reason":"The configuration attempts to define multiple Listen directives for the same IP address and port.","resolution":"Review your configuration files and remove duplicate Listen directives. Each IP:port combination should only be specified once."},{"function":"alloc_listener","message_template":"Cannot define a slave on the same IP:port as a Listener","reason":"The configuration attempts to define both a regular listener and a slave listener on the same IP:port combination.","resolution":"Check your configuration for conflicting Listen directives. Slave listeners (for certain MPMs) cannot share the same IP:port as regular listeners."},{"function":"alloc_listener","message_template":"alloc_listener: failed to set up sockaddr for %s","reason":"Failed to create a socket address structure for the specified address.","resolution":"This usually indicates an invalid address format in a Listen directive. Check the syntax of your Listen directives, particularly for IPv6 addresses which should be enclosed in square brackets."},{"function":"alloc_listener","message_template":"alloc_listener: failed to get a socket for %s","reason":"Failed to create a socket for the specified address.","resolution":"This could indicate resource exhaustion or lack of permissions. Check system limits for maximum number of file descriptors and ensure the server has appropriate permissions for networking operations."},{"function":"alloc_listener","message_template":"alloc_listener: failed to set scope for %pI to %s","reason":"Failed to set the IPv6 scope for a listener socket.","resolution":"This typically happens with IPv6 link-local addresses when the scope ID is invalid. Check your IPv6 configuration and ensure the scope ID is correct for your network interfaces."},{"function":"open_listeners","message_template":"unable to control socket non-blocking status","reason":"Failed to set non-blocking mode on a socket when multiple listening sockets are being used.","resolution":"This indicates a problem with the operating system's socket implementation. Check for operating system updates or patches that might address socket control issues."},{"function":"ap_duplicate_listeners","message_template":"Using %i listeners bucket(s) based on %i online CPU cores and a ratio of %i","reason":"Informational message about how many listener buckets are being used based on CPU cores and configuration.","resolution":"Informational log, no resolution required. This helps understand how Apache is allocating listener sockets across worker processes."},{"function":"ap_duplicate_listeners","message_template":"ListenCoresBucketsRatio ignored without SO_REUSEPORT and _SC_NPROCESSORS_ONLN support: using a single listeners bucket","reason":"The ListenCoresBucketsRatio directive is being ignored because the system doesn't support required features.","resolution":"If you need listener balancing across cores, consider upgrading to a Linux kernel that supports SO_REUSEPORT (3.9+) and has _SC_NPROCESSORS_ONLN support. Otherwise, no action is needed."},{"function":"ap_duplicate_listeners","message_template":"failure looking up %s to duplicate listening socket","reason":"Failed to resolve a hostname when duplicating listener sockets.","resolution":"Ensure DNS is working correctly and that all hostnames in Listen directives can be resolved. Consider using IP addresses instead of hostnames in Listen directives for reliability."},{"function":"ap_duplicate_listeners","message_template":"ap_duplicate_listeners: for address %pI, cannot duplicate a new socket!","reason":"Failed to create a duplicate socket for a listening address when spawning additional worker processes.","resolution":"This usually indicates system resource exhaustion. Check for limits on file descriptors and total number of sockets. Consider increasing system limits or reducing the number of listeners."},{"function":"ap_set_listener","message_template":"Listen option '%s' in '%s' is not supported on this system","reason":"A specified option in a Listen directive is not supported on the current operating system.","resolution":"Remove the unsupported option from your Listen directive. Different systems support different socket options - check OS documentation for compatibility information."},{"function":"ap_set_listener","message_template":"Unknown Listen option '%s' in '%s'","reason":"A Listen directive contains an unrecognized option.","resolution":"Check your configuration for typos in Listen directive options. Valid options include 'freebind', 'reuseport', 'v6only', and sometimes 'multipathtcp'."}],"project":"apache\/httpd"}