{"module":"http_log.c","summary":"This module handles logging functionality for Apache HTTP Server, including error logging, piped logging to external programs, and PID file management. It provides functions for logging messages at different severity levels and supports customizable log formats.","logs":[{"function":"ap_replace_stderr_log","message_template":"Invalid -E error log file %s","reason":"The error log file path specified with the -E command line option is invalid or cannot be resolved","resolution":"Check the error log file path and ensure it's valid and accessible to the Apache process"},{"function":"ap_replace_stderr_log","message_template":"%s: could not open error log file %s.","reason":"Failed to open the specified error log file, possibly due to permission issues or a non-existent directory","resolution":"Verify file permissions and ensure the directory exists and is writable by the Apache process"},{"function":"ap_replace_stderr_log","message_template":"unable to replace stderr with error log file","reason":"Failed to redirect standard error to the error log file","resolution":"Check file descriptors and permissions, and ensure the system allows file descriptor redirection"},{"function":"open_error_log","message_template":"Couldn't start ErrorLog process '%s'.","reason":"Failed to start the external program specified for piped logging in ErrorLog directive","resolution":"Verify the program exists, has correct permissions, and can be executed by the Apache process"},{"function":"open_error_log","message_template":"%s: Invalid error log path %s.","reason":"The specified error log path is invalid or cannot be resolved relative to the server root","resolution":"Check the error log path and ensure it's valid and accessible to the Apache process"},{"function":"open_error_log","message_template":"%s: could not open error log file %s.","reason":"Failed to open the error log file, possibly due to permission issues or a non-existent directory","resolution":"Verify file permissions and ensure the directory exists and is writable by the Apache process"},{"function":"ap_replace_stderr_log","message_template":"unable to replace stderr with %s","reason":"Failed to redirect standard error to the specified file (usually \/dev\/null)","resolution":"Check if the file exists and has correct permissions"},{"function":"ap_remove_pid","message_template":"failed to remove PID file %s","reason":"Failed to remove the PID file, typically during server shutdown","resolution":"Check file permissions and ensure the Apache process has write access to the file"},{"function":"ap_remove_pid","message_template":"removed PID file %s (pid=%)","reason":"Successfully removed the PID file during server shutdown","resolution":"Information log, no resolution required"},{"function":"ap_log_pid","message_template":"Invalid PID file path %s, ignoring.","reason":"The specified PID file path is invalid or cannot be resolved relative to the server root","resolution":"Check the PID file path in the configuration and ensure it's valid"},{"function":"ap_log_pid","message_template":"pid file %s overwritten -- Unclean shutdown of previous Apache run?","reason":"A PID file already exists when trying to create a new one, indicating a potential unclean shutdown","resolution":"Check for lingering Apache processes and ensure clean shutdowns. May require manual cleanup of PID file"},{"function":"ap_log_pid","message_template":"could not create %s","reason":"Failed to create a temporary PID file","resolution":"Check directory permissions and ensure the Apache process can write to the directory"},{"function":"ap_log_pid","message_template":"%s: could not log pid to file %s","reason":"Failed to write the process ID to the PID file","resolution":"Check file permissions and ensure the Apache process can write to the file"},{"function":"ap_log_pid","message_template":"%s: Failed creating pid file %s","reason":"Failed to create the PID file or rename the temporary file to the final PID file","resolution":"Check file and directory permissions and ensure the Apache process can write to them"},{"function":"ap_read_pid","message_template":"Invalid PID file path %s, ignoring.","reason":"The specified PID file path is invalid or cannot be resolved relative to the server root","resolution":"Check the PID file path in the configuration and ensure it's valid"},{"function":"ap_log_assert","message_template":"[%s] file %s, line %d, assertion \"%s\" failed","reason":"An assertion in the code failed, indicating a programming error or unexpected condition","resolution":"This is a critical error indicating a bug in Apache. Check the Apache error logs for more details and report the issue"},{"function":"piped_log_spawn","message_template":"piped_log_spawn: unable to setup child process '%s'","reason":"Failed to set up the child process for piped logging","resolution":"Check system resources, permissions, and ensure the specified program can be executed by the Apache process"},{"function":"piped_log_spawn","message_template":"unable to start piped log program '%s'","reason":"Failed to start the external program for piped logging","resolution":"Verify the program exists, has correct permissions, and can be executed by the Apache process"},{"function":"piped_log_maintenance","message_template":"can't query MPM state; not restarting piped log program '%s'","reason":"Failed to query the Multi-Processing Module state, preventing the restart of a piped log program","resolution":"Check the Apache configuration and ensure the MPM is properly configured"},{"function":"piped_log_maintenance","message_template":"piped log program '%s' failed unexpectedly","reason":"The external program used for piped logging terminated unexpectedly","resolution":"Check the program for errors and ensure it's correctly handling the log data. May need to fix bugs in the external program"},{"function":"piped_log_maintenance","message_template":"piped_log_maintenance: unable to respawn '%s'","reason":"Failed to restart the external program for piped logging after it terminated","resolution":"Verify the program exists, has correct permissions, and can be executed by the Apache process"},{"function":"ap_open_piped_log_ex","message_template":"Couldn't start piped log process '%s'.","reason":"Failed to start the external program for piped logging","resolution":"Verify the program exists, has correct permissions, and can be executed by the Apache process"},{"function":"ap_log_command_line","message_template":"Command line: '%s'","reason":"Logs the command line arguments used to start Apache","resolution":"Information log, no resolution required"},{"function":"ap_log_mpm_common","message_template":"Using SO_REUSEPORT: %s (%d)","reason":"Logs whether SO_REUSEPORT socket option is being used and the number of listen buckets","resolution":"Information log, no resolution required"},{"function":"ap_parse_log_level","message_template":"Log level keyword must be one of emerg\/alert\/crit\/error\/warn\/notice\/info\/debug\/trace1\/...\/trace8","reason":"An invalid log level keyword was provided in the configuration","resolution":"Correct the log level in the configuration to use one of the valid keywords"}],"project":"apache\/httpd"}