{"module":"protocol.c","summary":"The protocol.c module handles HTTP protocol processing, including request\/response handling, header management, authentication, and protocol negotiation. It's responsible for parsing incoming requests, managing HTTP headers, validating protocol compliance, and generating appropriate responses.","logs":[{"function":"ap_get_mime_headers_core","message_template":"NULL bytes in header","reason":"The request header contains NULL bytes, which is invalid according to HTTP specifications and might indicate a malicious request.","resolution":"Check for client software bugs or potential security attacks. Ensure the client is sending properly formatted HTTP headers."},{"function":"ap_update_vhost_from_headers_ex","message_template":"Requested hostname '%s' did not match any ServerName\/ServerAlias in the global server configuration","reason":"The hostname in the request does not match any configured virtual hosts in the global server configuration.","resolution":"Add the hostname to your ServerName\/ServerAlias configuration, or ensure the client is using the correct hostname. This can indicate misconfigured DNS or clients using incorrect URLs."},{"function":"ap_update_vhost_from_headers_ex","message_template":"Requested hostname '%s' did not match any ServerName\/ServerAlias in the matching virtual host (default vhost for current connection is %s:%u)","reason":"The hostname in the request does not match any configured virtual hosts for the connection's IP:port.","resolution":"Add the hostname to your ServerName\/ServerAlias configuration in the appropriate virtual host section. Check for DNS misconfiguration or clients using incorrect hostnames."},{"function":"ap_check_request_header","message_template":"client sent HTTP\/1.1 request without hostname (see RFC2616 section 14.23): %s","reason":"An HTTP\/1.1 request was received without a Host header, which is required by the HTTP\/1.1 specification.","resolution":"Ensure the client software is RFC compliant and sends the Host header. This often indicates an older or non-compliant HTTP client."},{"function":"ap_check_request_header","message_template":"client sent an unrecognized expectation value of Expect (not fatal): %s","reason":"The client sent an Expect header with a value that is not recognized by the server, but the server is configured to not treat this as a fatal error.","resolution":"This is an informational message. If it appears frequently, check if clients are using correct Expect header values or adjust the server configuration for stricter handling."},{"function":"ap_check_request_header","message_template":"client sent an unrecognized expectation value of Expect: %s","reason":"The client sent an Expect header with a value that is not recognized by the server, resulting in a 417 Expectation Failed response.","resolution":"Modify client requests to use valid Expect header values (typically '100-continue'). If this is from a legitimate client, you may need to adjust the server's http_expect_strict setting."},{"function":"table_do_fn_check_lengths","message_template":"Request header exceeds LimitRequestFieldSize after merging: %.*s","reason":"After combining headers with the same name, the resulting header value exceeds the configured size limit.","resolution":"Increase LimitRequestFieldSize in your Apache configuration if these are legitimate requests, or investigate for potential attacks using oversized headers."},{"function":"ap_get_mime_headers_core","message_template":"Line folding encountered before first header line","reason":"A line continuation (folded line) was found before any header line was processed, which is invalid HTTP syntax.","resolution":"This indicates a malformed request, possibly from a misbehaving client or attack attempt. Check client software for compliance with HTTP specifications."},{"function":"ap_get_mime_headers_core","message_template":"Empty folded line encountered","reason":"A line continuation (folded line) was empty, which is invalid HTTP syntax.","resolution":"This indicates a malformed request, possibly from a misbehaving client or attack attempt. Check client software for compliance with HTTP specifications."},{"function":"ap_get_mime_headers_core","message_template":"Request header exceeds LimitRequestFieldSize after folding: %.*s","reason":"After unfolding a header line (combining line continuations), the resulting header exceeds the configured size limit.","resolution":"Increase LimitRequestFieldSize in your Apache configuration if these are legitimate requests, or investigate for potential attacks using oversized headers."},{"function":"ap_get_mime_headers_core","message_template":"Number of request headers exceeds LimitRequestFields","reason":"The client sent more header fields than allowed by the server's LimitRequestFields setting.","resolution":"Increase LimitRequestFields in your Apache configuration if these are legitimate requests with many headers, or investigate for potential DoS attacks."},{"function":"ap_get_mime_headers_core","message_template":"Request header field is missing ':' separator: %.*s","reason":"A request header line was found without the required colon separator between field name and value.","resolution":"This indicates a malformed request, possibly from a misbehaving client or attack attempt. Check client software for compliance with HTTP specifications."},{"function":"ap_get_mime_headers_core","message_template":"Request header field name was empty","reason":"A request header line was found with an empty field name (a colon at the start of the line).","resolution":"This indicates a malformed request, possibly from a misbehaving client or attack attempt. Check client software for compliance with HTTP specifications."},{"function":"ap_get_mime_headers_core","message_template":"Request header field name presented invalid whitespace","reason":"A request header field name contained whitespace, which is not allowed by HTTP specifications.","resolution":"This indicates a malformed request from a non-compliant HTTP client. Check client software for compliance with HTTP specifications."},{"function":"ap_get_mime_headers_core","message_template":"Request header field value presented bad whitespace","reason":"A request header field value contained invalid whitespace characters that are not permitted by HTTP specifications.","resolution":"This indicates a malformed request from a non-compliant HTTP client. Check client software for compliance with HTTP specifications."},{"function":"ap_get_mime_headers_core","message_template":"Request header field name is malformed: %.*s","reason":"A request header field name contained invalid characters according to HTTP syntax requirements.","resolution":"This indicates a malformed request, possibly from a misbehaving client or attack attempt. Check client software for compliance with HTTP specifications."},{"function":"ap_get_mime_headers_core","message_template":"Request header value is malformed: %.*s","reason":"A request header field value contained invalid characters according to HTTP syntax requirements.","resolution":"This indicates a malformed request, possibly from a misbehaving client or attack attempt. Check client software for compliance with HTTP specifications."},{"function":"r_assign_protocol","message_template":"HTTP Request: Unrecognized protocol '%.*s' (perhaps whitespace was injected?)","reason":"The HTTP protocol version in the request line was not a recognized format like HTTP\/1.1.","resolution":"Check for client software bugs, proxy issues, or potential attacks attempting protocol injection. Ensure the client sends a valid HTTP protocol version."},{"function":"r_assign_protocol","message_template":"HTTP Request: Rejected HTTP\/0.9 request","reason":"An HTTP\/0.9 request was received, but the server is configured to reject HTTP\/0.9 requests.","resolution":"Either update the client to use HTTP\/1.0 or later, or enable HTTP\/0.9 support in Apache configuration if needed for legacy clients."},{"function":"r_assign_protocol","message_template":"HTTP Request: Invalid method token: '%.*s' (only GET is allowed for HTTP\/0.9 requests)","reason":"An HTTP\/0.9 request was received with a method other than GET, which is invalid according to the HTTP\/0.9 specification.","resolution":"Update the client to use HTTP\/1.0 or later for methods other than GET, as HTTP\/0.9 only supports GET requests."},{"function":"ap_assign_request_line","message_template":"HTTP Request Line; Unrecognized HTTP method: '%.*s' (disallowed by RegisteredMethods)","reason":"The HTTP method in the request is not in the list of methods allowed by the RegisteredMethods configuration.","resolution":"Either update the client to use a standard HTTP method, or add the custom method to the RegisteredMethods configuration if it's legitimate."},{"function":"ap_assign_request_line","message_template":"HTTP Request Line; Unable to parse URI: '%.*s'","reason":"The server couldn't parse the URI in the request line, possibly due to malformation.","resolution":"Check for client software bugs or misconfiguration that's causing invalid URIs to be sent. This could also indicate an attack attempt."},{"function":"ap_assign_request_line","message_template":"HTTP Request Line; URI must not contain a fragment","reason":"The request URI contains a fragment (part after #), which is not allowed in HTTP requests.","resolution":"Update the client to remove URI fragments before sending the request. Fragments should be processed by the client and not sent to the server."},{"function":"ap_assign_request_line","message_template":"HTTP Request Line; URI must not contain a username\/password","reason":"The request URI contains authentication credentials in the form of username\/password, which is not allowed in strict HTTP compliance mode.","resolution":"Update the client to use proper HTTP authentication mechanisms instead of embedding credentials in the URI. This practice is deprecated and insecure."},{"function":"ap_read_request","message_template":"request failed: neither request bucket nor error at start of input","reason":"The server couldn't find a valid request or error bucket in the input stream, indicating a fundamental issue with request processing.","resolution":"This indicates a severe internal error or possible corruption in the connection handling. Check for module conflicts or server bugs."},{"function":"ap_read_request","message_template":"request failed: client's request-line exceeds LimitRequestLine (longer than %d)","reason":"The HTTP request line (method, URI, protocol) exceeded the configured maximum length.","resolution":"Increase LimitRequestLine in your Apache configuration if these are legitimate requests with long URIs, or investigate for potential attacks using oversized request lines."},{"function":"ap_read_request","message_template":"request failed: malformed request line","reason":"The HTTP request line could not be parsed due to syntax errors or malformation.","resolution":"Check for client software bugs or non-compliant HTTP clients. This could also indicate an attack attempt."},{"function":"ap_read_request","message_template":"request failed: seeing DATA bucket(len=%d) of request body, too early to process","reason":"Data was encountered in the request stream before the request headers were fully processed, which violates HTTP protocol sequencing.","resolution":"This indicates a non-compliant HTTP client or possible issue with connection handling. Check client software and any proxies in between."},{"function":"ap_read_request","message_template":"client sent invalid Content-Length (%s): %s","reason":"The Content-Length header value in the request is not a valid number.","resolution":"Check for client software bugs or non-compliant HTTP clients. This could also indicate an attack attempt trying to exploit Content-Length parsing."},{"function":"ap_note_auth_failure","message_template":"need AuthType to note auth failure: %s","reason":"Authentication failed but no AuthType was configured for the resource, making it impossible to generate the proper authentication challenge.","resolution":"Configure an AuthType (like Basic, Digest, etc.) in your Apache configuration for resources requiring authentication."},{"function":"ap_get_basic_auth_pw","message_template":"need AuthName: %s","reason":"Basic authentication was attempted but no AuthName (realm) was configured for the resource.","resolution":"Add an AuthName directive to your Apache configuration to specify the authentication realm for resources requiring authentication."},{"function":"ap_get_basic_auth_pw","message_template":"client used wrong authentication scheme: %s","reason":"The client attempted to authenticate using a scheme different from what the server expected (not Basic auth).","resolution":"Configure the client to use the correct authentication scheme as required by the server, or adjust the server configuration if needed."},{"function":"ap_content_length_filter","message_template":"ap_content_length_filter: apr_bucket_read() failed","reason":"Failed to read a data bucket while computing the content length for a response.","resolution":"This indicates an internal error, possibly a problem with a module or filter that is generating invalid data buckets. Check for module conflicts or bugs."},{"function":"ap_send_interim_response","message_template":"Status is %d - not sending interim response","reason":"An attempt was made to send an interim response (like 100 Continue) but the current status code is not an informational (1xx) status.","resolution":"This is an informational message about internal flow control. No action is required unless this logic is causing unexpected behavior."},{"function":"ap_select_protocol","message_template":"select protocol from %s, choices=%s for server %s","reason":"Debug log showing protocol negotiation information, listing available protocols and choices for a server.","resolution":"Informational log, no action required. Useful for troubleshooting protocol negotiation issues."},{"function":"ap_select_protocol","message_template":"select protocol, proposals=%s preferences=%s configured=%s","reason":"Debug log showing detailed protocol negotiation information, including proposals, preferences, and configured protocols.","resolution":"Informational log, no action required. Useful for troubleshooting protocol negotiation issues."},{"function":"ap_select_protocol","message_template":"selected protocol=%s","reason":"Debug log showing the result of protocol negotiation - which protocol was selected.","resolution":"Informational log, no action required. Useful for confirming protocol selection outcomes."},{"function":"ap_switch_protocol","message_template":"already at it, protocol_switch to %s","reason":"An attempt was made to switch to a protocol that is already in use for the connection.","resolution":"This is a warning that indicates a possible logic error in the code calling protocol_switch. Review the module trying to perform the switch."},{"function":"ap_switch_protocol","message_template":"no implementation for protocol_switch to %s","reason":"The server attempted to switch to a protocol, but no module has registered an implementation to handle that protocol.","resolution":"Install and enable the appropriate module for the requested protocol (e.g., mod_http2 for HTTP\/2). Check module loading in the server configuration."},{"function":"ap_switch_protocol","message_template":"unexpected return code %d from protocol_switch to %s","reason":"A protocol switch handler returned an unexpected status code, indicating a possible error or unexpected condition.","resolution":"This indicates a potential bug in the module handling the protocol switch. Check for module updates or report the issue to the module maintainer."}],"project":"apache\/httpd"}