{"module":"request.c","summary":"This module handles HTTP request processing in Apache httpd, managing the request pipeline through directory configuration, location matching, file walking, authentication processing, and symbolic link resolution. It's responsible for enforcing access controls, handling configuration directives, and creating and processing subrequests.","logs":[{"function":"decl_die","message_template":"configuration error:  couldn't %s: %s","reason":"Logs a critical error when a required phase in request processing fails with DECLINED status, indicating a configuration error in the server.","resolution":"Check your Apache configuration for errors related to the specified phase. Review any module configurations that might contribute to this phase returning unexpected DECLINED results."},{"function":"decl_die","message_template":"auth phase '%s' gave status %d: %s","reason":"Logs trace-level information when an authentication phase gives a non-OK, non-DECLINED status, used for debugging authentication flow.","resolution":"This is an informational message for debugging. No action is required unless related authentication errors are occurring."},{"function":"ap_process_request_internal","message_template":"invalid URI path (%s)","reason":"Logs an error when the URI path cannot be properly normalized, indicating a malformed request URI.","resolution":"This typically happens when the client sends an invalid URI that cannot be parsed. Check for malicious requests or buggy clients that are sending malformed URIs."},{"function":"ap_process_request_internal","message_template":"found %%2f (encoded '\/') in URI path (%s), returning 404","reason":"Logs when encoded slashes are found in the URI but are not allowed in the current configuration.","resolution":"If this is expected behavior, you can configure Apache to allow encoded slashes using the 'AllowEncodedSlashes' directive in your httpd.conf."},{"function":"ap_process_request_internal","message_template":"No authentication done but request not allowed without authentication for %s. Authentication not configured?","reason":"Logs when authentication is required but no authentication was performed, possibly due to misconfiguration of authentication modules.","resolution":"Verify that authentication is properly configured for the requested resource. Check that the appropriate authentication modules are loaded and configured in your httpd.conf or .htaccess files."},{"function":"ap_process_request_internal","message_template":"request authorized without authentication by access_checker_ex hook: %s","reason":"Logs a trace message when a request is authorized by the access_checker_ex hook without requiring authentication.","resolution":"This is an informational message. No action is required unless this represents unexpected behavior in your authentication configuration."},{"function":"ap_process_request_internal","message_template":"request authorized bypassing access_checker by token_checker hook and 'Satisfy any': %s","reason":"Logs a trace message when a request is authorized by the token_checker hook when 'Satisfy any' is enabled, bypassing other access checks.","resolution":"This is an informational message indicating normal operation when using 'Satisfy any' with token-based authentication. No action is required."},{"function":"ap_process_request_internal","message_template":"request authorized without authentication by access_checker hook and 'Satisfy any': %s","reason":"Logs a trace message when a request is authorized by the access_checker hook with 'Satisfy any' enabled, bypassing authentication.","resolution":"This is an informational message indicating normal operation when using 'Satisfy any'. No action is required."},{"function":"ap_process_request_internal","message_template":"fixups hook gave %d: %s","reason":"Logs a trace message when the fixups hook returns a non-standard status, used for debugging request processing flow.","resolution":"This is a debugging message. If you see error codes here, check the modules implementing fixups hooks for potential issues."},{"function":"ap_directory_walk","message_template":"Module bug?  Request filename is missing for URI %s","reason":"Logs an informational message when a module is trying to process a request without setting r->filename, which could indicate a bug.","resolution":"This usually indicates a bug in a module. Check the modules that are handling this request path and ensure they are properly setting the filename field."},{"function":"ap_directory_walk","message_template":"Module bug?  Request filename path %s is invalid or or not absolute for uri %s","reason":"Logs an informational message when a module sets r->filename to an invalid or non-absolute path.","resolution":"This indicates a potential bug in a module. Check modules handling this URI to ensure they correctly set absolute paths in r->filename."},{"function":"ap_directory_walk","message_template":"access to %s failed; stat of '%s' failed.","reason":"Logs an error when the server cannot stat (check) a file that was previously accessible, typically due to race conditions or permission changes.","resolution":"Check file permissions and ensure the Apache user has proper access to the requested file. This could also indicate filesystem issues or a race condition where files are being removed as Apache tries to access them."},{"function":"ap_directory_walk","message_template":"Symbolic link not allowed or link target not accessible: %s","reason":"Logs an error when a symbolic link is encountered but either symlinks are not allowed or the link target cannot be accessed.","resolution":"If you want to allow symlinks, update your configuration with 'Options +FollowSymLinks'. If symlinks are allowed but targets are inaccessible, check file permissions on the link targets."},{"function":"ap_directory_walk","message_template":"dir_walk error, path_info %s is not relative to the filename path %s for uri %s","reason":"Logs an error when path_info cannot be properly merged with the filename, indicating a potential path traversal issue or misconfiguration.","resolution":"This indicates an internal error in path processing. Check for unusual path configurations or potential path traversal attacks in the URI."},{"function":"ap_directory_walk","message_template":"dir_walk error, could not determine the root path of filename %s%s for uri %s","reason":"Logs an error when the root path of a filename cannot be determined, which could indicate file system issues or misconfiguration.","resolution":"Check your configuration for correct document root specifications. This could also indicate issues with file system mounts or permissions."},{"function":"ap_directory_walk","message_template":"access to %s denied (filesystem path '%s') because search permissions are missing on a component of the path","reason":"Logs an error when access is denied due to missing search (execute) permissions on a directory in the path.","resolution":"Check directory permissions along the entire path. The Apache user needs execute (search) permission on all directories in the path to the requested resource."},{"function":"ap_directory_walk","message_template":"access to %s failed (filesystem path '%s')","reason":"Logs an error when access to a file or directory fails for reasons other than search permissions, such as a race condition or file system error.","resolution":"Check file permissions and ensure the Apache user has proper access to the requested file. Also verify the file system is functioning correctly and not experiencing errors."},{"function":"ap_directory_walk","message_template":"Forbidden: %s doesn't point to a file or directory","reason":"Logs an error when a path resolves to neither a file nor a directory, such as a device file or socket that Apache cannot serve.","resolution":"Check the file type of the requested resource. Apache can only serve regular files or directories, not special file types like sockets or block devices."},{"function":"ap_if_walk_sub","message_template":"Failed to evaluate <If > condition: %s","reason":"Logs an error when an <If> condition in the configuration cannot be evaluated, typically due to a syntax error or invalid expression.","resolution":"Check the syntax of your <If> conditions in httpd.conf or .htaccess files. Verify that any expressions used are valid and that all variables referenced exist."}],"project":"apache\/httpd"}