{"module":"scoreboard.c","summary":"This module manages the Apache HTTP Server scoreboard, a shared memory area that tracks server processes, worker threads, and connection statistics. It handles scoreboard creation, initialization, and status updates for communication between the parent server and its worker processes.","logs":[{"function":"create_namebased_scoreboard","message_template":"unable to create or access scoreboard \"%s\" (name-based shared memory failure)","reason":"The server failed to create or access the scoreboard shared memory segment with the specified filename. This typically occurs due to permission issues, lack of system resources, or conflicts with existing shared memory segments.","resolution":"Check file permissions on the scoreboard file path. Ensure sufficient system resources (shared memory) are available. Try removing any existing scoreboard file. Verify the Apache user has write permissions to the directory."},{"function":"open_scoreboard","message_template":"Fatal error: Invalid Scoreboard path %s","reason":"The server cannot use the specified scoreboard path because it's invalid, likely due to a non-absolute path or a path that Apache cannot access.","resolution":"Check the ScoreboardFile directive in your configuration. Ensure the path is absolute, exists, and has proper permissions. The directory containing the scoreboard file must be writable by the Apache user."},{"function":"open_scoreboard","message_template":"Unable to create or access scoreboard (anonymous shared memory failure)","reason":"The server failed to create an anonymous shared memory segment for the scoreboard. This usually happens when system resources are limited or shared memory is not properly supported on the system.","resolution":"Check system shared memory limits (shmmax, shmall in \/proc\/sys\/kernel\/). Consider increasing kernel shared memory parameters. You may need to explicitly set a ScoreboardFile to use file-based shared memory instead."},{"function":"ap_reopen_scoreboard","message_template":"Fatal error: shared scoreboard too small for child!","reason":"A detached child process found that the shared scoreboard memory segment is too small to accommodate it. This can happen if server configuration changed without restarting the server completely.","resolution":"Perform a complete restart of Apache instead of a graceful restart, particularly after changing MPM configuration parameters like ThreadsPerChild or MaxRequestWorkers. Ensure consistent configuration across all Apache instances using the same scoreboard."}],"project":"apache\/httpd"}