{"module":"util.c","summary":"This module provides core utility functions for the Apache HTTP Server, including string manipulation, file path handling, configuration file processing, and server hostname determination. It serves as a foundation for many Apache server operations, with robust error handling for configuration files, memory allocation, and directory operations.","logs":[{"function":"ap_get_local_host","message_template":"%s: apr_gethostname() failed to determine ServerName","reason":"The server was unable to determine its hostname using the system call apr_gethostname(). This affects how the server identifies itself.","resolution":"Check that the system hostname is properly configured and accessible to the Apache process."},{"function":"ap_get_local_host","message_template":"%s: apr_sockaddr_info_get() failed for %s","reason":"The server was unable to resolve the IP address for the hostname. This affects network communication and virtual host resolution.","resolution":"Verify that DNS resolution is working correctly on the server. Check \/etc\/hosts file or DNS configuration."},{"function":"ap_get_local_host","message_template":"%s: Could not reliably determine the server's fully qualified domain name, using %s. Set the 'ServerName' directive globally to suppress this message","reason":"Apache was unable to determine the server's fully qualified domain name automatically, so it's using a fallback value.","resolution":"Set the 'ServerName' directive in your global configuration to explicitly specify the server's name and port. This will eliminate this warning message."},{"function":"pcfg_openfile","message_template":"Internal error: pcfg_openfile() called with NULL filename","reason":"An internal function was called with a NULL filename parameter, which is an invalid use of the function.","resolution":"This is an internal error that typically indicates a bug in Apache or a module. Report the issue to the developers with steps to reproduce."},{"function":"pcfg_openfile","message_template":"Opening config file %s (%s)","reason":"Informational message indicating that Apache is opening a configuration file.","resolution":"Information log, no resolution required."},{"function":"pcfg_openfile","message_template":"successful","reason":"Informational message indicating successful opening of a configuration file.","resolution":"Information log, no resolution required."},{"function":"pcfg_openfile","message_template":"Access to file %s denied by server: not a regular file","reason":"The server refused to access a file that is not a regular file (e.g., a directory, device file, or symbolic link).","resolution":"Ensure that the specified file is a regular file and not a directory, socket, or other special file type. Check file permissions and ownership."},{"function":"ap_cfg_getline","message_template":"Error reading %s at line %d: Line too long","reason":"While reading a configuration file, the server encountered a line that exceeds the maximum allowed length.","resolution":"Edit the configuration file to break the long line into multiple shorter lines. The maximum line length is defined by the HUGE_STRING_LEN constant."},{"function":"ap_cfg_getline","message_template":"Error reading %s at line %d: %pm","reason":"An error occurred while reading from a configuration file at the specified line.","resolution":"Check the file for corruption or permission issues. The %pm token will be replaced with a specific error message that provides more details about the exact problem."},{"function":"ap_cfg_getline","message_template":"Read config: '%s'","reason":"Debug message showing the content of a configuration line that was read.","resolution":"Information log, no resolution required."},{"function":"ap_parse_token_list_strict","message_template":"Encountered illegal whitespace in token","reason":"During token parsing, the server found whitespace where it wasn't expected according to the HTTP protocol specifications.","resolution":"Review and correct the format of the input data that's being parsed. This typically indicates malformed HTTP headers or configuration directives."},{"function":"ap_parse_token_list_strict","message_template":"Encountered illegal separator","reason":"During token parsing, the server found an unexpected separator character that doesn't conform to HTTP protocol specifications.","resolution":"Examine the input data for non-standard characters or formatting issues. Ensure it follows the proper HTTP format."},{"function":"ap_abort_on_oom","message_template":"[crit] Memory allocation failed, aborting process.","reason":"The server failed to allocate memory and is aborting to prevent unpredictable behavior. This is a critical error indicating the system is out of memory.","resolution":"Check system memory usage and increase available memory if possible. Look for memory leaks in custom modules. You may need to reduce MaxRequestWorkers directive or increase swap space."},{"function":"ap_dir_fnmatch","message_template":"%sDirectory '%s' exceeds the maximum include directory nesting level of %u. You have probably a recursion somewhere.","reason":"When processing directory includes, Apache detected excessive directory nesting that exceeds the allowed limit, which likely indicates a recursive inclusion.","resolution":"Check your configuration for circular includes or deeply nested directory structures. Look for symlinks that might create loops. The maximum nesting depth is defined by AP_MAX_FNMATCH_DIR_DEPTH."},{"function":"ap_dir_fnmatch","message_template":"%sCould not open directory %s: %pm","reason":"The server failed to open a specified directory, possibly due to permissions or because the directory doesn't exist.","resolution":"Verify that the directory exists and that the Apache process has appropriate permissions to access it. Check ownership and file system permissions."},{"function":"ap_dir_fnmatch","message_template":"%sNo matches for the wildcard '%s' in '%s', failing","reason":"A wildcard pattern specified in the configuration didn't match any files or directories.","resolution":"Check if the wildcard pattern is correct and if the expected files\/directories actually exist. If you want to make inclusion optional, use the appropriate optional inclusion directive instead."},{"function":"debug_cfg_lines","message_template":"Done with config file %s","reason":"Informational debug message indicating that Apache has finished processing a configuration file.","resolution":"Information log, no resolution required."}],"project":"apache\/httpd"}