{"module":"util_ebcdic.c","summary":"This module provides EBCDIC to ASCII and ASCII to EBCDIC character set conversion for the Apache HTTP server. It initializes character encoding converters and provides functions to translate between character sets when processing HTTP headers and protocol data.","logs":[{"function":"ap_init_ebcdic","message_template":"apr_xlate_open() failed","reason":"Fails to create a translator for converting HTTP headers from EBCDIC to ASCII. Likely occurs when the ISO-8859-1 character set is not available on the system.","resolution":"Verify that the system supports the ISO-8859-1 character set. Check that the APR library is properly installed and configured to support character set conversion."},{"function":"ap_init_ebcdic","message_template":"apr_xlate_open() failed","reason":"Fails to create a translator for converting HTTP headers from ASCII to EBCDIC. Likely occurs when the default EBCDIC character set is not properly configured.","resolution":"Verify that the APR_DEFAULT_CHARSET (typically an EBCDIC encoding) is available on the system. Check APR library installation and configuration."},{"function":"ap_init_ebcdic","message_template":"apr_MD5InitEBCDIC() failed","reason":"Fails to initialize the MD5 digest algorithm for use with EBCDIC encoding. May occur due to problems with the character conversion tables.","resolution":"Check that the APR library is properly compiled with EBCDIC support. May require reinstalling or reconfiguring the APR library."},{"function":"ap_init_ebcdic","message_template":"apr_base64init_ebcdic() failed","reason":"Fails to initialize Base64 encoding\/decoding for use with EBCDIC character set. Typically occurs due to issues with converter handles.","resolution":"Verify that the EBCDIC to ASCII and ASCII to EBCDIC converters were properly initialized. Check for earlier errors in the log that might indicate conversion problems."},{"function":"ap_init_ebcdic","message_template":"apr_SHA1InitEBCDIC() failed","reason":"Fails to initialize the SHA1 digest algorithm for use with EBCDIC encoding. May occur due to problems with character conversion tables.","resolution":"Check that the APR library is properly compiled with EBCDIC support. May require reinstalling or reconfiguring the APR library."}],"project":"apache\/httpd"}