{"module":"ap_regex.c","summary":"This module provides POSIX-style regular expression wrappers around the PCRE library for the Apache HTTP Server, handling regex compilation, execution, error reporting, and named capture group functionality.","logs":[{"function":"ap_regerror","message_template":"internal error","reason":"Logs when an internal assertion fails in the regex engine, indicating a bug in the PCRE library or unexpected corruption of regex data structures.","resolution":"This likely indicates a bug in the PCRE library or memory corruption. Update to the latest version of Apache and PCRE, and if the issue persists, file a bug report with detailed reproduction steps."},{"function":"ap_regerror","message_template":"failed to get memory","reason":"Logs when the regex engine cannot allocate required memory for pattern compilation or execution.","resolution":"The server is likely running out of memory. Consider increasing available memory, reducing server load, or optimizing complex regex patterns that require excessive memory."},{"function":"ap_regerror","message_template":"bad argument","reason":"Logs when invalid arguments are passed to the regex functions, such as malformed patterns or incorrect flags.","resolution":"Review and correct the regular expression patterns in your configuration. Check for syntax errors, invalid escape sequences, or mismatched parentheses in regex patterns."},{"function":"ap_regerror","message_template":"match failed","reason":"Logs when a regex pattern does not match the input string. This is often an expected condition rather than an error.","resolution":"This is typically informational and not an error condition. If matches are expected but failing, review the pattern and the input data for correctness."},{"function":"ap_regerror","message_template":"unknown error code","reason":"Logs when an unrecognized error code is returned by the regex engine, potentially from a newer version of PCRE with error codes not yet handled.","resolution":"Update the Apache HTTP Server to the latest version to ensure compatibility with your version of PCRE. If the issue persists, this may indicate a bug in the interaction between Apache and PCRE."},{"function":"ap_regerror","message_template":"%s%s%-6d","reason":"Format string used to report error details with offset information, indicating where in the pattern the error occurred.","resolution":"Use the offset information to identify the exact location in your regex pattern that caused the error, then correct the syntax issue at that position."},{"function":"ap_pcre_version_string","message_template":"Unknown","reason":"Returned when an invalid version request type is specified when querying the PCRE version.","resolution":"This indicates a programming error in code calling the ap_pcre_version_string() function. Check the 'which' parameter value in code making this call."},{"function":"ap_regexec_ex","message_template":"Regex execution failed with PCRE error","reason":"Occurs when PCRE pattern matching fails with a specific error like exceeding match limits or encountering invalid UTF-8 sequences.","resolution":"For match limit errors, simplify complex regex patterns or increase PCRE match limits in your Apache configuration. For UTF-8 errors, ensure input data uses valid UTF-8 encoding."}],"project":"apache\/httpd"}