{"module":"util_script.c","summary":"This module provides functions for handling CGI scripts and environment variables in Apache HTTP Server, including environment variable creation, HTTP header processing, and parameter handling for CGI scripts.","logs":[{"function":"http2env","message_template":"Not exporting header with invalid name as envvar: %s","reason":"The function failed to convert an HTTP header name to an environment variable name because it contained invalid characters.","resolution":"Check the client request headers for unusual or malformed headers; this is typically a client issue and not something that needs server-side resolution."},{"function":"ap_scan_script_header_err_core_ex","message_template":"Premature end of script headers","reason":"The script stopped sending output after some headers were received but before the headers were complete (empty line indicating end of headers).","resolution":"Debug the CGI script to ensure it properly outputs headers followed by an empty line. Check for crashes or early termination in the script."},{"function":"ap_scan_script_header_err_core_ex","message_template":"End of script output before headers","reason":"The script terminated without producing any headers at all, which violates the CGI specification.","resolution":"Ensure the CGI script is correctly outputting headers. Check for script crashes, permission issues, or other errors preventing script execution."},{"function":"ap_scan_script_header_err_core_ex","message_template":"Script timed out before returning headers: %s","reason":"The script took too long to produce its HTTP headers, likely due to script hanging or executing a long-running operation.","resolution":"Increase the script timeout configuration or optimize the script to return headers more quickly. Check for performance issues or infinite loops in the script."},{"function":"ap_scan_script_header_err_core_ex","message_template":"Headers from script '%s':","reason":"Debug log entry that shows the headers being returned from a CGI script (only shown at TRACE4 level).","resolution":"Information log, no resolution required. Useful for debugging CGI script issues."},{"function":"ap_scan_script_header_err_core_ex","message_template":"  %s","reason":"Debug log showing individual header line from CGI script output (only shown at TRACE4 level).","resolution":"Information log, no resolution required. Used to display individual headers during debugging."},{"function":"ap_scan_script_header_err_core_ex","message_template":"CGI Interface Error: Script headers apparently ASCII: (CGI = %s)","reason":"The server detected character encoding issues with the CGI script output, specifically that the script is sending ASCII when EBCDIC was expected (typically on IBM mainframe systems).","resolution":"Ensure the CGI script is properly configured for the character set used by the server. This is typically an issue on EBCDIC platforms like z\/OS."},{"function":"ap_scan_script_header_err_core_ex","message_template":"malformed header from script '%s': Bad header: %.30s","reason":"The script returned a header line that doesn't contain a colon separating the header name from its value.","resolution":"Correct the CGI script to properly format HTTP headers with the 'Header-Name: value' format according to HTTP specifications."},{"function":"ap_scan_script_header_err_core_ex","message_template":"Invalid status line from script '%s': %.30s","reason":"The script returned a Status header with an invalid HTTP status code (not in the valid range).","resolution":"Modify the script to return a valid HTTP status code in the Status header (e.g., 200, 302, 404, 500)."},{"function":"ap_scan_script_header_err_core_ex","message_template":"Status line from script '%s': %.30s","reason":"Debug log showing the Status header returned from a CGI script (only shown at TRACE1 level).","resolution":"Information log, no resolution required. Used for debugging CGI script behavior."},{"function":"ap_scan_script_header_err_core_ex","message_template":"The Last-Modified header value %s (%s) has been replaced with '%s'","reason":"The Last-Modified header from the script was invalid (either not in GMT timezone or with a future date) and was automatically corrected by Apache.","resolution":"Update the CGI script to provide Last-Modified headers with correct GMT timezone and valid dates according to HTTP specifications."},{"function":"ap_scan_script_header_err_core_ex","message_template":"The Last-Modified header value is not set within the GMT timezone (as required)","reason":"The Last-Modified header from the script uses a timezone other than GMT, which violates HTTP specifications.","resolution":"Modify the CGI script to use GMT\/UTC timezone for all Last-Modified headers as required by HTTP specifications."},{"function":"ap_scan_script_header_err_core_ex","message_template":"Ignored invalid header value: Last-Modified: '%s'","reason":"The Last-Modified header value could not be parsed as a valid HTTP date format and was ignored.","resolution":"Update the CGI script to provide Last-Modified headers in a valid HTTP date format (e.g., 'Wed, 21 Oct 2015 07:28:00 GMT')."}],"project":"apache\/httpd"}