{"module":"util_expr_scan.c","summary":"A lexical scanner for parsing Apache expressions, transforming raw text into tokens that can be interpreted by the expression parser. It handles various expression types including strings, variables, and regular expressions, while detecting syntax errors.","logs":[{"function":"YY_FATAL_ERROR","message_template":"expr parser fatal error (BUG?): %s, exiting","reason":"A critical bug has been detected in the expression parser that cannot be recovered from, causing the process to abort. This indicates a fundamental flaw in the expression handling code.","resolution":"This is a serious internal error that likely requires code changes. Check server logs for the specific error message and file a bug report with Apache, including your expression and configuration context."},{"function":"STR_APPEND_CHECK","message_template":"Invalid string character","reason":"A control character was found in a string where it's not allowed. Control characters can disrupt parsing or cause security issues.","resolution":"Review the expression and ensure all special characters in strings are properly escaped or avoid using control characters."},{"function":"STR_APPEND_CHECK","message_template":"String too long","reason":"The string literal in the expression exceeds the internal buffer size limit, making it impossible to process.","resolution":"Shorten the string or split the expression into multiple smaller expressions. Consider using a variable to store long strings."},{"function":"PERROR","message_template":"Bad character escape sequence","reason":"An invalid escape sequence was encountered in a string literal, such as an octal value that's out of range.","resolution":"Check your string escapes and ensure they follow proper syntax. For octal escapes, values must be between \\000 and \\377."},{"function":"PERROR","message_template":"Unterminated string","reason":"A string was started with a quote but the matching closing quote was missing, typically at the end of the expression.","resolution":"Add the missing closing quote to balance the string. Check for proper string delimiter pairing."},{"function":"PERROR","message_template":"Unterminated expression","reason":"An expression was started (often with an opening bracket or parenthesis) but the matching closing character was missing.","resolution":"Add the appropriate closing bracket or parenthesis to complete the expression structure."},{"function":"PERROR","message_template":"Unterminated string or variable","reason":"A string or variable reference was started but not properly closed before the end of line or input.","resolution":"Ensure all strings have closing quotes and all variable references have proper closing syntax (e.g., closing brace if needed)."},{"function":"PERROR_CHAR","message_template":"Unexpected variable character","reason":"An invalid character was encountered while parsing a variable name.","resolution":"Use only valid characters in variable names. Typically only alphanumeric characters and underscores are allowed."},{"function":"PERROR","message_template":"Unterminated variable","reason":"A variable reference was started but not properly closed, often missing a closing brace or bracket.","resolution":"Add the missing closing syntax for the variable reference (typically a closing brace or parenthesis)."},{"function":"PERROR","message_template":"Invalid regexp flag(s)","reason":"Invalid flags were specified for a regular expression. Only certain flags (i, s, m, g) are supported.","resolution":"Use only supported regexp flags. Valid flags are 'i' (case-insensitive), 's' (dot matches newline), 'm' (multiline), and 'g' (global)."},{"function":"PERROR","message_template":"Unterminated regexp","reason":"A regular expression pattern was started but the closing delimiter was missing.","resolution":"Add the missing delimiter at the end of the regular expression pattern."},{"function":"PERROR_CHAR","message_template":"Parse error near character","reason":"The parser encountered an unexpected character that doesn't fit the grammar at the current position.","resolution":"Check the syntax around the mentioned character. Verify the expression follows the expected format for Apache expressions."},{"function":"YY_FATAL_ERROR","message_template":"flex scanner jammed","reason":"The expression scanner has reached an inconsistent internal state and cannot continue processing.","resolution":"This is a rare internal error. Simplify your expression or try alternative syntax. Report the issue to Apache if consistently reproducible."},{"function":"YY_FATAL_ERROR","message_template":"fatal flex scanner internal error--no action found","reason":"The scanner encountered a situation where it couldn't determine what action to take, indicating an internal logic error.","resolution":"This is a severe internal error. Report it to Apache along with your expression that triggered it. Try simplifying or rewriting the expression."},{"function":"YY_FATAL_ERROR","message_template":"fatal flex scanner internal error--end of buffer missed","reason":"The scanner's internal buffer handling logic has a bug that led to incorrect pointer manipulation.","resolution":"This is a low-level scanner error that requires Apache code changes. Report it with a reproducible example to Apache maintainers."},{"function":"YY_FATAL_ERROR","message_template":"fatal error - scanner input buffer overflow","reason":"The expression scanner's input buffer size couldn't be expanded to accommodate the needed data.","resolution":"This likely means your expression is extremely large or complex. Break it into smaller parts or consider a different approach that doesn't rely on such complex expressions."},{"function":"YY_FATAL_ERROR","message_template":"out of dynamic memory in yy_get_next_buffer()","reason":"The system is out of memory while the scanner was trying to allocate a buffer for reading input.","resolution":"The server is low on memory. Free up system resources, add more RAM, or simplify your Apache configuration to reduce memory usage."},{"function":"YY_FATAL_ERROR","message_template":"out of dynamic memory in ap_expr_yy_create_buffer()","reason":"The system is out of memory while trying to create a new scanner buffer.","resolution":"Increase available memory on the system or reduce memory usage in other parts of Apache to free up resources."},{"function":"YY_FATAL_ERROR","message_template":"out of dynamic memory in ap_expr_yyensure_buffer_stack()","reason":"The system couldn't allocate memory for the scanner's buffer stack.","resolution":"Add more system memory or reduce Apache's overall memory footprint by simplifying configurations or reducing concurrent connections."},{"function":"YY_FATAL_ERROR","message_template":"out of dynamic memory in ap_expr_yy_scan_buffer()","reason":"Out of memory while trying to scan input from a buffer.","resolution":"Free up system memory resources or increase available RAM. Reduce complexity of Apache configuration."},{"function":"YY_FATAL_ERROR","message_template":"out of dynamic memory in ap_expr_yy_scan_bytes()","reason":"Insufficient memory for scanning bytes from the input stream.","resolution":"Address system memory constraints. Check for memory leaks or add more RAM to the server."},{"function":"YY_FATAL_ERROR","message_template":"out of memory expanding start-condition stack","reason":"The scanner ran out of memory while trying to expand the stack that tracks parsing states.","resolution":"This could indicate overly complex nested expressions. Simplify your expressions or add more system memory."},{"function":"YY_FATAL_ERROR","message_template":"start-condition stack underflow","reason":"An internal stack underflow occurred in the scanner, indicating a bug in the stack management code.","resolution":"This is an internal error that requires Apache code fixes. Report it to Apache maintainers with a reproducible test case."},{"function":"YY_FATAL_ERROR","message_template":"input in flex scanner failed","reason":"The scanner encountered an error while reading from its input source.","resolution":"Check file permissions and availability if reading from a file. Ensure the input source hasn't been closed prematurely."},{"function":"YY_FATAL_ERROR","message_template":"ap_expr_yyset_lineno called with no buffer","reason":"An attempt was made to set the line number when no input buffer exists.","resolution":"This is an internal sequencing error in the code. Report it to Apache maintainers."}],"project":"apache\/httpd"}