{"module":"util_cookies.c","summary":"This module handles cookie manipulation for Apache HTTP Server, providing functions to read, write, and remove RFC2109 and RFC2965 compliant cookies in HTTP requests and responses. It includes functionality for cookie validation, handling duplicates, and manipulation of cookie attributes.","logs":[{"function":"ap_cookie_write","message_template":"ap_cookie: user '%s' set cookie: '%s'","reason":"Logs a debug message when a cookie is set, showing which user set the cookie and what the cookie contents are. This helps with debugging cookie-related issues.","resolution":"This is an informational debug log, no resolution required. If you're seeing unexpected cookies being set, check the application logic that calls this function."},{"function":"ap_cookie_write2","message_template":"ap_cookie: user '%s' set cookie2: '%s'","reason":"Logs a debug message when an RFC2965 cookie (cookie2) is set, showing which user set the cookie and what the cookie contents are. Useful for tracking cookie2 operations.","resolution":"This is an informational debug log, no resolution required. Note that Cookie2 is obsolete in modern browsers, so consider using standard cookies instead."},{"function":"ap_cookie_remove","message_template":"ap_cookie: user '%s' removed cookie: '%s'","reason":"Logs a debug message when a cookie is removed, showing which user removed the cookie and the removal command sent to the browser.","resolution":"This is an informational debug log, no resolution required. If cookies are being unexpectedly removed, check the application logic that calls this function."},{"function":"ap_cookie_remove2","message_template":"ap_cookie: user '%s' removed cookie2: '%s'","reason":"Logs a debug message when an RFC2965 cookie (cookie2) is removed, showing which user removed the cookie and the removal command sent to the browser.","resolution":"This is an informational debug log, no resolution required. Note that Cookie2 is obsolete in modern browsers, so consider using standard cookies instead."},{"function":"ap_cookie_read","message_template":"ap_cookie: client submitted cookie '%s' more than once: %s","reason":"Logs an error when a client submits the same cookie multiple times with different values, which could indicate a potential security issue or client misconfiguration.","resolution":"Investigate why the client is sending duplicate cookies with different values. This could be due to a client-side bug, a security probe, or an application issue. The function will return APR_EGENERAL when this occurs, and the application should handle this error appropriately."}],"project":"apache\/httpd"}