{"module":"util_expr_parse.c","summary":"This module implements a parser for Apache's expression evaluation system, handling boolean expressions, string operations, regular expressions, and various operators used in Apache configuration directives. It converts the expressions into a format that can be evaluated at runtime.","logs":[{"function":"yybackup","message_template":"syntax error: cannot back up","reason":"Indicates a parser internal error when trying to recover from a syntax error by backing up. This occurs when the parser reaches an invalid state during expression parsing.","resolution":"Review and correct the syntax of your expression. This is typically caused by complex or incorrectly formatted expressions in configuration files."},{"function":"yyparse","message_template":"memory exhausted","reason":"The parser has run out of available memory when trying to parse a complex expression.","resolution":"Check for extremely large or complex expressions in configuration files. Consider increasing memory limits for the server or simplifying expressions."},{"function":"ap_expr_regex_make","message_template":"Failed to compile regular expression","reason":"A regular expression pattern provided in an expression could not be compiled due to syntax errors in the regex pattern.","resolution":"Check the regular expression pattern in your configuration for syntax errors. Common issues include unmatched parentheses, invalid character classes, or unsupported regex features."},{"function":"yyparse","message_template":"syntax error","reason":"The parser encountered a generic syntax error when parsing an expression.","resolution":"Review the expression syntax in your configuration file. Check for missing operators, unmatched parentheses, or invalid characters."},{"function":"yyparse","message_template":"syntax error, unexpected %s","reason":"The parser encountered an unexpected token while parsing an expression.","resolution":"Review the expression syntax, focusing on the unexpected element mentioned in the error. Typical issues include misplaced operators or incorrect variable references."},{"function":"yyparse","message_template":"syntax error, unexpected %s, expecting %s","reason":"The parser expected a specific token but found a different one, indicating a syntax error in the expression.","resolution":"Modify your expression to provide the expected token type. This often occurs with mismatched parentheses or missing operators."},{"function":"yyparse","message_template":"syntax error, unexpected %s, expecting %s or %s","reason":"The parser expected one of two possible tokens but found something different.","resolution":"Correct the expression to use one of the expected token types indicated in the error message."},{"function":"yyparse","message_template":"syntax error, unexpected %s, expecting %s or %s or %s","reason":"The parser expected one of three possible tokens but found something different.","resolution":"Correct the expression to use one of the expected token types indicated in the error message."},{"function":"yyparse","message_template":"syntax error, unexpected %s, expecting %s or %s or %s or %s","reason":"The parser expected one of four possible tokens but found something different.","resolution":"Correct the expression to use one of the expected token types indicated in the error message."},{"function":"yyparse","message_template":"Error: discarding","reason":"The parser is discarding a token during error recovery.","resolution":"This is an internal parser message during error handling. Fix the underlying syntax error in your expression."},{"function":"yyparse","message_template":"Error: popping","reason":"The parser is recovering from an error by popping states from its stack.","resolution":"This is an internal parser message during error handling. Fix the underlying syntax error in your expression."},{"function":"yyparse","message_template":"Cleanup: discarding lookahead","reason":"The parser is discarding lookahead tokens during cleanup after an error.","resolution":"This is an internal parser cleanup message. Fix the underlying syntax error in your expression."},{"function":"yyparse","message_template":"Cleanup: popping","reason":"The parser is cleaning up by popping states after completing parsing or encountering an error.","resolution":"This is an internal parser cleanup message that doesn't require specific action unless accompanied by error messages."}],"project":"apache\/httpd"}