{"module":"vhost.c","summary":"Handles virtual host configuration and request processing in Apache HTTP Server. It manages IP-based and name-based virtual hosts, configures host address mapping, and handles Host header processing during requests.","logs":[{"function":"get_addresses","message_template":"Could not resolve host name %s -- ignoring!","reason":"Logs when DNS resolution fails for a hostname specified in a VirtualHost directive. This indicates a configuration issue with an unreachable or non-existent hostname.","resolution":"Verify that the hostname is correct and can be resolved through DNS. Check your DNS server configuration and network connectivity."},{"function":"get_addresses","message_template":"Could not set scope ID %s for %pI -- ignoring!","reason":"Logs when the server fails to set a scope ID for an IPv6 address. This typically happens with IPv6 link-local addresses requiring scope IDs.","resolution":"Check that the IPv6 address format is correct. For link-local addresses, ensure the scope ID is valid for your system."},{"function":"ap_set_name_virtual_host","message_template":"NameVirtualHost has no effect and will be removed in the next release %s:%d","reason":"Warns that the NameVirtualHost directive is deprecated and will be removed in a future version of Apache.","resolution":"Remove all NameVirtualHost directives from your configuration as they are no longer needed. Modern Apache versions automatically determine if a virtual host is name-based."},{"function":"strict_hostname_check","message_template":"[strict] Invalid host name '%s'%s%.6s","reason":"This debug message appears when a hostname doesn't conform to RFC standards in strict mode. It may indicate a client is sending unusual Host headers.","resolution":"If legitimate requests are being blocked, consider switching from strict to relaxed HTTP conformance or fix the client sending the invalid hostnames."},{"function":"strict_hostname_check","message_template":"[strict] purely numeric host names not allowed: %s","reason":"Logs when a hostname is composed of only numeric digits, which is not allowed in strict mode. This could be a client trying to use an IP address as a hostname.","resolution":"Configure clients to use proper hostnames rather than numeric IPs. Alternatively, switch from strict to relaxed HTTP conformance mode if these requests are legitimate."},{"function":"fix_hostname","message_template":"Client sent malformed Host header: %s","reason":"Logs when a client sends a Host header that cannot be parsed correctly. This often indicates a malicious request or a buggy client.","resolution":"If coming from legitimate clients, check their configuration. Otherwise, this may indicate scanning or attack attempts that should be monitored."},{"function":"ap_update_vhost_from_headers_ex","message_template":"Replacing host header '%s' with host '%s' given in the request uri","reason":"Logs when the server is replacing a Host header with a hostname from the request URI. This happens when clients send both a Host header and an absolute URI.","resolution":"This is informational and usually indicates clients using absolute URIs in requests. No action typically needed unless the client behavior is unexpected."}],"project":"apache\/httpd"}