{"project":"sendmail","module":"smdb1.c","summary":"This module provides the interface between Sendmail's database abstraction layer (SMDB) and Berkeley DB version 1. It implements database operations such as open, close, get, put, delete, and cursor manipulation specifically for DB1.","logs":[{"function":"smdb_db_open","message_template":"SMDBE_UNKNOWN_DB_TYPE error","reason":"The database type provided is not supported (not HASH or BTREE). This may occur when an invalid or unsupported database type is specified in configuration.","resolution":"Verify the database type in the configuration is correctly set to a supported type (HASH or BTREE)."},{"function":"smdb_db_open","message_template":"SMDBE_MALLOC error","reason":"Memory allocation failed when creating database structures. This typically happens when the system is low on memory.","resolution":"Check system memory resources, possibly increase swap space, or restart the service to free memory."},{"function":"smdb_db_open","message_template":"SMDBE_BAD_OPEN error","reason":"Failed to open the database file, but with no specific errno set. This may be due to a corrupted database or permission issues.","resolution":"Check file permissions, verify the database file isn't corrupted, and ensure the path is valid and accessible."},{"function":"smdb1_cursor","message_template":"SMDBE_ONLY_SUPPORTS_ONE_CURSOR error","reason":"An attempt was made to create a second cursor when one is already active. DB1 only supports one cursor at a time.","resolution":"Modify the application code to ensure only one cursor is used at a time, or close the existing cursor before opening a new one."},{"function":"smdb1_cursor_close","message_template":"SMDBE_NOT_A_VALID_CURSOR error","reason":"Attempted to close a cursor that isn't actually in use. This might indicate a logic error in cursor management.","resolution":"Review code that manages database cursors to ensure proper cursor lifecycle management."},{"function":"smdb1_cursor_get","message_template":"SMDBE_LAST_ENTRY error","reason":"Cursor operation returned that this is the last entry in the database. This is often not an error but an indication that iteration has completed.","resolution":"This is an informational message. No action is required unless it appears unexpectedly during iteration."}]}