{"module":"h2_bucket_beam.c","summary":"This module implements a data transfer mechanism between HTTP\/2 sender and receiver threads using bucket brigades. It manages buffering, flow control, and synchronization between threads handling the same HTTP\/2 stream.","logs":[{"function":"h2_beam_destroy","message_template":"destroy","reason":"Logs when beam destruction begins, indicating resources will be released.","resolution":"Informational log, no resolution required. If seen unexpectedly, may indicate premature connection termination."},{"function":"h2_beam_destroy","message_template":"destroyed","reason":"Logs when beam destruction completes, confirming all resources have been released.","resolution":"Informational log, no resolution required."},{"function":"h2_beam_create","message_template":"created","reason":"Logs when a new beam is successfully created, showing initialization of the data transfer mechanism.","resolution":"Informational log, no resolution required."},{"function":"wait_not_empty","message_template":"wait_not_empty, timeout","reason":"Logs when a thread is waiting for data to become available with a timeout specified.","resolution":"If seen frequently, may indicate slow data producers or network issues. Consider increasing timeout values or investigating upstream data sources."},{"function":"wait_not_empty","message_template":"wait_not_empty, forever","reason":"Logs when a thread is waiting indefinitely for data to become available.","resolution":"If processes seem to hang, check if producers are properly sending data or if connections are being maintained."},{"function":"wait_not_full","message_template":"wait_not_full, timeout","reason":"Logs when a thread is waiting for buffer space to become available with a timeout specified.","resolution":"If seen frequently, may indicate slow data consumers or network congestion. Consider increasing buffer sizes or investigating downstream consumers."},{"function":"wait_not_full","message_template":"wait_not_full, forever","reason":"Logs when a thread is waiting indefinitely for buffer space to become available.","resolution":"If processes seem to hang, check if consumers are properly reading data or if connections are being maintained."},{"function":"h2_beam_send","message_template":"start send","reason":"Logs when a send operation begins, indicating data transfer is starting.","resolution":"Informational log, no resolution required."},{"function":"h2_beam_send","message_template":"end send","reason":"Logs when a send operation completes, showing result status and any remaining data.","resolution":"If shown with error status, investigate the specific error code. Common issues include broken connections or buffer limitations."},{"function":"h2_beam_receive","message_template":"start receive","reason":"Logs when a receive operation begins, indicating data is being requested.","resolution":"Informational log, no resolution required."},{"function":"h2_beam_receive","message_template":"end receive","reason":"Logs when a receive operation completes, showing result status and received data.","resolution":"If shown with error status, investigate the specific error code. Common issues include broken connections or empty buffers."}],"project":"apache\/httpd"}