{"module":"h2_c1.c","summary":"This module manages HTTP\/2 protocol connection handling in Apache HTTP Server. It provides functionality for direct HTTP\/2 connections, protocol detection, and manages the lifecycle of HTTP\/2 sessions including initialization, processing, and graceful shutdown.","logs":[{"function":"h2_c1_setup","message_template":"workers not initialized","reason":"The HTTP\/2 workers subsystem was not properly initialized before attempting to set up an HTTP\/2 connection. This indicates a startup or initialization problem with the HTTP\/2 module.","resolution":"Restart the Apache server or check that the HTTP\/2 module is properly loaded and initialized. This may indicate a configuration issue or resource problem during server startup."},{"function":"h2_c1_run","message_template":"process, closing conn","reason":"An error occurred during HTTP\/2 session processing that requires the connection to be closed. The status code provides details about the specific error.","resolution":"Check the status code for specific error information. This could be due to protocol violations, timeouts, or resource issues. Review concurrent connection settings and client behavior if this occurs frequently."},{"function":"h2_c1_hook_process_connection","message_template":"h2_h2, error reading 24 bytes speculative","reason":"Failed to read the initial 24 bytes needed to detect the HTTP\/2 protocol signature. This prevents the server from determining if the connection should use HTTP\/2.","resolution":"This could indicate network issues, client disconnections, or malformed requests. Check network stability and client behavior. If occurring frequently, investigate possible network problems or client misconfiguration."},{"function":"h2_c1_hook_process_connection","message_template":"h2_h2, process_conn","reason":"Debug log entry indicating HTTP\/2 connection processing has begun. This is informational and helps trace connection flow.","resolution":"Information log, no resolution required. Used for debugging connection flow."},{"function":"h2_c1_hook_process_connection","message_template":"h2_h2, process_conn, new connection using protocol '%s', direct=%d, tls acceptable=%d","reason":"Trace log providing details about a new connection including the protocol being used, whether direct mode is enabled, and TLS acceptability.","resolution":"Information log, no resolution required. Used for detailed connection debugging."},{"function":"h2_c1_hook_process_connection","message_template":"h2_h2, direct mode detected","reason":"HTTP\/2 direct mode was detected from the connection's initial bytes, indicating the client is speaking HTTP\/2 directly from the start.","resolution":"Information log, no resolution required. Confirms proper HTTP\/2 protocol detection."},{"function":"h2_c1_hook_process_connection","message_template":"h2_h2, not detected in %d bytes(base64): %s","reason":"The HTTP\/2 protocol signature was not found in the initial bytes of the connection. The connection will likely fall back to HTTP\/1.x.","resolution":"Information log, no resolution required. Normal behavior for non-HTTP\/2 connections or HTTP\/1.1 connections that may upgrade later."},{"function":"h2_c1_hook_process_connection","message_template":"process_conn","reason":"Debug log indicating connection processing is active. Used for tracing the flow of connection handling.","resolution":"Information log, no resolution required. Used for debugging connection flow."},{"function":"h2_c1_hook_process_connection","message_template":"conn_setup","reason":"Debug log with status code from connection setup attempt. Helps trace if the setup was successful or failed.","resolution":"If status indicates an error, check configuration for HTTP\/2, TLS settings if using HTTPS, and system resources. Otherwise, this is an information log for debugging."},{"function":"h2_c1_hook_process_connection","message_template":"h2_h2, declined","reason":"The HTTP\/2 module declined to handle this connection, likely because it's not an HTTP\/2 connection or doesn't meet the criteria for HTTP\/2 processing.","resolution":"Information log, no resolution required. Normal behavior for connections that should be handled by other protocol handlers."}],"project":"apache\/httpd"}