{"module":"h2_c1_io.c","summary":"This module handles I\/O operations between HTTP\/1.1 and HTTP\/2 protocols in Apache Server. It manages buffering, session handling, and data transmission between the protocol layers with specific optimizations for TLS connections.","logs":[{"function":"h2_c1_io_bb_log","message_template":"h2_session(%ld)-%s: %s","reason":"Logs the contents of a bucket brigade (data structure for HTTP data) with detailed information about what types of data are being processed.","resolution":"This is an informational log for debugging. No resolution required unless it reveals unexpected data structures."},{"function":"h2_c1_io_init","message_template":"h2_c1_io(%ld): init, buffering=%d, warmup_size=%ld, cd_secs=%f","reason":"Logs initialization parameters for the connection I\/O handler, including buffering settings, warmup size, and cooldown seconds.","resolution":"Informational log for debugging connection initialization. If connection performance issues occur, these settings might need adjustment in server configuration."},{"function":"pass_output","message_template":"h2_c1_io(%ld): recursive call of h2_c1_io_pass. Denied to prevent output corruption. This points to a bug in the HTTP\/2 implementation.","reason":"Logs a critical error when the output passing function is called recursively, which could lead to data corruption.","resolution":"This indicates a bug in the HTTP\/2 implementation code. A developer should investigate the call stack to understand what's causing recursive calls to pass_output and fix the implementation."},{"function":"pass_output","message_template":"h2_c1_io(%ld): pass_out brigade %ld bytes","reason":"Logs when passing output data failed with the size of the data being passed.","resolution":"Investigate what's causing the output passing failure. Could be connection issues, memory problems, or configuration issues with the output filters."},{"function":"h2_c1_io_add_data","message_template":"h2_c1_io(%ld): adding %ld data bytes","reason":"Logs the addition of data bytes to the output buffer with the connection ID and byte count.","resolution":"Informational log for tracking data flow. No resolution required unless abnormal patterns are observed."},{"function":"read_to_scratch","message_template":"h2_c1_io(%ld): seeing mmap bucket of size %ld, scratch remain=%ld","reason":"Logs when encountering memory-mapped file buckets, showing their size and remaining scratch buffer space.","resolution":"Informational log about memory handling. If large mmap buckets cause issues, server configuration might need adjustment for buffer sizes."},{"function":"c1_in_feed_brigade","message_template":"fed %ld bytes to nghttp2, %ld read","reason":"Logs details about bytes being fed to the nghttp2 library and how many were successfully processed.","resolution":"Informational log for HTTP\/2 protocol processing. If the read bytes consistently differ from fed bytes, it may indicate protocol parsing issues."},{"function":"h2_c1_read","message_template":"session_read start","reason":"Logs the beginning of a session read operation for HTTP\/2 data processing.","resolution":"Informational trace log. No resolution required."},{"function":"h2_c1_read","message_template":"session_read done","reason":"Logs the completion of a session read operation for HTTP\/2 data processing.","resolution":"Informational trace log. No resolution required."},{"function":"h2_c1_read","message_template":"input gone","reason":"Logs when the client connection has been terminated, usually due to the client disconnecting or timeout.","resolution":"This is an expected log when clients disconnect. No resolution needed unless appearing unexpectedly for active clients, which might indicate network issues."},{"function":"h2_c1_read","message_template":"error reading, terminating","reason":"Logs unexpected errors when reading from the connection, resulting in connection termination.","resolution":"Investigate the specific error code reported. Could indicate network issues, configuration problems, or client misbehavior requiring firewall or timeout adjustments."}],"project":"apache\/httpd"}