{"module":"h2_headers.c","summary":"This module manages HTTP\/2 headers in Apache HTTP Server, handling creation, transformation, and packaging of headers into response buckets. It includes special handling for SSL renegotiation errors and HTTP\/2 protocol requirements.","logs":[{"function":"h2_headers_rcreate","message_template":"h2_headers_rcreate(%ld): status=%d","reason":"Logs header creation details, including connection ID and HTTP status code. This is a trace-level log used for debugging header creation.","resolution":"This is an informational log for debugging purposes. No resolution required unless unexpected status codes appear frequently."},{"function":"h2_headers_rcreate","message_template":"h2_headers(%ld): renegotiate forbidden, cause: %s","reason":"Logs when a TLS renegotiation is forbidden in HTTP\/2, which causes a special error code to be returned (H2_ERR_HTTP_1_1_REQUIRED). This indicates the client should downgrade to HTTP\/1.1.","resolution":"Client should retry the request using HTTP\/1.1. This typically happens when client certificates are required mid-connection, which HTTP\/2 doesn't support. Consider configuring the server to request client certificates during initial handshake instead of during the session."},{"function":"h2_headers_rcreate","message_template":"ssl-renegotiate-forbidden","reason":"Note added to request when SSL renegotiation is forbidden in HTTP\/2 context, triggering HTTP_1_1_REQUIRED error.","resolution":"Configure SSL to request client certificates during initial handshake rather than renegotiating during the connection. HTTP\/2 does not support TLS renegotiation."},{"function":"h2_headers_die","message_template":"Date","reason":"Header added to error responses indicating the server date\/time.","resolution":"Informational header, no resolution required."},{"function":"h2_headers_die","message_template":"Server","reason":"Header added to error responses indicating the server software name\/version.","resolution":"Informational header, no resolution required."},{"function":"h2_headers_rcreate","message_template":"0","reason":"Value added as a note when push mode is disabled for a request while enabled for the server.","resolution":"Informational note, indicates HTTP\/2 Server Push is disabled for this request. No resolution required unless Server Push is expected to work."}],"project":"apache\/httpd"}