{"module":"h2_protocol.c","summary":"This module implements protocol validation and security requirements for HTTP\/2 connections according to RFC 7540. It checks TLS connections for proper protocol versions and non-blacklisted cipher suites required for HTTP\/2 compatibility.","logs":[{"function":"h2_protocol_init","message_template":"h2_h2, child_init","reason":"Logs initialization of the HTTP\/2 protocol module in a child process","resolution":"Information log, no resolution required"},{"function":"h2_protocol_is_acceptable_c1","message_template":"h2_h2(%ld): tls protocol not suitable: %s","reason":"Logs when a TLS connection's protocol version doesn't meet HTTP\/2 requirements (TLSv1.2 or higher is required)","resolution":"Update TLS configuration to use at least TLSv1.2. Remove or disable any settings that allow TLSv1 or TLSv1.1"},{"function":"h2_protocol_is_acceptable_c1","message_template":"h2_h2(%ld): tls protocol is indetermined","reason":"Logs when unable to determine TLS protocol version of a connection, which prevents HTTP\/2 compatibility verification","resolution":"Check SSL\/TLS configuration and ensure mod_ssl or equivalent SSL module is properly loaded and configured. There may be an issue with the SSL\/TLS handshake"},{"function":"h2_protocol_is_acceptable_c1","message_template":"h2_h2(%ld): tls cipher %s blacklisted by %s","reason":"Logs when a TLS connection is using a cipher suite blacklisted by RFC 7540, making it incompatible with HTTP\/2","resolution":"Update server's SSL\/TLS configuration to use secure, non-blacklisted cipher suites. Disable weak ciphers and ensure the cipher order prioritizes strong, HTTP\/2-compatible ciphers"},{"function":"h2_protocol_is_acceptable_c1","message_template":"h2_h2(%ld): tls cipher is indetermined","reason":"Logs when unable to determine which cipher suite is being used for a TLS connection","resolution":"Check SSL\/TLS configuration and ensure mod_ssl or equivalent SSL module is properly loaded and configured. There may be an issue with the SSL\/TLS handshake or cipher negotiation"},{"function":"h2_protocol_err_description","message_template":"no error","reason":"HTTP\/2 error code 0x0 description, indicating no error condition","resolution":"Information message, no resolution required"},{"function":"h2_protocol_err_description","message_template":"protocol error","reason":"HTTP\/2 error code 0x1 description, indicating a protocol error occurred during HTTP\/2 communication","resolution":"Investigate client and server HTTP\/2 implementations. May indicate a non-compliant client or server implementation that violates the HTTP\/2 protocol specifications"},{"function":"h2_protocol_err_description","message_template":"internal error","reason":"HTTP\/2 error code 0x2 description, indicating an internal error in the HTTP\/2 implementation","resolution":"Check server logs for more detailed error information. May require updating the HTTP\/2 implementation or investigating server resource issues"},{"function":"h2_protocol_err_description","message_template":"flow control error","reason":"HTTP\/2 error code 0x3 description, indicating an error in the HTTP\/2 flow control mechanism","resolution":"May indicate issues with window size updates or exceeding flow control limits. Check for misbehaving clients or server configuration issues"},{"function":"h2_protocol_err_description","message_template":"settings timeout","reason":"HTTP\/2 error code 0x4 description, indicating settings weren't acknowledged within the required timeframe","resolution":"Check for network latency issues or misbehaving clients that don't acknowledge settings frames properly"},{"function":"h2_protocol_err_description","message_template":"stream closed","reason":"HTTP\/2 error code 0x5 description, indicating a frame was received for a closed stream","resolution":"Usually a client implementation issue. May occur during high concurrency. May not require action unless frequently occurring"},{"function":"h2_protocol_err_description","message_template":"frame size error","reason":"HTTP\/2 error code 0x6 description, indicating a frame exceeding the maximum size was received","resolution":"Check for misbehaving clients sending oversized frames. May require adjusting maximum frame size settings if legitimate large frames are needed"},{"function":"h2_protocol_err_description","message_template":"refused stream","reason":"HTTP\/2 error code 0x7 description, indicating a stream was refused before processing any application logic","resolution":"May occur due to server resource constraints. Consider increasing server capacity or adjusting HTTP\/2 concurrency settings if occurring frequently"},{"function":"h2_protocol_err_description","message_template":"cancel","reason":"HTTP\/2 error code 0x8 description, indicating the stream or connection was canceled","resolution":"Usually initiated by clients and expected behavior. No action needed unless occurring unexpectedly at high rates"},{"function":"h2_protocol_err_description","message_template":"compression error","reason":"HTTP\/2 error code 0x9 description, indicating an error in the HPACK header compression","resolution":"Check for client implementation issues or potential HPACK attacks. May require updating HTTP\/2 implementation if a vulnerability is involved"},{"function":"h2_protocol_err_description","message_template":"connect error","reason":"HTTP\/2 error code 0xA description, indicating an error with the HTTP CONNECT method","resolution":"Check proxy configuration if using CONNECT method. May indicate issues with proxy setup or client implementation"},{"function":"h2_protocol_err_description","message_template":"enhance your calm","reason":"HTTP\/2 error code 0xB description, indicating a client is generating excessive load","resolution":"Investigate clients that may be misbehaving with excessive requests. Consider implementing rate limiting or client blocking if abuse is detected"},{"function":"h2_protocol_err_description","message_template":"inadequate security","reason":"HTTP\/2 error code 0xC description, indicating the security level doesn't meet the server requirements","resolution":"Update TLS configuration to use stronger protocols and ciphers. May require client to update their TLS implementation"},{"function":"h2_protocol_err_description","message_template":"http\/1.1 required","reason":"HTTP\/2 error code 0xD description, indicating the server requires HTTP\/1.1 for this request","resolution":"Check server configuration for specific resources that may be restricted to HTTP\/1.1. May require client to downgrade to HTTP\/1.1 for these requests"},{"function":"h2_protocol_err_description","message_template":"unknown http\/2 error code","reason":"Default error description for unrecognized HTTP\/2 error codes","resolution":"Check HTTP\/2 specifications for newer error codes. May indicate a mismatch between client and server HTTP\/2 implementations or versions"}],"project":"apache\/httpd"}