{"module":"h2_proxy_util.c","summary":"This module provides utility functions for Apache HTTP\/2 proxy implementation, including HTTP\/2 frame handling, header manipulation, link header processing, and data structures such as FIFO queues and hash tables to support proxy operations.","logs":[{"function":"map_link","message_template":"link_reverse_map uri too long, skipped: %s","reason":"Logs a warning when a link URI in a Link header is too long to be processed for reverse mapping in a proxy context. This occurs when the combined length of the URI and server prefix exceeds buffer limits.","resolution":"Increase the internal buffer size or modify the application to use shorter URI paths in Link headers. Consider adjusting your proxy configuration to handle longer URIs."},{"function":"map_link","message_template":"reverse_map[%s] %s --> %s","reason":"Logs at TRACE2 level the details of reverse mapping a link URI in a proxy environment, showing the proxy server URI, original URI, and mapped URI. This is informational for debugging proxy mappings.","resolution":"This is an informational log, no resolution required. If mappings appear incorrect, check your reverse proxy configuration for proper URL rewriting rules."},{"function":"h2_proxy_link_reverse_map","message_template":"link_reverse_map %s --> %s","reason":"Logs at TRACE2 level the final result of reverse mapping an entire Link header value. Shows the original and transformed Link header value after all URIs have been processed.","resolution":"This is an informational log, no resolution required. If the mapping appears incorrect, review the proxy's URL rewriting configuration."},{"function":"h2_proxy_util_frame_print","message_template":"DATA[length=%d, flags=%d, stream=%d, padlen=%d]","reason":"Provides debugging information about HTTP\/2 DATA frames being processed. These frames contain the actual HTTP message payload data.","resolution":"This is an informational log used for debugging HTTP\/2 protocol operations. No resolution needed unless it indicates unexpected frame sizes or flags."},{"function":"h2_proxy_util_frame_print","message_template":"HEADERS[length=%d, hend=%d, stream=%d, eos=%d]","reason":"Provides debugging information about HTTP\/2 HEADERS frames being processed. These frames contain HTTP header fields for a request or response.","resolution":"This is an informational log for debugging HTTP\/2 protocol operations. No resolution needed unless header frames appear malformed or have unexpected flags."},{"function":"h2_proxy_util_frame_print","message_template":"PRIORITY[length=%d, flags=%d, stream=%d]","reason":"Provides debugging information about HTTP\/2 PRIORITY frames being processed. These frames indicate stream dependencies and weights for prioritization.","resolution":"This is an informational log for HTTP\/2 protocol debugging. No resolution needed unless priority settings are causing performance issues."},{"function":"h2_proxy_util_frame_print","message_template":"RST_STREAM[length=%d, flags=%d, stream=%d]","reason":"Provides debugging information about HTTP\/2 RST_STREAM frames being processed. These frames abruptly terminate a stream and may indicate errors.","resolution":"If seen frequently, investigate the error code that typically accompanies this frame to determine why streams are being terminated. May indicate client-side issues or server processing problems."},{"function":"h2_proxy_util_frame_print","message_template":"SETTINGS[ack=1, stream=%d]","reason":"Provides debugging information about HTTP\/2 SETTINGS acknowledgment frames being processed. These frames acknowledge receipt of a previous SETTINGS frame.","resolution":"This is an informational log for HTTP\/2 protocol debugging. No resolution needed unless settings acknowledgments are missing or delayed."},{"function":"h2_proxy_util_frame_print","message_template":"SETTINGS[length=%d, stream=%d]","reason":"Provides debugging information about HTTP\/2 SETTINGS frames being processed. These frames convey configuration parameters affecting how endpoints communicate.","resolution":"This is an informational log for HTTP\/2 protocol debugging. If issues persist with HTTP\/2 connections, check if settings values are appropriate for your environment."},{"function":"h2_proxy_util_frame_print","message_template":"PUSH_PROMISE[length=%d, hend=%d, stream=%d]","reason":"Provides debugging information about HTTP\/2 PUSH_PROMISE frames being processed. These frames allow the server to push additional resources to the client.","resolution":"This is an informational log for HTTP\/2 protocol debugging. If server push is causing issues, consider disabling it in your HTTP\/2 configuration."},{"function":"h2_proxy_util_frame_print","message_template":"PING[length=%d, ack=%d, stream=%d]","reason":"Provides debugging information about HTTP\/2 PING frames being processed. These frames are used to measure round-trip time and check connection liveness.","resolution":"This is an informational log for HTTP\/2 protocol debugging. If many PING frames appear without responses, it may indicate network connectivity issues."},{"function":"h2_proxy_util_frame_print","message_template":"GOAWAY[error=%d, reason='%s', last_stream=%d]","reason":"Provides debugging information about HTTP\/2 GOAWAY frames being processed. These frames indicate that the connection is being terminated, often due to errors.","resolution":"Investigate the error code and reason string to determine why the connection is being closed. Common issues include protocol errors, timeout issues, or server-side resource constraints. This may require adjusting HTTP\/2 settings or fixing client implementation issues."},{"function":"h2_proxy_util_frame_print","message_template":"WINDOW_UPDATE[stream=%d, incr=%d]","reason":"Provides debugging information about HTTP\/2 WINDOW_UPDATE frames being processed. These frames are used for flow control to prevent sender overload.","resolution":"This is an informational log for HTTP\/2 protocol debugging. If flow control issues are suspected, check if window updates are being properly processed and if initial window sizes are appropriate."},{"function":"h2_proxy_util_frame_print","message_template":"type=%d[length=%d, flags=%d, stream=%d]","reason":"Provides debugging information about unknown or uncommon HTTP\/2 frame types being processed. This is a fallback format for frames not explicitly handled.","resolution":"If these appear frequently, investigate why non-standard frame types are being used. May indicate a client using HTTP\/2 extensions or experimental features not fully supported by the server."}],"project":"apache\/httpd"}