{"module":"h2_proxy_util.h","summary":"This module provides utility functions for HTTP\/2 proxy implementation in Apache httpd, including data structures for request management, HTTP\/2 frame handling, and header manipulation tools. It defines interfaces for integer hashes, queues, and FIFO implementations used throughout the mod_h2 module.","logs":[{"function":"h2_proxy_util_frame_print","message_template":"formatted nghttp2 frame information","reason":"Formats HTTP\/2 frame information into a readable string representation for debugging purposes","resolution":"This is an informational function used for debugging. No resolution required unless the frame details reveal protocol errors."},{"function":"h2_proxy_fifo_push","message_template":"Unable to push element to FIFO queue","reason":"Pushing to the FIFO queue may fail if the queue is full or terminated","resolution":"Check if the FIFO queue is full or has been terminated. May require increasing queue capacity or resolving deadlock conditions."},{"function":"h2_proxy_fifo_pull","message_template":"Unable to pull element from FIFO queue","reason":"Pulling from the FIFO queue may fail if the queue is empty or terminated","resolution":"Verify that the FIFO queue has elements and hasn't been terminated. Check producer-consumer logic for possible issues."},{"function":"h2_proxy_req_make","message_template":"Failed to create HTTP\/2 proxy request","reason":"Creation of an HTTP\/2 proxy request structure failed, possibly due to invalid parameters or memory allocation issues","resolution":"Check the validity of input parameters (method, scheme, authority, path) and ensure sufficient memory is available."},{"function":"h2_proxy_link_reverse_map","message_template":"Failed to reverse map link header","reason":"Reverse mapping of Link headers for proxy purposes failed, possibly due to invalid URIs","resolution":"Verify that the real server URI and proxy server URI are correctly configured and that the link header format is valid."}],"project":"apache\/httpd"}