{"module":"h2_request.c","summary":"This module handles HTTP\/2 request processing in Apache, converting HTTP\/2 requests with their pseudo-headers into internal Apache request structures. It validates HTTP\/2 protocol compliance and maps HTTP\/2 specific headers to HTTP\/1.1 equivalents for internal processing.","logs":[{"function":"h2_request_add_header","message_template":"h2_request: pseudo header after request start","reason":"A pseudo header (starting with ':') was received after regular headers, which violates HTTP\/2 protocol rules. Likely happens with malformed clients or intermediaries not following HTTP\/2 protocol order requirements.","resolution":"Fix the HTTP\/2 client to send all pseudo-headers before regular headers according to RFC 7540 section 8.1.2.1."},{"function":"h2_request_add_header","message_template":"h2_request: ignoring unknown pseudo header %s","reason":"The server received an unknown HTTP\/2 pseudo header. Valid pseudo headers are :method, :scheme, :path, :authority, and :protocol. This occurs when clients or intermediaries send non-standard pseudo headers.","resolution":"Check HTTP\/2 client implementation and ensure it only sends standardized pseudo headers. This is usually a warning and processing continues normally."},{"function":"assign_headers","message_template":"overwriting 'Host: %s' with :authority: %s'","reason":"The Host header differs from the :authority pseudo header value. According to HTTP\/2 spec, the :authority pseudo header takes precedence.","resolution":"This is informational and usually harmless. However, if applications depend on specific Host header values, check client configuration to ensure consistent values between Host and :authority."},{"function":"assign_headers","message_template":"set 'Host: %s' from :authority","reason":"The server is setting the Host header from the :authority pseudo header value, which is the standard approach for HTTP\/2 requests.","resolution":"This is an informational trace message and requires no resolution."},{"function":"h2_create_request_rec","message_template":"':scheme: %s' header present in CONNECT request","reason":"A CONNECT request included a :scheme pseudo header, which is not allowed according to HTTP\/2 protocol. CONNECT requests establish tunnels and should not specify a scheme.","resolution":"Fix the HTTP\/2 client implementation to not include :scheme pseudo headers in CONNECT requests as per RFC 7540."},{"function":"h2_create_request_rec","message_template":"':path: %s' header present in CONNECT request","reason":"A CONNECT request included a :path pseudo header, which is not allowed according to HTTP\/2 protocol. CONNECT requests should only use :authority to specify the target.","resolution":"Fix the HTTP\/2 client implementation to not include :path pseudo headers in CONNECT requests as per RFC 7540."},{"function":"h2_create_request_rec","message_template":"':protocol: %s' header present in %s request","reason":"An HTTP\/2 request included a :protocol pseudo header, which is not widely supported or might be used incorrectly. This pseudo header is mainly used for extended CONNECT in newer HTTP\/2 implementations.","resolution":"Check if the client is using the :protocol pseudo header according to its intended purpose for extended CONNECT. If not required, modify the client to avoid sending this header."},{"function":"h2_create_request_rec","message_template":"H2ProxyRequests on, but request misses :scheme","reason":"Server is configured as a forward proxy (H2ProxyRequests is enabled) but the HTTP\/2 request is missing the required :scheme pseudo header. Proxied requests require complete information about the target.","resolution":"Ensure the HTTP\/2 client sends a :scheme pseudo header when communicating with a forward proxy. Check client configuration or proxy settings."},{"function":"h2_create_request_rec","message_template":"H2ProxyRequests on, but request misses :authority","reason":"Server is configured as a forward proxy (H2ProxyRequests is enabled) but the HTTP\/2 request is missing the required :authority pseudo header. Proxied requests need to know the target host.","resolution":"Ensure the HTTP\/2 client sends an :authority pseudo header when communicating with a forward proxy. Check client configuration or proxy settings."},{"function":"h2_create_request_rec","message_template":"h2_request: access_status=%d, request_create failed","reason":"The post-read request hooks failed during HTTP\/2 request processing. This could happen if a request is made to a virtual host where HTTP\/2 is disabled or other configuration issues prevent request processing.","resolution":"Check server configuration, particularly virtual host settings related to HTTP\/2. Review other log entries for the specific access_status code to determine the exact cause of failure."},{"function":"h2_create_request_rec","message_template":"ap_die(%d) for %s","reason":"The server is generating an error response with the specified HTTP status code for the request. This is a trace-level message indicating normal error handling.","resolution":"This is a debugging message and doesn't need resolution itself. Look for other log entries with the specific error code to understand why the request failed."}],"project":"apache\/httpd"}