{"module":"h2_switch.c","summary":"This module handles the negotiation and switching between HTTP\/1.1 and HTTP\/2 protocols in Apache HTTP Server. It evaluates protocol upgrade requests, validates necessary headers, and manages the transition from HTTP\/1.1 to HTTP\/2 when conditions are met.","logs":[{"function":"h2_switch_init","message_template":"h2_switch init","reason":"Logs a trace message when the HTTP\/2 switch module initializes. This is an informational message indicating the module's startup.","resolution":"This is an informational log and doesn't require resolution."},{"function":"h2_protocol_propose","message_template":"protocol switch: current proto != http\/1.1, declined","reason":"Logs when a protocol switch is declined because the current protocol is not HTTP\/1.1. HTTP\/2 can only be negotiated from HTTP\/1.1.","resolution":"This is expected behavior when trying to switch to HTTP\/2 from a non-HTTP\/1.1 protocol. No resolution needed unless HTTP\/2 is specifically required for this connection."},{"function":"h2_protocol_propose","message_template":"protocol propose: connection requirements not met","reason":"Logs when the connection doesn't meet requirements for HTTP\/2, such as TLS settings or MPM compatibility.","resolution":"Check if the server MPM is compatible with HTTP\/2 and verify TLS configuration if using HTTPS. HTTP\/2 requires a compatible MPM like event or worker."},{"function":"h2_protocol_propose","message_template":"upgrade without HTTP2-Settings declined","reason":"Logs when an HTTP\/2 upgrade request lacks the required HTTP2-Settings header. This is essential for HTTP\/2 negotiation.","resolution":"Ensure the client is sending the HTTP2-Settings header when requesting an HTTP\/2 upgrade. This is often a client configuration issue."},{"function":"h2_protocol_propose","message_template":"upgrade without HTTP2-Settings declined","reason":"Logs when the Connection header doesn't contain the 'http2-settings' token, which is required for HTTP\/2 upgrade.","resolution":"Ensure the client includes 'http2-settings' in the Connection header when requesting an HTTP\/2 upgrade. Check client HTTP\/2 configuration."},{"function":"h2_protocol_propose","message_template":"upgrade with body declined","reason":"Logs when an HTTP\/2 upgrade is attempted with a request that has a body. HTTP\/2 upgrades are only allowed for requests without bodies.","resolution":"HTTP\/2 upgrades can only happen on requests without bodies. Use a bodyless request for upgrading or consider using ALPN for HTTP\/2 negotiation instead."},{"function":"h2_protocol_propose","message_template":"proposing protocol '%s'","reason":"Trace log that indicates which HTTP\/2 protocol variant is being proposed during negotiation.","resolution":"This is an informational log and doesn't require resolution."},{"function":"h2_protocol_switch","message_template":"switching protocol to '%s'","reason":"Trace log that indicates the server is switching to the specified HTTP\/2 protocol variant.","resolution":"This is an informational log and doesn't require resolution."},{"function":"h2_protocol_switch","message_template":"session setup","reason":"Logs when there's an error during HTTP\/2 session setup. This likely indicates a failure to initialize the HTTP\/2 connection after protocol negotiation.","resolution":"Check server resources like memory, file descriptors, and connection limits. Review other error logs for specific reasons for the session setup failure."}],"project":"apache\/httpd"}