{"module":"h2_workers.c","summary":"This module manages a pool of worker threads for processing HTTP\/2 connections in the Apache HTTP Server. It handles worker creation, activation, execution, idle timeouts, and cleanup, providing a mechanism for efficient connection processing in HTTP\/2 connections.","logs":[{"function":"activate_slot","message_template":"h2_workers: activate slot %d","reason":"Indicates a worker slot has been activated to handle incoming connections. This is a normal informational message during worker pool operation.","resolution":"No resolution needed. This is an informational message that indicates normal operation."},{"function":"slot_run","message_template":"h2_workers: idle timeout slot %d in state %d (%d activations)","reason":"A worker thread has timed out due to inactivity and will be terminated. This helps manage resources by releasing unused workers.","resolution":"This is normal behavior when traffic decreases. If you're seeing many workers timing out and then new ones being created frequently, consider adjusting the idle timeout value to prevent thrashing."},{"function":"slot_run","message_template":"h2_workers: terminate slot %d in state %d (%d activations)","reason":"A worker thread is being terminated, either due to timeout or shutdown. The message includes the worker's state and how many times it was activated.","resolution":"No resolution needed for normal operation. If seeing excessive terminations during high load, check for potential configuration issues with min\/max worker settings."},{"function":"workers_pool_cleanup","message_template":"h2_workers: cleanup %d workers (%d idle)","reason":"The worker pool is being cleaned up, showing how many workers are active and idle at the start of cleanup.","resolution":"This is an informational message during server shutdown. No resolution needed."},{"function":"workers_pool_cleanup","message_template":"h2_workers: waiting for workers to close, still seeing %d workers (%d idle) living","reason":"During cleanup, some worker threads are still running and haven't terminated yet. The server is waiting for them to finish.","resolution":"If this message appears repeatedly during shutdown, it might indicate workers are stuck. Check for potential deadlocks or long-running requests that prevent clean shutdown."},{"function":"workers_pool_cleanup","message_template":"h2_workers: cleanup, %d workers (%d idle) did not exit after %d seconds.","reason":"Worker threads did not terminate within the expected time during server shutdown. This could indicate stuck connections or processing issues.","resolution":"Investigate why workers aren't terminating properly. Look for stuck connections, unresponsive backends, or potential deadlocks. In extreme cases, you might need to force-terminate the server."},{"function":"workers_pool_cleanup","message_template":"h2_workers: cleanup all workers terminated","reason":"All worker threads have successfully terminated during cleanup process. This indicates normal shutdown progress.","resolution":"Informational message indicating successful cleanup. No resolution needed."},{"function":"workers_pool_cleanup","message_template":"h2_workers: cleanup zombie workers joined","reason":"All zombie worker threads (terminated but not yet joined) have been properly joined. This completes the worker pool cleanup.","resolution":"Informational message indicating successful cleanup. No resolution needed."},{"function":"h2_workers_create","message_template":"h2_workers: created with min=%d max=%d idle_ms=%d","reason":"Worker pool has been created with specified minimum and maximum worker counts and idle timeout. This is normal during server startup.","resolution":"Informational message. If you experience performance issues, you might want to adjust these parameters in your configuration."},{"function":"h2_workers_create","message_template":"h2_workers: using stacksize=%ld","reason":"The worker threads are using a specific stack size that was configured in the server settings.","resolution":"Informational message. Adjust the ThreadStackSize directive if you encounter stack overflow errors or want to optimize memory usage."},{"function":"h2_workers_shutdown","message_template":"h2_workers: shutdown graceful=%d","reason":"The worker pool is being shut down, with parameter indicating whether it's a graceful (1) or immediate (0) shutdown.","resolution":"Informational message during server shutdown. No resolution needed."},{"function":"h2_workers_create","message_template":"h2_workers: errors initializing","reason":"Failed to initialize the worker pool due to resource allocation errors or thread creation issues. This prevents proper HTTP\/2 operation.","resolution":"Check server resources including available memory, thread limits, and system constraints. You may need to reduce the number of worker threads or address system resource limitations."}],"project":"apache\/httpd"}