{"module":"h2_ws.c","summary":"This module implements WebSocket protocol support for HTTP\/2 connections in Apache HTTP Server. It handles the translation between HTTP\/2 WebSocket CONNECT requests and HTTP\/1.1 WebSocket upgrade protocol, including validation of responses and security tokens.","logs":[{"function":"h2_ws_rewrite_request","message_template":"h2_c2(%s-%d): websocket request with method %s","reason":"Logs when a WebSocket request is received with a method other than CONNECT. HTTP\/2 WebSocket requests should use the CONNECT method as per RFC 8441.","resolution":"Client applications should be updated to use the CONNECT method for HTTP\/2 WebSocket requests."},{"function":"h2_ws_rewrite_request","message_template":"h2_c2(%s-%d): websocket CONNECT without :scheme","reason":"Logs when a WebSocket CONNECT request is missing the required :scheme pseudo-header. This is likely due to a malformed client request.","resolution":"Client should be updated to include the :scheme pseudo-header in WebSocket CONNECT requests. Check client implementation for compliance with RFC 8441."},{"function":"h2_ws_rewrite_request","message_template":"h2_c2(%s-%d): websocket CONNECT without :path","reason":"Logs when a WebSocket CONNECT request is missing the required :path pseudo-header. This is likely due to a malformed client request.","resolution":"Client should be updated to include the :path pseudo-header in WebSocket CONNECT requests. Check client implementation for compliance with RFC 8441."},{"function":"h2_ws_rewrite_request","message_template":"h2_c2(%s-%d): websocket CONNECT for %s","reason":"Informational log showing the path for a valid WebSocket CONNECT request that will be processed.","resolution":"Informational log, no resolution required."},{"function":"h2_ws_rewrite_request","message_template":"error generating secret","reason":"Logs a critical error when the server fails to generate random bytes for the WebSocket key. This prevents secure WebSocket negotiation.","resolution":"Check system entropy sources and available memory. This could indicate system resource issues or problems with the random number generator."},{"function":"ws_handle_resp","message_template":"h2_c2(%s-%d): H2_C2_WS_OUT inspecting response %d","reason":"Informational log showing that the WebSocket output filter is inspecting a response with the given status code.","resolution":"Informational log, no resolution required."},{"function":"ws_handle_resp","message_template":"h2_c2(%s-%d): websocket CONNECT, valid 101 Upgrade, converting to 200 response","reason":"Logs when a valid WebSocket upgrade response (101) is received and will be converted to a 200 OK response for HTTP\/2 WebSocket protocol.","resolution":"Informational log, no resolution required. This indicates successful WebSocket negotiation."},{"function":"ws_handle_resp","message_template":"h2_c2(%s-%d): websocket CONNECT, got 101 response without Sec-WebSocket-Accept header","reason":"Logs a warning when a 101 Switching Protocols response is received but is missing the required Sec-WebSocket-Accept header. This indicates an improper WebSocket implementation on the server side.","resolution":"Check the WebSocket implementation on the server\/backend. The backend resource is not correctly implementing the WebSocket protocol according to RFC 6455."},{"function":"ws_handle_resp","message_template":"h2_c2(%s-%d): websocket CONNECT, 101 response without 'Sec-WebSocket-Accept: %s' but expected %s","reason":"Logs an error when a 101 response contains an incorrect Sec-WebSocket-Accept value. This could indicate a security issue or implementation bug.","resolution":"Verify that the backend server is correctly implementing WebSocket protocol negotiation. This could indicate either a bug in the implementation or potentially a malicious server response."},{"function":"ws_handle_resp","message_template":"h2_c2(%s-%d): websocket CONNECT, invalid response %d","reason":"Logs when a WebSocket CONNECT request receives a non-101 response in the 2xx range, indicating the server does not support WebSockets for the requested resource.","resolution":"Check if the requested URI supports WebSockets. The backend resource might not be configured to handle WebSocket connections or may not understand the WebSocket upgrade request."}],"project":"apache\/httpd"}