{"module":"mod_http2.c","summary":"This module implements HTTP\/2 protocol support for Apache HTTP Server. It handles initialization, configuration, hooks setup, and provides environment variables for HTTP\/2 connections. The module checks for MPM compatibility and manages the lifecycle of HTTP\/2 connections.","logs":[{"function":"h2_post_config","message_template":"initializing post config dry run","reason":"Logs when the module is going through the initial dry run configuration phase. This occurs during server startup before the actual initialization.","resolution":"This is an informational message that indicates normal operation during server startup. No resolution required."},{"function":"h2_post_config","message_template":"mod_http2 (v%s, feats=%s%s%s%s, nghttp2 %s), initializing...","reason":"Logs the version of mod_http2, enabled features, and nghttp2 library version during module initialization.","resolution":"This is an informational message indicating the module is starting. No resolution required. The features (CHPRIO, SHA256, INVHD, DWINS) indicate which capabilities are enabled."},{"function":"h2_post_config","message_template":"The mpm module (%s) is not supported by mod_http2. The mpm determines how things are processed in your server. HTTP\/2 has more demands in this regard and the currently selected mpm will just not do. This is an advisory warning. Your server will continue to work, but the HTTP\/2 protocol will be inactive.","reason":"Warns when the Multi-Processing Module (MPM) being used is not compatible with HTTP\/2 requirements, which prevents HTTP\/2 from being activated.","resolution":"Change the MPM module in httpd.conf to a compatible one like 'event' or 'worker'. HTTP\/2 generally requires a threaded MPM and will not work with prefork MPM. Use 'LoadModule mpm_event_module' instead of 'LoadModule mpm_prefork_module'."},{"function":"h2_child_init","message_template":"initializing connection handling","reason":"Error log that occurs when there is a problem initializing HTTP\/2 connection handling in a child process.","resolution":"Check system resources and Apache error logs for more specific errors. May be due to resource limitations, permissions issues, or conflicts with other modules. Ensure Apache has sufficient permissions and resources to initialize connection handlers."},{"function":"h2_hooks","message_template":"installing hooks","reason":"Trace-level log that indicates the module is registering its hooks with the Apache server.","resolution":"This is a debug\/trace message for developers and not visible in normal operation. No resolution required."}],"project":"apache\/httpd"}