{"module":"mod_proxy_http2.c","summary":"This module implements HTTP\/2 proxying for Apache HTTP Server. It handles the translation of HTTP\/1.1 requests to HTTP\/2 for backend servers, manages HTTP\/2 sessions, and handles connection establishment and request processing for both encrypted (h2) and unencrypted (h2c) HTTP\/2 connections.","logs":[{"function":"h2_proxy_post_config","message_template":"mod_proxy_http2 (v%s, nghttp2 %s), initializing...","reason":"Logs initialization information including module and nghttp2 library versions when the module is being initialized","resolution":"Informational log, no resolution required"},{"function":"proxy_http2_canon","message_template":"HTTP2: canonicalising URL %s","reason":"Trace-level log that shows URLs being canonicalized for HTTP\/2 proxy requests","resolution":"Informational log, no resolution required"},{"function":"proxy_http2_canon","message_template":"error parsing URL %s: %s","reason":"Logs an error when the proxy cannot parse the provided URL","resolution":"Check the URL format in the proxy configuration. Ensure the URL follows the correct syntax for HTTP\/2 (h2:\/\/ or h2c:\/\/) and doesn't contain invalid characters"},{"function":"proxy_http2_canon","message_template":"To be forwarded path contains control characters or spaces","reason":"Error indicating that the path portion of the URL contains invalid characters","resolution":"Ensure the path component of the URL is properly encoded without control characters or spaces. URL-encode any special characters in the path"},{"function":"proxy_http2_canon","message_template":"To be forwarded query string contains control characters or spaces","reason":"Error indicating that the query string portion of the URL contains invalid characters","resolution":"Ensure the query string component of the URL is properly encoded without control characters or spaces. URL-encode any special characters in the query string"},{"function":"add_request","message_template":"pass request body failed to %pI (%s) from %s (%s)","reason":"Logs an error when the proxy fails to forward the request body to the backend server","resolution":"Check network connectivity to the backend server. Verify backend server configuration and ensure it is accepting connections. Check for any firewall rules that might be blocking the connection"},{"function":"request_done","message_template":"h2_proxy_session(%s): request done, touched=%d, error=%d","reason":"Trace-level log that indicates a request has completed with status information","resolution":"If error code is non-zero, check the backend server logs and configuration. May require investigating specific HTTP\/2 stream errors"},{"function":"ctx_run","message_template":"session unavailable","reason":"Logs a debug message when an HTTP\/2 session cannot be established","resolution":"Check backend server availability and configuration. Ensure HTTP\/2 is properly configured on both proxy and backend. May require increasing connection timeouts or checking for resource constraints"},{"function":"ctx_run","message_template":"eng(%s): run session %s","reason":"Logs a debug message when starting to process an HTTP\/2 session","resolution":"Informational log, no resolution required"},{"function":"ctx_run","message_template":"eng(%s): end of session %s","reason":"Logs a debug message when an HTTP\/2 session encounters an error during processing","resolution":"Check for connection issues between proxy and backend server. May indicate backend server is overloaded or has misconfiguration. Inspect backend server logs for corresponding errors"},{"function":"ctx_run","message_template":"eng(%s): master connection gone","reason":"Logs when the client connection to the proxy has been aborted","resolution":"May indicate client closed the connection prematurely. If happening frequently, check client behavior or network issues between clients and proxy server"},{"function":"proxy_http2_handler","message_template":"H2: serving URL %s","reason":"Trace-level log showing the URL being served via HTTP\/2 proxy","resolution":"Informational log, no resolution required"},{"function":"proxy_http2_handler","message_template":"H2: failed to make connection to backend: %s","reason":"Logs when the proxy cannot establish a connection to the backend server","resolution":"Verify the backend server is running and accessible. Check network connectivity, firewall rules, and backend server configuration. Ensure the backend hostname resolves correctly"},{"function":"proxy_http2_handler","message_template":"setup new connection: is_ssl=%d %s %s %s","reason":"Debug message logged when setting up a new backend connection, with SSL status and connection details","resolution":"If errors occur with SSL connections, check SSL configuration, certificates, and supported protocols. For non-SSL issues, check backend server configuration and connectivity"},{"function":"proxy_http2_handler","message_template":"giving up after %d reconnects, request-done=%d","reason":"Logs when the proxy gives up trying to reconnect to the backend after multiple attempts","resolution":"Check backend server stability and connectivity. May indicate backend server is down or unreachable. Consider increasing max reconnect attempts if transient issues are common"},{"function":"proxy_http2_handler","message_template":"leaving handler","reason":"Debug message indicating that the HTTP\/2 proxy handler is finishing processing","resolution":"Informational log, no resolution required"}],"project":"apache\/httpd"}