{"project":"sendmail","module":"rmail.c","summary":"The rmail module processes UUCP-style email message headers, extracting sender information and reformatting it for processing by the sendmail program. It acts as a bridge between UUCP mail transfer and the modern SMTP-based mail system.","logs":[{"function":"xalloc","message_template":"out of memory","reason":"Memory allocation failed when trying to allocate space for a string or argument array","resolution":"Check system memory usage and potentially increase available memory. This is typically a temporary failure that might resolve with a retry."},{"function":"main","message_template":"no data","reason":"Reached end of file or encountered an error when trying to read the initial data from stdin","resolution":"Verify that the input stream contains valid data and is properly connected to the program's stdin."},{"function":"main","message_template":"line too long","reason":"Encountered an input line that exceeds the buffer size of 2048 bytes","resolution":"Check for malformed input data or increase the buffer size in the code if extremely long lines are expected."},{"function":"main","message_template":"missing or empty From line: %s","reason":"The input data doesn't start with a valid 'From ' line, which is required for UUCP mail format","resolution":"Ensure that the input follows UUCP mail format and begins with a proper 'From ' header line."},{"function":"main","message_template":"corrupted From line: %s","reason":"The From line exists but has invalid format or is missing required components","resolution":"Verify that the From line in the input data follows the expected UUCP format with a valid sender address."},{"function":"main","message_template":"remote from: %s","reason":"Debug message showing the remote system name extracted from the 'remote from' field","resolution":"Informational log, no resolution required. Only appears when debug mode is enabled."},{"function":"main","message_template":"bang starts address: %s","reason":"Address starts with a bang ('!') character, which is invalid in this context","resolution":"Check the input data format and ensure addresses don't start with a bang character, which should only be used as a separator in UUCP path notation."},{"function":"main","message_template":"bang: %s","reason":"Debug message showing the bang path extracted from the address","resolution":"Informational log, no resolution required. Only appears when debug mode is enabled."},{"function":"main","message_template":"from_sys: %s","reason":"Debug message showing the system name extracted from the From line","resolution":"Informational log, no resolution required. Only appears when debug mode is enabled."},{"function":"main","message_template":"from_path: %s","reason":"Debug message showing the full path extracted from the From line","resolution":"Informational log, no resolution required. Only appears when debug mode is enabled."},{"function":"main","message_template":"from_user: %s","reason":"Debug message showing the username extracted from the From line","resolution":"Informational log, no resolution required. Only appears when debug mode is enabled."},{"function":"main","message_template":"dash precedes argument: %s","reason":"Command line argument starts with a dash, which could be confused with an option flag","resolution":"Remove leading dashes from user addresses passed to rmail, or use a different format that won't be interpreted as an option."},{"function":"main","message_template":"Cannot malloc","reason":"Memory allocation failed when trying to allocate space for an email address wrapper","resolution":"Check system memory usage and potentially increase available memory. This is typically a temporary failure that might resolve with a retry."},{"function":"main","message_template":"Argument count mismatch","reason":"Internal error where the tracked argument count doesn't match reality","resolution":"This indicates a bug in the program. Report the issue to the development team with steps to reproduce."},{"function":"main","message_template":"Sendmail arguments:","reason":"Debug message introducing the list of arguments that will be passed to sendmail","resolution":"Informational log, no resolution required. Only appears when debug mode is enabled."},{"function":"main","message_template":"\t%s","reason":"Debug message showing each argument that will be passed to sendmail","resolution":"Informational log, no resolution required. Only appears when debug mode is enabled."},{"function":"main","message_template":"stdin seek","reason":"Failed to seek to the correct position in the input file","resolution":"Verify that the input file is a regular file and is readable. The issue might be related to file permissions or file system problems."},{"function":"main","message_template":"%s","reason":"Error executing sendmail, with the error message supplied by the system","resolution":"Check that sendmail is installed at the expected path and has execute permissions. Verify the sendmail configuration and dependencies."},{"function":"main","message_template":"pipe failed","reason":"Failed to create a pipe for communication with the sendmail process","resolution":"This indicates a system resource issue. Check for resource limits, file descriptor limits, or other system constraints."},{"function":"main","message_template":"fork failed","reason":"Failed to fork a new process for executing sendmail","resolution":"Check system resource usage, particularly process limits. This could be due to resource exhaustion or configuration limits."},{"function":"main","message_template":"sm_io_open failed","reason":"Failed to open a file descriptor for writing to the pipe","resolution":"This is likely related to system resources or file descriptor limits. Check system configuration and available resources."},{"function":"main","message_template":"stdin: %s","reason":"Error reading from stdin, with the specific error message supplied by the system","resolution":"Verify that stdin is properly connected and contains valid data. Check for file system or I\/O errors."},{"function":"main","message_template":"sm_io_close failed","reason":"Failed to close the file descriptor for the pipe","resolution":"This is typically a transient error that shouldn't affect functionality. If persistent, check for file descriptor leaks or system resource issues."},{"function":"main","message_template":"%s: did not terminate normally","reason":"The sendmail process terminated abnormally, possibly due to a signal or crash","resolution":"Check the sendmail logs for specific errors. This could be due to configuration issues, permission problems, or other sendmail-specific errors."},{"function":"main","message_template":"%s: terminated with %d (non-zero) status","reason":"The sendmail process exited with a non-zero status code, indicating an error","resolution":"Check the sendmail logs for the specific error. The status code may provide a clue to the nature of the problem, which is likely related to mail delivery or configuration."},{"function":"usage","message_template":"usage: rmail [-T] [-D domain] user ...","reason":"Displayed when the program is invoked with incorrect command line arguments","resolution":"Follow the usage instructions by providing correct command line arguments. At minimum, you need to specify at least one recipient user."},{"function":"err","message_template":"rmail: ","reason":"Prefix for all error messages output by the program","resolution":"Look at the complete message that follows this prefix to determine the specific error and its resolution."}]}