{"module":"nwssl_module.c","summary":"This module provides SSL\/TLS capabilities for Apache web server on NetWare. It handles secure connections by configuring SSL\/TLS ports, managing secure sockets, and implementing RFC 2817 TLS Upgrade for HTTP 1.1 connections. The module uses NetWare's built-in SSL\/TLS logic through WinSock interfaces.","logs":[{"function":"parse_addr","message_template":"Cannot resolve host name %s --- exiting!","reason":"The hostname provided in a SecureListen or NWSSLUpgradeable directive cannot be resolved to an IP address. This is a fatal error that causes the server to exit.","resolution":"Verify that the hostname is correctly spelled and can be resolved through DNS. Check the network configuration and DNS settings on the server."},{"function":"parse_addr","message_template":"Host %s has multiple addresses ---\nyou must choose one explicitly for use as\na secure port.  Exiting!!!","reason":"The hostname in a SecureListen or NWSSLUpgradeable directive resolves to multiple IP addresses. The module requires a single explicit IP address for secure ports.","resolution":"Use a specific IP address instead of a hostname in the SecureListen or NWSSLUpgradeable directive. Alternatively, set up DNS to ensure the hostname resolves to a single IP address."},{"function":"make_secure_socket","message_template":"make_secure_socket: failed to get a socket for %s","reason":"The system was unable to create a socket for the specified address and port. This could be due to resource limitations or invalid socket parameters.","resolution":"Check if the port is already in use by another application. Ensure that the system has sufficient resources. Restart the server to free up socket resources."},{"function":"make_secure_socket","message_template":"make_secure_socket: for %s, WSAIoctl: (SO_SSL_SET_FLAGS)","reason":"Failed to set the SSL flags on the socket for enabling SSL or configuring it as a server. This indicates a problem with the SSL implementation in NetWare.","resolution":"Check that the SSL subsystem is properly installed and configured on NetWare. Consider updating to the latest NetWare patches that address SSL issues."},{"function":"make_secure_socket","message_template":"make_secure_socket: for %s, WSAIoctl: (SO_SSL_SET_SERVER)","reason":"Failed to set the server SSL options on the socket. This could be due to invalid certificate information or SSL configuration issues.","resolution":"Verify that the certificate specified in the SecureListen directive exists and is correctly formatted. Check that the SSL key pair name is properly configured in ConsoleOne."},{"function":"convert_secure_socket","message_template":"Error: %d with WSAIoctl(flag SO_TLS_ENABLE)","reason":"Failed to enable TLS on a socket during a connection. The specific Windows Socket error code provides details about the failure.","resolution":"Look up the specific error code to determine the exact cause. Common issues include SSL configuration problems or resource limitations. Verify that SSL is properly configured on the NetWare server."},{"function":"convert_secure_socket","message_template":"Error: %d with WSAIoctl(SO_TLS_SET_CLIENT)","reason":"Failed to set client TLS options on a socket during connection setup. This occurs when establishing an outgoing secure connection.","resolution":"Check the error code for specific details. Ensure that the client certificates, if used, are properly configured. Verify that the SSL subsystem is functioning correctly on NetWare."},{"function":"SSLize_Socket","message_template":"Error: %d with WSAIoctl(SO_TLS_SET_FLAGS, SO_TLS_ENABLE)","reason":"Failed to enable TLS on a socket during a protocol upgrade. This happens when upgrading an HTTP connection to HTTPS.","resolution":"Verify SSL configuration on the server. Check system resources to ensure there are sufficient resources for SSL connections. Restart the server if SSL subsystem seems to be in an inconsistent state."},{"function":"SSLize_Socket","message_template":"Error: %d with WSAIoctl(SO_TLS_SET_FLAGS, SO_TLS_SERVER)","reason":"Failed to set the TLS server flag on a socket during protocol upgrade. This is required for the server side of an SSL connection.","resolution":"Check the SSL configuration in the server. Ensure that the certificate specified exists and is valid. The error code provides more specific information about the cause of the failure."},{"function":"SSLize_Socket","message_template":"Error: %d with WSAIoctl(SO_TLS_SET_SERVER)","reason":"Failed to configure the TLS server options on a socket during an HTTP-to-HTTPS upgrade. This often relates to certificate configuration.","resolution":"Verify that the SSL key pair specified in the configuration exists and is correctly formatted. Ensure that the certificate has not expired. The specific error code provides additional details about the failure."},{"function":"nwssl_post_config","message_template":"alloc_listener: failed to set up sockaddr for %s:%d","reason":"Failed to set up the socket address structure for a secure listener. This usually indicates a problem with the IP address or port configuration.","resolution":"Check that the IP address is valid and that the port number is within the valid range. Ensure that the combination of address and port is not already in use by another application."},{"function":"nwssl_post_config","message_template":"No Listen directive found for upgradeable listener %s:%d","reason":"An NWSSLUpgradeable directive was specified, but no corresponding Listen directive exists for the same address:port combination. The upgradeable listener requires a base listener to work.","resolution":"Add a matching Listen directive for the same address and port specified in the NWSSLUpgradeable directive. The Listen directive should come before the NWSSLUpgradeable directive in the configuration."},{"function":"ssl_io_filter_Upgrade","message_template":"Unable to get upgradeable socket handle","reason":"Failed to obtain the socket handle during a TLS upgrade. This indicates a problem with the connection state or socket availability.","resolution":"This is usually an internal error. Check server resources and connection state. If this error occurs frequently, consider a server restart or check for compatibility issues with the Apache version."},{"function":"ssl_io_filter_Upgrade","message_template":"could not send interim 101 Upgrade response","reason":"Failed to send the HTTP 101 Switching Protocols response during a TLS upgrade. This prevents the protocol upgrade from completing successfully.","resolution":"Check network connectivity and server resource usage. This could be due to a network interruption or client disconnect. If persistent, investigate if there are firewall or proxy issues interfering with the upgrade process."},{"function":"ssl_io_filter_Upgrade","message_template":"Upgradeable socket handle not found","reason":"Could not find a socket handle that can be upgraded to TLS. This occurs when trying to upgrade a connection but the socket is not available or not properly configured.","resolution":"Verify that the NWSSLUpgradeable directive is correctly configured. Check if the connection was still active when the upgrade was attempted. Ensure that the key pair name specified is valid."},{"function":"ssl_io_filter_Upgrade","message_template":"Awaiting re-negotiation handshake","reason":"Informational message indicating that the server is waiting for the TLS handshake to complete after sending the 101 Switching Protocols response. This is part of normal operation for TLS upgrades.","resolution":"Information log, no resolution required. If handshakes consistently fail to complete, check client compatibility and network connectivity between client and server."},{"function":"set_secure_listener","message_template":"Missing IP address","reason":"A SecureListen directive was found with an invalid format. The IP address is missing, with only a colon at the beginning of the address string.","resolution":"Correct the SecureListen directive to include a valid IP address or hostname before the colon and port number, or use just a port number to listen on all interfaces."},{"function":"set_secure_listener","message_template":"Address must end in :<port-number>","reason":"A SecureListen directive has a malformed address format with a colon but no port number following it.","resolution":"Correct the SecureListen directive to include a valid port number after the colon, such as '10.0.0.1:443' or just ':443' for all interfaces."},{"function":"set_secure_listener","message_template":"Port must be numeric","reason":"The port specified in a SecureListen directive is not a valid numeric value. Only numeric port values are accepted.","resolution":"Change the port value in the SecureListen directive to a numeric value between 1 and 65535. Common HTTPS ports are 443 and 8443."},{"function":"set_secure_upgradeable_listener","message_template":"Missing IP address","reason":"An NWSSLUpgradeable directive was found with an invalid format. The IP address is missing, with only a colon at the beginning of the address string.","resolution":"Correct the NWSSLUpgradeable directive to include a valid IP address or hostname before the colon and port number, or use just a port number to listen on all interfaces."},{"function":"set_secure_upgradeable_listener","message_template":"Address must end in :<port-number>","reason":"An NWSSLUpgradeable directive has a malformed address format with a colon but no port number following it.","resolution":"Correct the NWSSLUpgradeable directive to include a valid port number after the colon, such as '10.0.0.1:8080' or just ':8080' for all interfaces."},{"function":"set_secure_upgradeable_listener","message_template":"Port must be numeric","reason":"The port specified in an NWSSLUpgradeable directive is not a valid numeric value. Only numeric port values are accepted.","resolution":"Change the port value in the NWSSLUpgradeable directive to a numeric value between 1 and 65535. Common HTTP ports that might be used for upgrade are 80 and 8080."}],"project":"apache\/httpd"}