{"project":"sendmail","module":"..\/working\/sendmail\/libsm\/assert.c","summary":"This module provides assertion checking and abnormal program termination functionality for Sendmail. It defines debug categories for expensive assertions, functions to handle assertion failures, and mechanisms to terminate the program in the event of a logic bug or assertion failure.","logs":[{"function":"sm_abort_defaulthandler","message_template":"%s:%d: %s\n","reason":"Logs the filename, line number, and error message when an assertion fails or a logic bug is detected. This provides specific location information for debugging.","resolution":"This indicates a fatal assertion failure or logic error in the code. The error message and source location should be examined to identify and fix the underlying issue. This usually requires code changes rather than configuration changes."},{"function":"sm_abort_defaulthandler","message_template":"%s\n","reason":"Logs only the error message when an assertion fails but no filename information is available.","resolution":"This indicates a fatal assertion failure or logic error in the code but without source location information. The error message should be examined to identify the issue. May require code changes to address the underlying problem."},{"function":"sm_abort_at","message_template":"exception raised by abort handler:\n","reason":"Logs when the abort handler itself raises an exception, indicating a problem with the error handling mechanism.","resolution":"This is a serious error indicating that the error handling code itself is failing. Review the abort handler implementation and any recent changes to it. May require debugging of the error handling infrastructure."},{"function":"sm_abort","message_template":"[dynamic format string provided by caller]","reason":"Formats and logs a custom error message when a logic bug is detected in the code. The actual message is determined by the caller.","resolution":"The specific error message should provide details about the logic bug. Examine the code that called sm_abort() and the context of the error to determine the appropriate fix. This typically indicates a programming error that needs code changes."}]}