{"project":"sendmail","module":"libsm\/debug.c","summary":"This module provides debugging functionality for sendmail, including configuration of debug levels, management of debug output destinations, and formatting of debug messages with timestamps, PIDs, and custom content.","logs":[{"function":"sm_dprintf","message_template":"%ld: %ld.%06ld ","reason":"Outputs debug information with process ID and time difference since last debug message when sm_trace_pid_time level 3 is active","resolution":"This is an informational debug output for tracing execution flow with timing information. If messages appear unexpectedly, check debug level settings or debug flag configuration."},{"function":"sm_dprintf","message_template":"%ld: %ld.%06ld ","reason":"Outputs debug information with process ID and absolute time when sm_trace_pid_time level 2 is active","resolution":"This is an informational debug output for tracing execution flow with timing information. If messages appear unexpectedly, check debug level settings or debug flag configuration."},{"function":"sm_dprintf","message_template":"[1900-00-00\/00:00:00] ","reason":"Static placeholder for formatted date\/time in debug output","resolution":"This is a placeholder string and should not appear in actual logs. If it does appear, there may be an issue with date formatting."},{"function":"sm_dprintf","message_template":"[%d-%02d-%02d\/%02d:%02d:%02d] ","reason":"Outputs debug information with formatted date and time when sm_trace_pid_time level 1 is active","resolution":"This is an informational debug output for tracing execution flow with date\/time information. If messages appear unexpectedly, check debug level settings or debug flag configuration."},{"function":"sm_dprintf","message_template":"%ld: %s ","reason":"Outputs debug information with process ID and formatted time string","resolution":"This is an informational debug output. If messages appear unexpectedly, check debug level settings or debug flag configuration."},{"function":"SM_RCSID","message_template":"@(#)$Id: debug.c,v 1.33 2013-11-22 20:51:42 ca Exp $","reason":"RCS identification string for version control tracking","resolution":"This is an informational string embedded in the binary for version identification. No resolution needed."},{"function":"SM_DEBUG_T initialization","message_template":"@(#)$Debug: sm_trace_pid_time - print pid and time in debug $","reason":"Description of the sm_trace_pid_time debug option","resolution":"This is an informational string describing a debug option. No resolution needed."}]}