{"project":"sendmail","module":"errstring.c","summary":"This module provides the sm_errstring() function which translates error codes into human-readable messages for various types of errors including system errors, Sendmail-specific errors, DNS errors, database errors, and LDAP errors. These messages are used throughout the application for error reporting and logging.","logs":[{"function":"sm_errstring","message_template":"Operation not permitted","reason":"Returned when a process doesn't have permission to perform the operation (EPERM).","resolution":"Check the permissions of the file or resource and ensure the process has the necessary privileges."},{"function":"sm_errstring","message_template":"Timeout on file open","reason":"Returned when a file open operation times out (E_SM_OPENTIMEOUT).","resolution":"Check for system resource constraints, disk issues, or network latency if accessing remote filesystems."},{"function":"sm_errstring","message_template":"Symbolic links not allowed","reason":"Returned when symbolic links are not permitted in a certain context (E_SM_NOSLINK).","resolution":"Use regular files instead of symbolic links, or change the configuration to allow symbolic links if safe to do so."},{"function":"sm_errstring","message_template":"Hard links not allowed","reason":"Returned when hard links are not permitted in a certain context (E_SM_NOHLINK).","resolution":"Use regular files instead of hard links, or change the configuration to allow hard links if safe to do so."},{"function":"sm_errstring","message_template":"Regular files only","reason":"Returned when an operation requires a regular file but another file type was provided (E_SM_REGONLY).","resolution":"Ensure the file is a regular file, not a directory, socket, FIFO, or other special file type."},{"function":"sm_errstring","message_template":"Executable files not allowed","reason":"Returned when executable files are not permitted in a certain context (E_SM_ISEXEC).","resolution":"Remove the executable bit from the file or use a non-executable file instead."},{"function":"sm_errstring","message_template":"World writable directory","reason":"Returned when a directory has world-writable permissions, which may be a security risk (E_SM_WWDIR).","resolution":"Change the directory permissions to remove world-writable access (chmod o-w directory)."},{"function":"sm_errstring","message_template":"Group writable directory","reason":"Returned when a directory has group-writable permissions, which may be a security risk (E_SM_GWDIR).","resolution":"Change the directory permissions to remove group-writable access (chmod g-w directory)."},{"function":"sm_errstring","message_template":"File changed after open","reason":"Returned when a file has been modified after it was opened (E_SM_FILECHANGE).","resolution":"Check for other processes that might be modifying the file. This could indicate a race condition or security issue."},{"function":"sm_errstring","message_template":"World writable file","reason":"Returned when a file has world-writable permissions, which may be a security risk (E_SM_WWFILE).","resolution":"Change the file permissions to remove world-writable access (chmod o-w file)."},{"function":"sm_errstring","message_template":"Group writable file","reason":"Returned when a file has group-writable permissions, which may be a security risk (E_SM_GWFILE).","resolution":"Change the file permissions to remove group-writable access (chmod g-w file)."},{"function":"sm_errstring","message_template":"Group readable file","reason":"Returned when a file has group-readable permissions, which may be a security risk in certain contexts (E_SM_GRFILE).","resolution":"Change the file permissions to remove group-readable access (chmod g-r file) if needed for security."},{"function":"sm_errstring","message_template":"World readable file","reason":"Returned when a file has world-readable permissions, which may be a security risk in certain contexts (E_SM_WRFILE).","resolution":"Change the file permissions to remove world-readable access (chmod o-r file) if needed for security."},{"function":"sm_errstring","message_template":"Name server: host not found","reason":"Returned when DNS lookup fails because the host does not exist (HOST_NOT_FOUND + E_DNSBASE).","resolution":"Check the hostname for typos, verify DNS configuration, or ensure the domain name exists."},{"function":"sm_errstring","message_template":"Name server: host name lookup failure","reason":"Returned when a temporary DNS server failure occurs (TRY_AGAIN + E_DNSBASE).","resolution":"Retry the operation later, check DNS server availability, or verify network connectivity."},{"function":"sm_errstring","message_template":"Name server: non-recoverable error","reason":"Returned when a permanent DNS server failure occurs (NO_RECOVERY + E_DNSBASE).","resolution":"Check for DNS server misconfiguration, ensure the domain is properly registered, or contact your DNS administrator."},{"function":"sm_errstring","message_template":"Name server: no data known","reason":"Returned when the domain exists but has no data of the requested type (NO_DATA + E_DNSBASE).","resolution":"Verify that the required DNS record type (A, MX, etc.) exists for the domain."},{"function":"sm_errstring","message_template":"Memory allocation failed","reason":"Returned when there is insufficient memory to perform an operation (SMDBE_MALLOC).","resolution":"Check system memory usage, increase available memory, or optimize the application to use less memory."},{"function":"sm_errstring","message_template":"GDBM is not supported","reason":"Returned when attempting to use GDBM database functionality that is not supported (SMDBE_GDBM_IS_BAD).","resolution":"Use a different database type or recompile with GDBM support."},{"function":"sm_errstring","message_template":"Unsupported action","reason":"Returned when attempting an unsupported database operation (SMDBE_UNSUPPORTED).","resolution":"Check the documentation for supported operations and update the code accordingly."},{"function":"sm_errstring","message_template":"Key already exists","reason":"Returned when attempting to insert a duplicate key into a database (SMDBE_DUPLICATE, SMDBE_KEY_EXIST).","resolution":"Either update the existing record instead of inserting a new one, or check for duplicate keys before insertion."},{"function":"sm_errstring","message_template":"Database open failed","reason":"Returned when unable to open a database file (SMDBE_BAD_OPEN).","resolution":"Check file permissions, ensure the path is correct, verify the database file is not corrupted, and ensure sufficient disk space."},{"function":"sm_errstring","message_template":"Key not found","reason":"Returned when a requested key does not exist in the database (SMDBE_NOT_FOUND).","resolution":"Verify the key value is correct, or handle the case when keys might not exist in the application logic."},{"function":"sm_errstring","message_template":"Unknown database type","reason":"Returned when attempting to use an unrecognized database type (SMDBE_UNKNOWN_DB_TYPE).","resolution":"Check the configuration to ensure a valid database type is specified."},{"function":"sm_errstring","message_template":"Support for database type not compiled into this program","reason":"Returned when the specified database type is recognized but not compiled into the current build (SMDBE_UNSUPPORTED_DB_TYPE).","resolution":"Either use a supported database type or recompile the program with support for the desired database type."},{"function":"sm_errstring","message_template":"DB sync did not finish","reason":"Returned when a database synchronization operation did not complete successfully (SMDBE_INCOMPLETE).","resolution":"Check for disk space issues, I\/O errors, or interrupted operations. May need to run database recovery."},{"function":"sm_errstring","message_template":"Key is empty","reason":"Returned when attempting to use an empty key in a database operation (SMDBE_KEY_EMPTY).","resolution":"Ensure keys have valid non-empty values before using them in database operations."},{"function":"sm_errstring","message_template":"Locker killed to resolve deadlock","reason":"Returned when a database lock was forcibly released to resolve a deadlock situation (SMDBE_LOCK_DEADLOCK).","resolution":"Review the application's locking strategy to minimize deadlocks, and ensure the application can properly recover from deadlock situations."},{"function":"sm_errstring","message_template":"Lock unavailable","reason":"Returned when a requested database lock cannot be acquired (SMDBE_LOCK_NOT_GRANTED).","resolution":"Retry the operation later, implement a backoff strategy, or check for issues with long-running transactions."},{"function":"sm_errstring","message_template":"Lock not held by locker","reason":"Returned when attempting to release a lock that is not held by the requestor (SMDBE_LOCK_NOT_HELD).","resolution":"Check the application's lock management logic for errors in tracking lock ownership."},{"function":"sm_errstring","message_template":"Database panic, run recovery","reason":"Returned when a serious database inconsistency is detected (SMDBE_RUN_RECOVERY).","resolution":"Run the database recovery tool (e.g., db_recover for Berkeley DB) before attempting further operations."},{"function":"sm_errstring","message_template":"I\/O error","reason":"Returned when a database I\/O operation fails (SMDBE_IO_ERROR).","resolution":"Check disk health, file system integrity, and available space. May indicate hardware issues."},{"function":"sm_errstring","message_template":"Database opened read-only","reason":"Returned when attempting a write operation on a database opened in read-only mode (SMDBE_READ_ONLY).","resolution":"Either open the database with write permissions or modify the application to avoid write operations on this database."},{"function":"sm_errstring","message_template":"Name too long","reason":"Returned when a database name exceeds the maximum allowed length (SMDBE_DB_NAME_TOO_LONG).","resolution":"Use a shorter database name that fits within the system's path length limitations."},{"function":"sm_errstring","message_template":"Invalid parameter","reason":"Returned when an invalid parameter is passed to a database function (SMDBE_INVALID_PARAMETER).","resolution":"Check the function documentation and ensure all parameters meet the requirements."},{"function":"sm_errstring","message_template":"Only one cursor allowed","reason":"Returned when attempting to create multiple cursors in a context that only supports one (SMDBE_ONLY_SUPPORTS_ONE_CURSOR).","resolution":"Modify the application to use only one cursor at a time, or close existing cursors before opening new ones."},{"function":"sm_errstring","message_template":"Invalid cursor","reason":"Returned when attempting to use an invalid or closed database cursor (SMDBE_NOT_A_VALID_CURSOR).","resolution":"Ensure cursors are properly initialized and not used after being closed."},{"function":"sm_errstring","message_template":"Berkeley DB file is an old version, recreate it","reason":"Returned when attempting to use a Berkeley DB file created with an incompatible older version (SMDBE_OLD_VERSION).","resolution":"Dump and reload the database using the current version's utilities, or recreate the database from scratch."},{"function":"sm_errstring","message_template":"Berkeley DB version mismatch between include file and library","reason":"Returned when the Berkeley DB header files and runtime libraries have mismatched versions (SMDBE_VERSION_MISMATCH).","resolution":"Ensure consistent Berkeley DB versions in both compile-time headers and runtime libraries."},{"function":"sm_errstring","message_template":"LDAP URL can't allocate memory space","reason":"Returned when memory allocation fails during LDAP URL processing (E_LDAPURLBASE + LDAP_URL_ERR_MEM).","resolution":"Check system memory usage and availability. May need to increase available memory or optimize the application."},{"function":"sm_errstring","message_template":"LDAP URL parameter is bad","reason":"Returned when an LDAP URL contains an invalid parameter (E_LDAPURLBASE + LDAP_URL_ERR_PARAM).","resolution":"Check the LDAP URL syntax and correct any malformed parameters."},{"function":"sm_errstring","message_template":"LDAP URL doesn't begin with \"ldap[si]:\/\/\"","reason":"Returned when an LDAP URL doesn't use the correct scheme (E_LDAPURLBASE + LDAP_URL_ERR_BADSCHEME).","resolution":"Ensure LDAP URLs start with 'ldap:\/\/' or 'ldaps:\/\/' (for SSL)."},{"function":"sm_errstring","message_template":"LDAP URL is missing trailing \">\"","reason":"Returned when an LDAP URL has unbalanced enclosure characters (E_LDAPURLBASE + LDAP_URL_ERR_BADENCLOSURE).","resolution":"Check the LDAP URL syntax and ensure all opening brackets have matching closing brackets."},{"function":"sm_errstring","message_template":"LDAP URL is bad","reason":"Returned when an LDAP URL is malformed in a general way (E_LDAPURLBASE + LDAP_URL_ERR_BADURL).","resolution":"Verify the entire LDAP URL against the RFC syntax for LDAP URLs and correct any formatting issues."},{"function":"sm_errstring","message_template":"LDAP URL host port is bad","reason":"Returned when an LDAP URL contains an invalid host or port specification (E_LDAPURLBASE + LDAP_URL_ERR_BADHOST).","resolution":"Check the hostname and port number in the LDAP URL. Ensure the port is a valid number and the hostname is correctly formatted."},{"function":"sm_errstring","message_template":"LDAP URL bad (or missing) attributes","reason":"Returned when an LDAP URL has invalid attribute specifications (E_LDAPURLBASE + LDAP_URL_ERR_BADATTRS).","resolution":"Check the attribute section of the LDAP URL. Ensure attribute names are valid and correctly formatted."},{"function":"sm_errstring","message_template":"LDAP URL scope string is invalid (or missing)","reason":"Returned when an LDAP URL has an invalid search scope (E_LDAPURLBASE + LDAP_URL_ERR_BADSCOPE).","resolution":"Ensure the scope in the LDAP URL is one of the valid values: 'base', 'one', or 'sub'."},{"function":"sm_errstring","message_template":"LDAP URL bad or missing filter","reason":"Returned when an LDAP URL has an invalid search filter (E_LDAPURLBASE + LDAP_URL_ERR_BADFILTER).","resolution":"Check the filter syntax in the LDAP URL and ensure it follows the LDAP filter rules."},{"function":"sm_errstring","message_template":"LDAP URL bad or missing extensions","reason":"Returned when an LDAP URL has invalid extensions (E_LDAPURLBASE + LDAP_URL_ERR_BADEXTS).","resolution":"Verify the extensions section of the LDAP URL and ensure it follows the correct format."},{"function":"sm_errstring","message_template":"LDAP URL doesn't begin with \"ldap:\/\/\"","reason":"Returned when an LDAP URL doesn't start with the expected scheme (Sun LDAP library variant) (E_LDAPURLBASE + LDAP_URL_ERR_NOTLDAP).","resolution":"Ensure LDAP URLs start with 'ldap:\/\/'. Note that this error is specific to the Sun LDAP library which may not support 'ldaps:\/\/'."},{"function":"sm_errstring","message_template":"LDAP URL has no DN (required)","reason":"Returned when an LDAP URL is missing the required Distinguished Name (E_LDAPURLBASE + LDAP_URL_ERR_NODN).","resolution":"Add a valid Distinguished Name (DN) to the LDAP URL. This is required by some LDAP implementations."},{"function":"sm_errstring","message_template":"Error %d","reason":"Returned as a fallback when an unknown error code is encountered.","resolution":"Look up the specific error code in the system documentation or source code to determine the cause and appropriate resolution."}]}