{"project":"sendmail","module":"libsm\/fopen.c","summary":"This module provides file I\/O functions with timeout capabilities, resource pooling, and duplicating file pointers. It implements core file operations such as open, reopen, dup, auto-flush, and auto-mode setting, with sophisticated error handling and timeout mechanisms.","logs":[{"function":"sm_io_open","message_template":"Invalid flags","reason":"The function returns NULL with EINVAL when invalid or no flags are provided for file opening.","resolution":"Check the flags parameter passed to sm_io_open to ensure valid file access modes are specified."},{"function":"sm_io_open","message_template":"Operation timed out","reason":"The function returns NULL with EAGAIN when the open operation times out or when immediate timeout is requested.","resolution":"Check if the file system is responsive or increase the timeout value if operations are legitimately taking longer than expected."},{"function":"sm_io_dup","message_template":"Invalid file pointer","reason":"The function returns NULL with EBADF when an invalid file pointer is provided.","resolution":"Verify that the file pointer passed to sm_io_dup is valid and hasn't been previously closed."},{"function":"sm_io_dup","message_template":"Too many open files","reason":"The function returns NULL with EMFILE when the duplicate counter reaches its maximum limit.","resolution":"Reduce the number of file duplications or close unnecessary file handles to free up resources."},{"function":"sm_io_reopen","message_template":"Invalid flags","reason":"The function fails when invalid flags are provided for reopening a file.","resolution":"Check the flags parameter passed to sm_io_reopen to ensure valid file access modes are specified."},{"function":"sm_io_reopen","message_template":"Operation timed out","reason":"The function returns NULL with EAGAIN when the reopen operation times out or when immediate timeout is requested.","resolution":"Check if the file system is responsive or increase the timeout value if needed."},{"function":"sm_io_reopen","message_template":"re-opened","reason":"This string might appear in logs when a file is successfully reopened.","resolution":"This is likely an informational message that doesn't require resolution."},{"function":"sm_io_reopen","message_template":"\/dev\/stdin","reason":"This file path might be logged when reopening the standard input file.","resolution":"Check if redirection or access to standard input is working correctly if issues occur."}]}