{"project":"sendmail","module":"libsm\/ldap.c","summary":"This module handles LDAP operations for sendmail, providing functionality to connect to LDAP servers, perform searches, and process results. It includes connection management, timeouts, error handling, and support for both standard and URI-based LDAP connections.","logs":[{"function":"sm_ldap_setoptsg","message_template":"ldap_networktmo=%d\n","reason":"Logs when a network timeout is set for LDAP operations","resolution":"If timeouts are occurring frequently, increase the network timeout value in the LDAP configuration or check network connectivity between sendmail and the LDAP server"},{"function":"sm_ldap_setoptsg","message_template":"ldap_debug0=%d\n","reason":"Logs the initial debug level for LDAP operations","resolution":"Informational log. Adjust debug level as needed for troubleshooting"},{"function":"sm_ldap_setoptsg","message_template":"ber_set_option=%d\n","reason":"Logs the result code from setting BER options","resolution":"If non-zero, check LDAP library configuration or update LDAP client libraries"},{"function":"sm_ldap_setoptsg","message_template":"ldap_set_option=%d\n","reason":"Logs the result code from setting LDAP options","resolution":"If non-zero, check LDAP configuration parameters or update LDAP client libraries"},{"function":"sm_ldap_setopts","message_template":"ldap_debug=%d, dbg_init=%d\n","reason":"Logs the current debug level and initialization status","resolution":"Informational log. Useful for tracking debug level settings during troubleshooting"},{"function":"sm_ldap_setopts","message_template":"ldap_set_option=%d\n","reason":"Logs the result of setting session-specific LDAP options","resolution":"If non-zero, check LDAP options in configuration file or update LDAP client libraries"},{"function":"sm_ldap_setopts","message_template":"LDAP_OPT_X_TLS_CACERTFILE(%s)=%d\n","reason":"Logs the result of setting TLS CA certificate file for LDAP connections","resolution":"If return code indicates failure, check that the certificate file exists and is readable. Verify TLS configuration between sendmail and LDAP server"},{"function":"ldaptimeout","message_template":"ldap_settimeout(%s)=triggered\n","reason":"Logs when an LDAP operation timeout has been triggered","resolution":"Increase timeout values, check LDAP server load and network connectivity issues. Server might be overwhelmed or unreachable"},{"function":"sm_ldap_start","message_template":"ldapmap_start(%s)\n","reason":"Logs the start of an LDAP connection with a URI","resolution":"Informational log, no resolution required unless followed by errors"},{"function":"sm_ldap_start","message_template":"ldapmap_start(%s, %d)\n","reason":"Logs the start of an LDAP connection with a host and port","resolution":"Informational log, no resolution required unless followed by errors"},{"function":"sm_ldap_start","message_template":"ldap_initialize(%s)\n","reason":"Logs when initializing a connection to an LDAP URI","resolution":"Informational log, no resolution required unless followed by errors"},{"function":"sm_ldap_start","message_template":"ldap_initialize(%s)=%d, ld=%p\n","reason":"Logs the result of initializing an LDAP connection with a URI","resolution":"If result code is non-zero, check URI syntax, LDAP server availability, and network connectivity"},{"function":"sm_ldap_start","message_template":"ldap_init(%s, %d)\n","reason":"Logs when initializing a connection to an LDAP host and port","resolution":"Informational log, no resolution required unless followed by errors"},{"function":"sm_ldap_start","message_template":"ldap_open(%s, %d)\n","reason":"Logs when opening a connection to an LDAP server","resolution":"Informational log, no resolution required unless followed by errors"},{"function":"sm_ldap_start","message_template":"FAIL: ldap_open(%s, %d)=%d\n","reason":"Logs when opening a connection to an LDAP server fails","resolution":"Check that the LDAP server is running at the specified host and port. Verify network connectivity and firewall settings between sendmail and LDAP server"},{"function":"sm_ldap_start","message_template":"ldap_bind(%s)\n","reason":"Logs when binding to an LDAP server","resolution":"Informational log, no resolution required unless followed by errors"},{"function":"sm_ldap_start","message_template":"ldap_bind(%s)=%d, errno=%d, ldaperr=%d, ld_error=%s, tmo=%lld\n","reason":"Logs the result of binding to an LDAP server with detailed error information","resolution":"If binding fails, check LDAP credentials, bind DN, password, and authentication method. Verify LDAP server is correctly configured to accept the specified authentication method"},{"function":"sm_ldap_start","message_template":"ldap_result(%s)=%d, errno=%d, ldaperr=%d, ld_error=%s\n","reason":"Logs the result of an LDAP operation with error details","resolution":"If result code indicates failure, look at the specific error codes. Common issues include authentication failures, network problems, or LDAP server issues"},{"function":"sm_ldap_start","message_template":"ldap_parse_result(%s)=%d, err=%d, errmsg=%s\n","reason":"Logs the parsing of an LDAP result with error details","resolution":"If parsing fails, check the specific error message. May indicate protocol errors or LDAP server issues"},{"function":"sm_ldap_start","message_template":"ldap_cleartimeout(%s)\n","reason":"Logs when clearing an LDAP operation timeout","resolution":"Informational log, no resolution required"},{"function":"sm_ldap_search_m","message_template":"ldap search filter=%s\n","reason":"Logs the LDAP search filter being used for a query","resolution":"Informational log. If search results are unexpected, examine the filter syntax for correctness"}]}