{"project":"sendmail","module":"..\/working\/sendmail\/libsm\/local.h","summary":"This header file defines the I\/O infrastructure for sendmail's libsm module, including functions for standard, string, stdio, and syslog I\/O operations. It provides macros for handling timeouts, file descriptor modes, and error conditions for stream I\/O operations.","logs":[{"function":"SM_CONVERT_TIME","message_template":"Error retrieving file descriptor or setting file mode","reason":"The macro returns SM_IO_EOF when it fails to retrieve a file descriptor or set the file mode (blocking\/non-blocking). This would likely occur when file operations fail.","resolution":"Check file system permissions and availability. Ensure the file descriptor is valid and that the application has appropriate permissions to modify file attributes."},{"function":"SM_IO_WR_TIMEOUT","message_template":"Write operation timed out","reason":"The macro sets errno to EAGAIN and returns SM_IO_EOF when a write operation times out. This occurs when the system cannot write to a file within the specified timeout period.","resolution":"Check for system resource constraints, disk space issues, or network connectivity problems if writing to a remote file system. Consider increasing the timeout value or optimizing write operations."},{"function":"SM_IO_WR_TIMEOUT","message_template":"Invalid file descriptor for select","reason":"The macro sets errno to EINVAL and returns SM_IO_EOF when it detects an invalid file descriptor for the select() call. This happens when trying to perform I\/O operations on an invalid file handle.","resolution":"Verify that the file is properly opened before attempting write operations. Check for any previous calls that might have closed the file descriptor."},{"function":"SM_IO_WR_TIMEOUT","message_template":"Error during select operation","reason":"The macro returns SM_IO_EOF when select() fails with an error other than EINTR. This indicates a system-level problem with the select() call.","resolution":"Check system resource limits, maximum file descriptors, and system logs for additional information about the failure."},{"function":"SM_IO_WR_TIMEOUT","message_template":"Error getting time of day","reason":"The macro returns SM_IO_EOF when gettimeofday() fails, which is used to measure elapsed time for timeout calculations.","resolution":"This is a rare system-level error. Check system time configuration and consider restarting the service if the issue persists."}]}