{"project":"sendmail","module":"libsm\/mbdb.c","summary":"This module provides a unified interface for accessing mailbox database information. It allows for different backends to be used (pw and LDAP backends are implemented), providing a consistent API for user lookup operations needed by the mail system.","logs":[{"function":"sm_mbdb_initialize","message_template":"EX_UNAVAILABLE returned when mailbox database type not found","reason":"The specified mailbox database type was not found in the available types. This occurs when trying to use a database backend that is not implemented.","resolution":"Check the configuration and ensure the mailbox database type specified is one of the available types (pw or ldap if implemented). Verify the spelling and format of the database specifier."},{"function":"sm_mbdb_lookup","message_template":"EX_NOUSER returned when user not found","reason":"The requested user was not found in the mailbox database. This typically happens when attempting to deliver mail to a non-existent user.","resolution":"Verify the user exists in the system. If the user should exist, check the database configuration and ensure the user is properly registered in the underlying database system."},{"function":"sm_mbdb_lookup","message_template":"EX_TEMPFAIL returned for temporary failures","reason":"A temporary failure occurred when looking up a user. This might be due to network issues when using LDAP or other resource availability problems.","resolution":"This is typically a transient error. Check network connectivity if using LDAP, verify the database server is operating correctly, and retry the operation. If the error persists, examine system logs for more specific error information."},{"function":"mbdb_ldap_lookup","message_template":"LDAP server connection errors","reason":"Unable to connect to or query the LDAP server. This could be due to network issues, server downtime, or incorrect LDAP configuration parameters.","resolution":"Verify the LDAP server is running and accessible. Check network connectivity, server configuration, and authentication credentials. Ensure the LDAP filter and base DN are correctly specified."},{"function":"mbdb_ldap_lookup","message_template":"LDAP query timeout","reason":"The LDAP query timed out. This may indicate network congestion, an overloaded LDAP server, or complex queries taking too long to process.","resolution":"Increase the timeout settings if appropriate. Check the LDAP server's performance and load. Optimize the query or filter if possible. Verify network performance between the mail server and LDAP server."},{"function":"mbdb_ldap_lookup","message_template":"Memory allocation failure","reason":"Failed to allocate memory for LDAP query processing. This indicates the system is running low on memory resources.","resolution":"Check the system's memory usage and free up resources if possible. Consider increasing the available memory or reducing the load on the system. Monitor for memory leaks if this occurs frequently."}]}