{"project":"sendmail","module":"libsm\/niprop.c","summary":"This module implements NetInfo property value lookup functionality for sendmail on macOS systems. It provides a function to retrieve property values from NetInfo directories with support for multi-valued properties and hierarchical domain traversal.","logs":[{"function":"ni_propval","message_template":"ni_propval(%s, %s, %s, %s, %d) keybuf='%s'","reason":"Debug message showing the input parameters and constructed key buffer for NetInfo lookup. Currently disabled in the code.","resolution":"This is a diagnostic message which would be useful for debugging NetInfo lookup issues. No resolution required as it's informational."},{"function":"ni_propval","message_template":"ni_open(LOCAL) = %d","reason":"Debug message showing the status code returned from opening the local NetInfo domain. Currently disabled in the code.","resolution":"If enabled and showing a non-zero value, it would indicate a failure to open the local NetInfo domain. Check NetInfo server status and connectivity."},{"function":"ni_propval","message_template":"ni_open(PARENT) = %d","reason":"Debug message showing the status code returned from opening the parent NetInfo domain. Currently disabled in the code.","resolution":"If enabled and showing a non-zero value, it would indicate a failure to traverse up the NetInfo hierarchy. Check NetInfo server configuration and network connectivity."},{"function":"ni_propval","message_template":"ni_lookupprop: len=%d","reason":"Debug message showing the number of values found for the requested property. Currently disabled in the code.","resolution":"This is a diagnostic message that would show the number of values returned. A value of 0 might indicate the property doesn't exist in this domain."},{"function":"ni_propval","message_template":"ni_propval returns: '%s'","reason":"Debug message showing the final string value being returned by the function. Currently disabled in the code.","resolution":"This is a diagnostic message showing the final result. If showing NULL or unexpected values, check that the property exists and has the expected value in NetInfo."}]}