{"project":"sendmail","module":"..\/working\/sendmail\/libsm\/notify.h","summary":"This header file defines macros and constants for handling network strings (netstrings) in the sendmail libsm module. It provides debugging functionality through the SM_DBG macro and implements the RDNETSTR macro for reading network strings with extensive error checking and debugging.","logs":[{"function":"RDNETSTR macro","message_template":"pid=%ld, select=%d, e=%d\n","reason":"Logs when the select operation fails or times out during netstring reading. This typically occurs when there's no data available to read within the timeout period.","resolution":"Check if the sender is still connected and sending data. Verify network connectivity and increase timeout values if dealing with slow connections."},{"function":"RDNETSTR macro","message_template":"pid=%ld, fd=%d, isset=false\n","reason":"Logs when the file descriptor isn't set in the readfds set after select returns. This indicates an inconsistency in the select operation.","resolution":"This may indicate a race condition or file descriptor management issue. Review the file descriptor handling logic in the application."},{"function":"RDNETSTR macro","message_template":"pid=%ld, fd=%d, read1=EOF, e=%d\n","reason":"Logs when the first read operation returns EOF (End Of File), indicating the connection was closed by the peer.","resolution":"This can be normal if the client disconnected. If unexpected, check if the client application is terminating connections properly and investigate network issues."},{"function":"RDNETSTR macro","message_template":"pid=%ld, fd=%d, read1=%d, e=%d\n","reason":"Logs when the first read doesn't get the expected number of bytes (NETSTRPRE) for the netstring prefix.","resolution":"This indicates incomplete data transmission. Check if the sender is properly formatting netstrings and ensure there are no network fragmentation issues."},{"function":"RDNETSTR macro","message_template":"pid=%ld, scanf, e=%d\n","reason":"Logs when sscanf fails to parse the netstring length from the prefix. This indicates malformed netstring data.","resolution":"Verify that the sending application is correctly formatting netstrings with a numeric length followed by a colon. Debug the data format being sent."},{"function":"RDNETSTR macro","message_template":"pid=%ld, 1: len=%d\n","reason":"Logs when the parsed netstring length exceeds MAX_NETSTR (1024), which is a safety limit to prevent buffer overflow.","resolution":"Either increase MAX_NETSTR if larger netstrings are expected and safe, or modify the sending application to break large data into smaller netstrings."},{"function":"RDNETSTR macro","message_template":"pid=%ld, 2: len=%d\n","reason":"Logs when the netstring length exceeds the available buffer size, which would cause a buffer overflow if the read proceeded.","resolution":"Increase the buffer size allocated for receiving netstrings or modify the sending application to use smaller netstrings."},{"function":"RDNETSTR macro","message_template":"pid=%ld, 3: len=%d\n","reason":"Logs when the parsed netstring length is invalid (less than or equal to zero), indicating malformed data.","resolution":"Check the sending application to ensure it's creating valid netstrings with positive lengths. Debug the data format being transmitted."},{"function":"RDNETSTR macro","message_template":"pid=%ld, fd=%d, read=%d, len=%d, e=%d\n","reason":"Logs after attempting to read the netstring data, showing the actual bytes read and expected length.","resolution":"This is primarily an informational log for debugging. If values don't match expected patterns, check for network reliability issues or sender implementation problems."},{"function":"RDNETSTR macro","message_template":"pid=%ld, fd=%d, read2=%d, e=%d\n","reason":"Logs when the second read (for netstring content) returns 0, indicating an unexpected EOF during data transfer.","resolution":"This indicates connection closure during data transfer. Check if the sender is terminating connections prematurely or if network issues are causing disconnects."},{"function":"RDNETSTR macro","message_template":"pid=%ld, fd=%d, read3=%d, e=%d\n","reason":"Logs when the read operation for netstring content returns an error (negative value).","resolution":"Check the error code (e) for specific issues. Common problems include ECONNRESET (connection reset), EAGAIN (would block), or EBADF (bad file descriptor). Resolve based on the specific error."},{"function":"RDNETSTR macro","message_template":"pid=%ld, fd=%d, read4=%d, len=%d\n","reason":"Logs when the read operation returns a different number of bytes than expected for the netstring, indicating partial data transfer.","resolution":"This may indicate network issues causing data fragmentation. Consider implementing retry logic or a more robust protocol for handling partial reads."},{"function":"RDNETSTR macro","message_template":"pid=%ld, fd=%d, read5=%d, f=%d\n","reason":"Logs when the netstring terminator character is not a comma as required by the netstring format, indicating protocol violation.","resolution":"Verify that the sending application is correctly formatting netstrings with a comma terminator. Debug the protocol implementation in the sender."}]}