{"project":"sendmail","module":"..\/working\/sendmail\/libsm\/refill.c","summary":"The refill.c module provides buffer refilling functionality for Sendmail's I\/O operations. It handles timed reads with timeout management, buffer management, and error detection for the libsm I\/O system.","logs":[{"function":"SM_IO_RD_TIMEOUT","message_template":"EAGAIN errno set for immediate timeout","reason":"The macro immediately returns with EAGAIN error when a timeout value of SM_TIME_IMMEDIATE is provided, indicating that the operation would block but immediate response was requested.","resolution":"Adjust the timeout value to allow sufficient time for the operation to complete, or handle the EAGAIN error appropriately in the calling code."},{"function":"SM_IO_RD_TIMEOUT","message_template":"EINVAL errno set for invalid file descriptor","reason":"The macro sets errno to EINVAL when the file descriptor is not suitable for select() operation.","resolution":"Check that the file descriptor is valid and properly initialized before attempting I\/O operations. Ensure the file has been opened correctly."},{"function":"SM_IO_RD_TIMEOUT","message_template":"Select error with specific errno set","reason":"The select() call failed with an error other than EINTR, indicating a serious system-level issue with monitoring the file descriptor.","resolution":"Check system resources, file descriptor limits, and permissions. The specific errno value will provide more details about the exact cause."},{"function":"SM_IO_RD_TIMEOUT","message_template":"EAGAIN errno set for timeout","reason":"The select() call timed out waiting for the file descriptor to become readable, indicating a possible network or device issue.","resolution":"Increase the timeout value, check the connectivity to the resource, or verify that the remote end is responding properly."},{"function":"sm_refill","message_template":"EAGAIN errno set for immediate timeout","reason":"The function immediately returns with EAGAIN error when a timeout value of SM_TIME_IMMEDIATE is provided, indicating that filling the buffer would block but immediate response was requested.","resolution":"Use a longer timeout value if you need the operation to complete, or handle the timeout condition appropriately in the application logic."},{"function":"sm_refill","message_template":"EBADF errno set for invalid file access","reason":"Attempted to read from a file that wasn't opened for reading or had invalid permissions.","resolution":"Ensure the file was opened with appropriate read permissions and that the file handle is valid. Check file open flags and access modes."},{"function":"sm_refill","message_template":"EOF detection","reason":"The underlying read operation returned zero bytes read with no error, indicating end-of-file was reached.","resolution":"This is often not an error condition but normal behavior when reaching the end of a file. Application should handle EOF appropriately based on context."},{"function":"sm_refill","message_template":"Read error with SMERR flag set","reason":"The underlying read operation failed with an error, which could be due to various system issues like disk errors, interrupted system calls, or network failures.","resolution":"Check the specific errno value for details. Depending on the error, solutions might include retrying the operation, checking disk space, verifying network connectivity, or handling interrupted system calls."}]}