{"project":"sendmail","module":"libsm\/strdup.c","summary":"This module provides string duplication functions for the Sendmail library, offering various options for memory allocation including exception handling for out-of-memory conditions. It contains specialized variants for different use cases such as fixed-length duplication, tagged memory allocation, and permanent memory storage.","logs":[{"function":"sm_strndup_x","message_template":"Out of memory exception in sm_malloc_x","reason":"Function raises an exception when memory allocation fails while attempting to duplicate a string of a given length.","resolution":"Increase available system memory or modify the application to use less memory. Check for memory leaks that could be consuming available resources."},{"function":"sm_strdup","message_template":"sm_strdup","reason":"This tag may appear in memory allocation logs or dumps when the function allocates memory for string duplication.","resolution":"This is an informational tag for memory tracking, but if it appears frequently in memory dumps, consider reviewing the application's memory usage patterns."},{"function":"sm_strdup_x","message_template":"sm_strdup_x","reason":"This tag may appear in memory allocation logs or dumps when the function allocates memory for string duplication with exception handling.","resolution":"This is an informational tag for memory tracking, but if it appears frequently in memory dumps, consider reviewing the application's memory usage patterns."},{"function":"sm_strdup_x","message_template":"Out of memory exception in sm_malloc_tagged_x","reason":"Function raises an exception when memory allocation fails while attempting to duplicate a string.","resolution":"Increase available system memory or modify the application to use less memory. Check for memory leaks that could be consuming available resources."},{"function":"sm_pstrdup_x","message_template":"Out of memory exception in sm_pmalloc_x","reason":"Function raises an exception when permanent memory allocation fails while attempting to duplicate a string.","resolution":"Increase available system memory or modify the application to use less memory. The 'permanent' allocation suggests this memory is intended to last for the application's lifetime, so check long-running processes for memory growth issues."},{"function":"sm_strdup_tagged_x","message_template":"Out of memory exception in sm_malloc_tagged_x","reason":"Function raises an exception when memory allocation fails while attempting to duplicate a string with tagging information.","resolution":"Increase available system memory or modify the application to use less memory. The tagging parameters can help identify which part of the application is consuming memory."}]}