{"project":"sendmail","module":"..\/working\/sendmail\/libsm\/strexit.c","summary":"This module provides functions for converting system exit codes (EX_*) into human-readable message strings with SMTP error codes. It serves as a translation layer between numeric exit status codes and meaningful error messages that can be used in responses or logs.","logs":[{"function":"sm_strexit","message_template":"Unknown exit status %d","reason":"Generated when an unrecognized exit code is provided to the function. This indicates that sendmail encountered an exit status it doesn't have a mapping for.","resolution":"Investigate what process generated this exit code. This is likely due to a custom or non-standard exit code being used, or potentially a bug in the code assigning exit status values."},{"function":"sm_sysexmsg","message_template":"Command line usage error","reason":"Returned for EX_USAGE, indicating improper command syntax or invalid command-line arguments.","resolution":"Check the command-line arguments provided to the sendmail process. Review documentation for correct usage or check the script\/program that invoked sendmail with incorrect parameters."},{"function":"sm_sysexmsg","message_template":"Data format error","reason":"Returned for EX_DATAERR, indicating input data was incorrect in some way.","resolution":"Verify the format of input data provided to sendmail. This could be related to malformed email content, configuration files, or other input formats."},{"function":"sm_sysexmsg","message_template":"Cannot open input","reason":"Returned for EX_NOINPUT, indicating a required input file did not exist or was not readable.","resolution":"Check file permissions and verify that the input file exists at the expected location. Ensure the sendmail process has appropriate read access to the file."},{"function":"sm_sysexmsg","message_template":"User unknown","reason":"Returned for EX_NOUSER, indicating the specified user does not exist in the system or mail alias database.","resolution":"Verify that the recipient email address is correct. Check that the user exists in the system if it's a local address, or check alias configurations if it's a mail alias."},{"function":"sm_sysexmsg","message_template":"Host unknown","reason":"Returned for EX_NOHOST, indicating the specified host or domain could not be found or resolved.","resolution":"Check DNS settings and network connectivity. Verify that the domain in the email address is spelled correctly and exists. May require checking DNS server configuration."},{"function":"sm_sysexmsg","message_template":"Service unavailable","reason":"Returned for EX_UNAVAILABLE, indicating the requested service is not available or is in a state that prevents it from functioning.","resolution":"Check if the mail service is running properly. This could indicate resource constraints, maintenance mode, or other service issues. Restart the mail service if necessary."},{"function":"sm_sysexmsg","message_template":"Internal error","reason":"Returned for EX_SOFTWARE, indicating an internal software error that is not related to the system environment.","resolution":"This suggests a bug in sendmail or a related component. Check sendmail logs for more details, consider updating to the latest version, or report the issue to the sendmail maintainers if it persists."},{"function":"sm_sysexmsg","message_template":"Operating system error","reason":"Returned for EX_OSERR, indicating a problem with the operating system rather than the mail software.","resolution":"Check system resources (memory, disk space), system logs for OS-level errors, and possibly reboot the system if it's in an unstable state. May require system administration intervention."},{"function":"sm_sysexmsg","message_template":"System file missing","reason":"Returned for EX_OSFILE, indicating a critical system file required by sendmail is missing.","resolution":"Verify sendmail installation is complete and not corrupted. The missing file should be identified in other log messages. Consider reinstalling sendmail or restoring the missing file from backups."},{"function":"sm_sysexmsg","message_template":"Can't create output","reason":"Returned for EX_CANTCREAT, indicating sendmail was unable to create necessary output files.","resolution":"Check file system permissions and available disk space. Ensure the sendmail process has write access to the required directories. May also indicate disk corruption or file system issues."},{"function":"sm_sysexmsg","message_template":"I\/O error","reason":"Returned for EX_IOERR, indicating an input\/output error occurred during processing.","resolution":"Check for hardware issues such as disk failures or network problems. I\/O errors often indicate physical hardware problems or resource exhaustion. May require system administrator attention."},{"function":"sm_sysexmsg","message_template":"Deferred","reason":"Returned for EX_TEMPFAIL, indicating the mail could not be delivered now but might succeed later.","resolution":"This is typically a temporary condition. Check for network connectivity issues, remote server availability, or local resource constraints. The system will usually retry delivery automatically."},{"function":"sm_sysexmsg","message_template":"Remote protocol error","reason":"Returned for EX_PROTOCOL, indicating a communication protocol error with a remote mail server.","resolution":"Check connectivity to the remote server and verify it's running compatible protocols. May indicate version mismatches, misconfigured remote servers, or network issues affecting protocol handshakes."},{"function":"sm_sysexmsg","message_template":"Insufficient permission","reason":"Returned for EX_NOPERM, indicating the sendmail process lacks necessary permissions for an operation.","resolution":"Check file and directory permissions related to mail operation. Ensure sendmail is running with appropriate user privileges. May require adjusting file permissions or running sendmail with different credentials."},{"function":"sm_sysexmsg","message_template":"Local configuration error","reason":"Returned for EX_CONFIG, indicating a problem with the local sendmail configuration.","resolution":"Review sendmail configuration files for syntax errors or logical inconsistencies. Check for recent changes to configuration that might have introduced errors. Consider restoring from a known good configuration backup."}]}