{"project":"sendmail","module":"libsm\/strio.c","summary":"This module implements a string I\/O system that allows reading and writing to strings in memory using file-like interfaces. It provides functions for opening, reading, writing, seeking, and closing string-based file handles with different access modes.","logs":[{"function":"sm_strread","message_template":"Unable to read from string: file not opened for reading","reason":"Attempt to read from a string file that wasn't opened with read permission (SMRD or SMRW flags). The function sets errno to EBADF.","resolution":"Make sure the string file is opened with appropriate read permissions using SM_IO_RDONLY or SM_IO_RDWR flags."},{"function":"sm_strwrite","message_template":"Unable to write to string: file not opened for writing","reason":"Attempt to write to a string file that wasn't opened with write permission (SMWR or SMRW flags). The function sets errno to EBADF.","resolution":"Make sure the string file is opened with appropriate write permissions using SM_IO_WRONLY or SM_IO_RDWR flags."},{"function":"sm_strseek","message_template":"Invalid whence parameter in seek operation","reason":"The 'whence' parameter provided to the seek operation is not one of the valid values (SM_IO_SEEK_SET, SM_IO_SEEK_CUR, SM_IO_SEEK_END). The function sets errno to EINVAL.","resolution":"Use only the valid seek modes defined by the SM_IO constants when performing seek operations on string files."},{"function":"sm_strseek","message_template":"Failed to grow string buffer during seek operation","reason":"A seek operation required growing the string buffer, but memory allocation failed. This typically happens when system is low on memory.","resolution":"Check system memory resources and consider implementing memory limit handling in the application."},{"function":"sm_stropen","message_template":"Invalid flags parameter for string file open","reason":"The flags parameter provided to sm_stropen is not one of the valid values (SM_IO_RDWR, SM_IO_RDONLY, SM_IO_WRONLY). Append mode is explicitly rejected. The function sets errno to EINVAL.","resolution":"Use only the valid mode flags defined by the SM_IO constants when opening string files."},{"function":"sm_stropen","message_template":"Memory allocation failed during string file open","reason":"Failed to allocate memory for the string file cookie or the initial string content. This typically happens when system is low on memory.","resolution":"Check system memory resources and consider implementing memory limit handling in the application."},{"function":"sm_strsetmode","message_template":"Invalid mode parameter for string file mode setting","reason":"The mode parameter provided to sm_strsetmode is not one of the valid values (SM_IO_RDWR, SM_IO_RDONLY, SM_IO_WRONLY). Append mode is explicitly rejected. The function sets errno to EINVAL.","resolution":"Use only the valid mode flags defined by the SM_IO constants when setting string file modes."},{"function":"sm_strgetmode","message_template":"Invalid current mode in string file","reason":"The string file's current mode flags don't match any of the expected patterns (SMRW, SMRD, SMWR). This suggests internal corruption of the file handle. The function sets errno to EINVAL.","resolution":"This indicates a possible internal error in the string I\/O system. The application may need to reinitialize the file handle or report a bug."},{"function":"sm_strsetinfo","message_template":"Invalid what parameter for string file info setting","reason":"The 'what' parameter provided to sm_strsetinfo is not SM_IO_WHAT_MODE (the only supported value). The function sets errno to EINVAL.","resolution":"Only use SM_IO_WHAT_MODE when calling sm_strsetinfo, as other operations are not supported."},{"function":"sm_strgetinfo","message_template":"Invalid what parameter for string file info retrieval","reason":"The 'what' parameter provided to sm_strgetinfo is not SM_IO_WHAT_MODE (the only supported value). The function sets errno to EINVAL.","resolution":"Only use SM_IO_WHAT_MODE when calling sm_strgetinfo, as other operations are not supported."}]}