{"project":"sendmail","module":"syslogio.c","summary":"This module provides an interface for sendmail to write messages to the system log (syslog). It implements file operations for a syslog file type where each line of output is written as a separate syslog message. Reading and seeking are intentionally disabled with appropriate error codes.","logs":[{"function":"sm_syslogwrite","message_template":"%s","reason":"Writes the provided buffer content to syslog with the priority level stored in the file pointer. This is the core logging functionality that allows sendmail to emit messages to syslog.","resolution":"This is the normal syslog writing mechanism, not an error. If problematic messages appear in logs, check the content being passed to this function from elsewhere in the application."},{"function":"sm_syslogread","message_template":"stub","reason":"Sets errno to ENODEV when attempting to read from a syslog file type, which is an unsupported operation. The syslog interface is write-only.","resolution":"This is an expected error when attempting to read from syslog. Application code should not attempt to read from syslog file handles."},{"function":"sm_syslogseek","message_template":"stub","reason":"Sets errno to ENODEV when attempting to seek within a syslog file type, which is an unsupported operation. The syslog interface doesn't support positioning.","resolution":"This is an expected error when attempting to seek in a syslog file. Application code should not attempt to seek within syslog file handles."},{"function":"sm_syslogsetinfo","message_template":"EINVAL error","reason":"Sets errno to EINVAL when attempting to set an unsupported information type for a syslog file pointer. Only SM_IO_SL_PRIO is supported.","resolution":"Check that the code is only setting the priority (SM_IO_SL_PRIO) information type for syslog file pointers."},{"function":"sm_sysloggetinfo","message_template":"EINVAL error","reason":"Sets errno to EINVAL when attempting to get an unsupported information type from a syslog file pointer. Only SM_IO_SL_PRIO is supported.","resolution":"Check that the code is only requesting the priority (SM_IO_SL_PRIO) information type from syslog file pointers."}]}