{"project":"sendmail","module":"..\/working\/sendmail\/libsm\/t-notify.c","summary":"This module is a test harness for the notification functionality in sendmail. It tests both notification writing and reading operations by spawning multiple processes, sending messages, and validating their reception, with configurable verbosity and process\/message counts.","logs":[{"function":"notify_wr","message_template":"sm_notify_start failed","reason":"Logs an error when the notification system fails to start in write mode. This could happen due to insufficient permissions, system resource limitations, or incorrect configuration.","resolution":"Check system permissions, available resources, and notification system configuration. Verify that the notification subsystem is properly installed and accessible."},{"function":"validpid","message_template":"pid=%ld not found, nproc=%d\n","reason":"Logs a debug message when a process ID is not found in the tracked process list. This indicates a potential synchronization issue in the test harness.","resolution":"This is primarily diagnostic information for the test. If occurring frequently, review the process creation and tracking logic in the test code."},{"function":"notify_rd","message_template":"sm_notify_start failed","reason":"Logs an error when the notification system fails to start in read mode. Similar to the write mode failure, this could happen due to system-level issues.","resolution":"Check system permissions, available resources, and notification system configuration. Ensure that no other process is already using the notification facility."},{"function":"notify_rd","message_template":"pid=%ld, rcv=%d, i=%d\n","reason":"Logs an error when notification receiving fails. The rcv value indicates the error code, which helps diagnose the specific failure.","resolution":"Check the error code returned (rcv parameter) and address the specific issue. This could be a timeout, buffer problem, or connection issue with the notification system."},{"function":"notify_rd","message_template":"pid=%ld, buf=\"%s\", i=%d\n","reason":"Logs debug information about a received notification message, showing the process ID, message content, and message counter.","resolution":"This is an informational message for debugging. No resolution required unless the displayed values indicate unexpected behavior."},{"function":"main","message_template":"-%c: must be >0\n","reason":"Logs an error when the -n (number of messages) command-line parameter is less than 1. The test requires at least one message to be processed.","resolution":"Provide a positive value for the -n parameter when running the test program. The parameter must be at least 1."},{"function":"main","message_template":"-%c: must be <%d\n","reason":"Logs an error when the -n (number of messages) command-line parameter is too large. The test has a maximum limit defined by MAX_MSGS.","resolution":"Provide a smaller value for the -n parameter that is less than the MAX_MSGS limit (defined as 1024 in the code)."},{"function":"main","message_template":"-%c: must be >0\n","reason":"Logs an error when the -p (number of processes) command-line parameter is less than 1. The test requires at least one process to run.","resolution":"Provide a positive value for the -p parameter when running the test program. The parameter must be at least 1."},{"function":"main","message_template":"-%c: must be <%d\n","reason":"Logs an error when the -p (number of processes) command-line parameter is too large. The test has a maximum limit defined by MAX_CHILDREN.","resolution":"Provide a smaller value for the -p parameter that is less than the MAX_CHILDREN limit (defined as 256 in the code)."},{"function":"main","message_template":"test notify","reason":"Indicates the start of the notification testing framework. This message serves as the test name for the testing framework.","resolution":"This is an informational message. No resolution required."},{"function":"main","message_template":"sm_notify_init failed\n","reason":"Logs an error when the notification system initialization fails. This is a critical error preventing the test from proceeding.","resolution":"Check system permissions and resources. Ensure the notification subsystem is correctly installed and configured. Look at the preceding error message (from perror) for more specific details about the failure cause."},{"function":"main","message_template":"fork failed\n","reason":"Logs an error when creating child processes fails. This likely indicates system resource limitations, particularly if a large number of processes are requested.","resolution":"Check system limits for process creation (ulimit settings). Consider reducing the number of processes requested with the -p parameter. Review system logs for resource limitations."},{"function":"main","message_template":"SKIPPED: no _FFR_DMTRIGGER || _FFR_NOTIFY\n","reason":"Logs a message when the test is skipped because the required feature flags (_FFR_DMTRIGGER or _FFR_NOTIFY) are not enabled in the build.","resolution":"Recompile sendmail with the required feature flags enabled if you need to run this test. This is a build configuration issue rather than a runtime error."}]}