{"project":"sendmail","module":"..\/working\/sendmail\/libsm\/t-qic.c","summary":"This module tests the quoting and dequoting of internal characters in strings, providing functionality to ensure proper character encoding and decoding. It contains test cases for various character combinations including special and control characters to verify correct behavior of the quote_internal_chars and dequote_internal_chars functions.","logs":[{"function":"show_diff","message_template":"i=%d, s1[]=%u, s2[]=%u\n","reason":"Displays the index and character code values where two strings differ during testing, helping to diagnose character encoding\/decoding issues","resolution":"This is a diagnostic message for testing; when seen in test output, it indicates a character mismatch. Review the specific character codes to understand why string comparison failed."},{"function":"quote_unquote","message_template":"in: %s\n","reason":"Shows the input string that was used in the quote\/unquote test when a test fails","resolution":"This is a diagnostic message that appears when a test fails. Compare with the output string to identify encoding\/decoding issues."},{"function":"quote_unquote","message_template":"out:%s\n","reason":"Shows the output string after quoting\/dequoting operations when a test fails","resolution":"This is a diagnostic message that shows the result after processing. Compare with the input and expected output to identify where the quoting\/dequoting process failed."},{"function":"quote_unquote","message_template":"cmp=%d\n","reason":"Displays the string comparison result (0 if strings match, non-zero otherwise) when a test fails","resolution":"A non-zero value indicates a mismatch between the expected and actual results. Check the input and output strings to identify the issue."},{"function":"quote_unquote","message_template":"%s -> ","reason":"Displays the input string in verbose mode before showing the output string","resolution":"This is an informational message when verbose testing is enabled. No resolution needed."},{"function":"quote_unquote","message_template":"%s\n","reason":"Displays the output string in verbose mode after quoting operations","resolution":"This is an informational message when verbose testing is enabled. No resolution needed."},{"function":"main","message_template":"got: %s\n","reason":"Shows the actual result string when a test comparing arrays fails","resolution":"Compare with the expected output to identify where quoting\/dequoting functionality may be failing. This helps diagnose issues with character handling."},{"function":"main","message_template":"exp:%s\n","reason":"Shows the expected result string when a test comparing arrays fails","resolution":"Compare with the actual output to identify discrepancies. This helps verify that the quoting\/dequoting functions are working as expected."}]}