{"project":"sendmail","module":"..\/working\/sendmail\/libsm\/t-rpool.c","summary":"This module tests the resource pool (rpool) functionality of the Sendmail library, validating memory allocation, attachment callbacks, and proper memory cleanup. It includes debug features to report on heap state before and after resource pool operations.","logs":[{"function":"rfree","message_template":"rfree freeing `%s'\n","reason":"Callback notification when an attachment is being freed from the resource pool. This helps track resource cleanup during testing.","resolution":"This is an informational message used for debugging. No resolution required as it's part of the test infrastructure."},{"function":"main","message_template":"test rpool","reason":"Initializes the test framework for the resource pool functionality. This marks the beginning of the test sequence.","resolution":"This is an informational message for test initialization. No resolution required."},{"function":"main","message_template":"sm_check_heap","reason":"Enables heap checking during testing to detect memory leaks or corruption in the resource pool implementation.","resolution":"This is a debug setting, not an error. It's used to ensure proper memory management during testing."},{"function":"main","message_template":"attachment #1","reason":"Test data label for the first attachment added to the resource pool for testing the attachment mechanism.","resolution":"This is test data, not an error message. No resolution required."},{"function":"main","message_template":"attachment #2","reason":"Test data label for the second attachment added to the resource pool.","resolution":"This is test data, not an error message. No resolution required."},{"function":"main","message_template":"attachment #3","reason":"Test data label for the third attachment added to the resource pool.","resolution":"This is test data, not an error message. No resolution required."},{"function":"main","message_template":"heap after filling up rpool:\n","reason":"Debug message indicating a heap report will follow after filling the resource pool with allocations, to verify proper memory usage.","resolution":"This is a debug marker for heap reporting. Used for development and not an error that requires resolution."},{"function":"main","message_template":"freeing rpool:\n","reason":"Debug message indicating that the resource pool is about to be freed, which should release all allocated memory.","resolution":"This is a debug marker, not an error. It helps developers track the resource pool lifecycle during testing."},{"function":"main","message_template":"heap after freeing rpool:\n","reason":"Debug message indicating a heap report will follow after freeing the resource pool, to verify all memory was properly cleaned up.","resolution":"This is a debug marker for heap reporting after cleanup. If memory leaks are detected in the subsequent report, they should be addressed in the resource pool implementation."}]}