{"project":"sendmail","module":"libsm\/t-shm.c","summary":"This module tests the shared memory functionality of the sendmail library, offering interactive testing, large segment testing, and basic shared memory operation validation through a parent-child process relationship.","logs":[{"function":"shminter","message_template":"shminit failed","reason":"This error occurs when shared memory initialization fails during the interactive test. Likely due to insufficient permissions, system resource constraints, or IPC configuration issues.","resolution":"Check system IPC settings, ensure user has sufficient permissions, and verify available shared memory resources using 'ipcs' command."},{"function":"shminter","message_template":"error: %d != %d\n","reason":"Indicates a data integrity error in shared memory where the actual value doesn't match the expected value after a loop operation. Suggests possible corruption or race condition.","resolution":"Check for concurrent access issues, memory limitations, or system-level IPC problems. May require kernel parameter tuning for shared memory."},{"function":"shminter","message_template":"shmval: %d\n","reason":"Informational message displaying the current value stored in shared memory during interactive testing.","resolution":"Informational log, no resolution required."},{"function":"shminter","message_template":"sm_shmsetowner=%d\n","reason":"Displays the return value from attempting to set the owner and permissions on the shared memory segment. Non-zero values indicate failure.","resolution":"If the return value is non-zero, check user permissions and ensure the process has appropriate privileges to change ownership of shared memory segments."},{"function":"shmbig","message_template":"shminit failed","reason":"Shared memory initialization failed during large segment testing. Likely due to requesting a segment size larger than system limits or insufficient resources.","resolution":"Check system shared memory limits using 'sysctl kernel.shmmax' and adjust system parameters if needed. Alternatively, reduce the requested shared memory size."},{"function":"shmbig","message_template":"failed at %d: %d","reason":"Data verification failed at a specific index in the shared memory segment where the expected and actual values don't match.","resolution":"Check for shared memory corruption, possible race conditions, or size miscalculation. May need to adjust segment size or synchronization mechanisms."},{"function":"shmtest","message_template":"shminit failed","reason":"Shared memory initialization failed during basic testing. Could be due to permissions, resource limitations, or IPC configuration issues.","resolution":"Verify shared memory is supported and properly configured on the system. Check permissions and system resource availability."},{"function":"main","message_template":"fork failed\n","reason":"The system call to fork a child process for testing shared memory between processes failed, likely due to resource constraints.","resolution":"Check system limits on number of processes, available memory, and system load. May need to increase system resource limits or reduce system load."},{"function":"main","message_template":"add -DSM_CONF_SHM=0 to confENVDEF in devtools\/Site\/site.config.m4\nand start over.\n","reason":"Displayed when shared memory tests fail, suggesting to disable shared memory support in the build configuration.","resolution":"Follow the instructions to add the specified flag to the configuration file if shared memory testing consistently fails, or diagnose and fix the underlying shared memory issues."},{"function":"main","message_template":"No support for shared memory configured on this machine\n","reason":"Indicates that the code was compiled without shared memory support (SM_CONF_SHM not defined).","resolution":"If shared memory functionality is needed, recompile the code with SM_CONF_SHM defined or adjust system configuration to support shared memory."}]}