{"project":"sendmail","module":"..\/working\/sendmail\/libsm\/uxtext_unquote.c","summary":"This module contains functionality to decode UTF-8 encoded email addresses according to RFC 6533 standards. It implements the uxtext_unquote function which converts special escape sequences like '\\x{HEXPOINT}' into proper UTF-8 byte sequences, with various validations for code point ranges and buffer capacities.","logs":[{"function":"uxtext_unquote","message_template":"SM_REQUIRE(olen > 0)","reason":"Assertion failure when the output buffer length is not greater than zero. This indicates a programming error where insufficient buffer space was allocated.","resolution":"Ensure that the calling function provides an adequately sized output buffer with a positive length value."},{"function":"uxtext_unquote","message_template":"SM_REQUIRE(NULL != quoted)","reason":"Assertion failure when the input string pointer is NULL. This indicates a programming error where an invalid input was provided.","resolution":"Check that all inputs to uxtext_unquote are properly initialized before calling the function."},{"function":"uxtext_unquote","message_template":"return 0 - olen","reason":"Error return when the output buffer is too small to hold the decoded string. This happens if the decoded string would exceed the provided buffer length.","resolution":"Increase the size of the output buffer provided to the function. Pre-calculate the maximum possible decoded length based on the input length."},{"function":"uxtext_unquote","message_template":"return 0 - len","reason":"Error return when there is an invalid character in the Unicode escape sequence. Only hexadecimal digits (0-9, a-f, A-F) are allowed within \\x{...}.","resolution":"Check the quoted input string for malformed Unicode escape sequences and correct them according to RFC 6533 specifications."},{"function":"uxtext_unquote","message_template":"return 0 - len","reason":"Error return when a Unicode code point exceeds the maximum valid value (0x10ffff). This indicates an invalid Unicode character.","resolution":"Ensure all Unicode code points in the input string are within the valid Unicode range (0x0 to 0x10ffff)."}]}