{"project":"sendmail","module":"..\/working\/sendmail\/sendmail\/convtime.c","summary":"The convtime.c module provides time conversion functionality for sendmail, with two main functions: convtime converts time strings with units (s, m, h, d, w) to seconds, and pintvl formats time intervals into human-readable strings. These functions support timing operations throughout the mail server.","logs":[{"function":"convtime","message_template":"Invalid time unit `%c'","reason":"Logs an error when the user provides an invalid time unit character during time conversion. This occurs when the unit character is not one of 'w', 'd', 'h', 'm', or 's'.","resolution":"Check the configuration or input that specifies time values and ensure only valid time units are used (w=weeks, d=days, h=hours, m=minutes, s=seconds). Time specification strings should follow the pattern of a number followed by a valid unit."},{"function":"pintvl","message_template":"zero seconds","reason":"Returned when formatting a time interval of 0 seconds in verbose mode. This is an informational message indicating a zero-length time interval.","resolution":"This is an informational string, not an error. No resolution is required unless zero intervals are unexpected in your context."},{"function":"pintvl","message_template":"too long","reason":"Returned when formatting a time interval with the value NOW, indicating an indefinite or extremely long time interval.","resolution":"This is an informational string, not an error. Check if indefinite time intervals are appropriate in your context."},{"function":"pintvl","message_template":"%d+","reason":"Part of brief format time interval representation showing days when they are greater than zero.","resolution":"This is an informational formatting element, not an error. No resolution is required."},{"function":"pintvl","message_template":"%02d:%02d:%02d","reason":"Brief format time interval representation showing hours:minutes:seconds.","resolution":"This is an informational formatting element, not an error. No resolution is required."},{"function":"pintvl","message_template":", %d week%s","reason":"Part of verbose format time interval representation showing weeks with proper plural form.","resolution":"This is an informational formatting element, not an error. No resolution is required."},{"function":"pintvl","message_template":", %d day%s","reason":"Part of verbose format time interval representation showing days with proper plural form.","resolution":"This is an informational formatting element, not an error. No resolution is required."},{"function":"pintvl","message_template":", %d hour%s","reason":"Part of verbose format time interval representation showing hours with proper plural form.","resolution":"This is an informational formatting element, not an error. No resolution is required."},{"function":"pintvl","message_template":", %d minute%s","reason":"Part of verbose format time interval representation showing minutes with proper plural form.","resolution":"This is an informational formatting element, not an error. No resolution is required."},{"function":"pintvl","message_template":", %d second%s","reason":"Part of verbose format time interval representation showing seconds with proper plural form.","resolution":"This is an informational formatting element, not an error. No resolution is required."}]}