{"project":"sendmail","module":"daemon.c","summary":"This module handles the daemon functionality in Sendmail, including setting up sockets, accepting connections, handling client connections, and managing DNS lookups. It provides core networking functionality for the SMTP server and client connections.","logs":[{"function":"getrequests","message_template":"daemon could not open control socket %s: %s","reason":"Unable to open the control socket for the daemon process. This allows administrative commands to be sent to the daemon.","resolution":"Check file permissions and availability of the socket file. Ensure the socket path is valid and accessible."},{"function":"getrequests","message_template":"accepting connections again for daemon %s","reason":"The daemon is resuming accepting connections after a temporary suspension.","resolution":"Informational message, no resolution required."},{"function":"getrequests","message_template":"daemon process doesn't have $j in $=w; see syslog","reason":"The daemon's hostname ('$j') is not in the list of known hostnames ('$=w'). This could cause authentication and delivery issues.","resolution":"Check your hostname configuration in sendmail.cf. Ensure the hostname is properly set and recognized by the system."},{"function":"getrequests","message_template":"daemon process $j lost dot; see syslog","reason":"The daemon's fully qualified domain name has lost its domain part (the part after the dot). This affects email routing and authentication.","resolution":"Check your hostname configuration and DNS setup. Ensure the hostname is properly set with the domain part."},{"function":"getrequests","message_template":"daemon lost $j","reason":"The daemon's hostname ('$j') has been lost or corrupted. This can cause severe mail delivery issues.","resolution":"Check your hostname configuration and restart sendmail. Verify DNS resolution is working properly."},{"function":"getrequests","message_template":"rejecting new messages: min free: %ld","reason":"The daemon is rejecting new messages because the available disk space is below the minimum threshold.","resolution":"Free up disk space or adjust the MinBlocksFree parameter in the configuration file."},{"function":"getrequests","message_template":"accepting new messages (again)","reason":"The daemon is resuming accepting new messages after previously rejecting them due to disk space constraints.","resolution":"Informational message, no resolution required."},{"function":"opendaemonsocket","message_template":"daemon %s: unsafe domain socket %s","reason":"The specified UNIX domain socket is considered unsafe due to permissions or ownership issues.","resolution":"Check and correct the permissions and ownership of the socket file or directory."},{"function":"opendaemonsocket","message_template":"daemon %s: can't create server SMTP socket","reason":"Failed to create a socket for the SMTP server. This prevents the daemon from accepting connections.","resolution":"Check system resources, file descriptor limits, and network configuration. May require system restart if socket resources are exhausted."},{"function":"opendaemonsocket","message_template":"daemon %s: optional socket disabled","reason":"An optional socket for a daemon could not be created and has been disabled.","resolution":"If this socket is needed, check the specific error messages to identify and fix the underlying issue."},{"function":"opendaemonsocket","message_template":"daemon %s: problem creating SMTP socket","reason":"There was a problem creating an SMTP socket for the daemon.","resolution":"Check system resources, file descriptor limits, and network configuration. Review other log messages for specific error details."},{"function":"opendaemonsocket","message_template":"daemon %s: server SMTP socket (%d) too large","reason":"The socket descriptor number is too large for the select() function. This can happen on systems with high file descriptor counts.","resolution":"Reduce the number of open file descriptors or recompile with higher FD_SETSIZE limit."},{"function":"opendaemonsocket","message_template":"daemon %s: setsockopt(SO_RCVBUF)","reason":"Failed to set the socket receive buffer size. This might affect performance but not functionality.","resolution":"Check if the system allows adjusting socket buffer sizes, may need to increase kernel limits (sysctl net.core.rmem_max)."},{"function":"opendaemonsocket","message_template":"daemon %s: setsockopt(SO_SNDBUF)","reason":"Failed to set the socket send buffer size. This might affect performance but not functionality.","resolution":"Check if the system allows adjusting socket buffer sizes, may need to increase kernel limits (sysctl net.core.wmem_max)."},{"function":"opendaemonsocket","message_template":"daemon %s: failed to %s close-on-exec flag: %s","reason":"Failed to get or set the close-on-exec flag for the socket. This could cause file descriptor leaks in child processes.","resolution":"This is likely due to a system resource issue or file descriptor limit. Check system configuration and possibly restart sendmail."},{"function":"opendaemonsocket","message_template":"daemon %s: cannot bind","reason":"Failed to bind the socket to its address. This could be due to the address already being in use or insufficient permissions.","resolution":"Check if another process is already using the port or socket. Check permissions if using a privileged port. May need to wait if a previous instance of sendmail didn't fully close."},{"function":"opendaemonsocket","message_template":"daemon %s: cannot listen","reason":"Failed to put the socket in listening mode. This prevents accepting connections.","resolution":"Check system resources and limits. May require system restart if socket resources are exhausted."},{"function":"opendaemonsocket","message_template":"daemon %s: server SMTP socket wedged: exiting","reason":"The socket for the SMTP server is in a bad state and cannot be recovered.","resolution":"This critical error requires a restart of sendmail. Check system resources and network configuration."},{"function":"setupdaemon","message_template":"service \"smtp\" unknown","reason":"The SMTP service is not defined in the services database (usually \/etc\/services).","resolution":"Add an entry for SMTP in \/etc\/services or use a hardcoded port number in the configuration."},{"function":"setsockaddroptions","message_template":"domain socket name too long: %s > %ld","reason":"The specified UNIX domain socket path exceeds the maximum allowed length.","resolution":"Use a shorter path for the socket file. Consider using symbolic links to shorten the path."},{"function":"setsockaddroptions","message_template":"host \"%s\" unknown","reason":"Failed to resolve the specified hostname to an IP address.","resolution":"Check DNS configuration and ensure the hostname is resolvable. Add an entry to \/etc\/hosts if necessary."},{"function":"setsockaddroptions","message_template":"address= option unsupported for family %d","reason":"The address option is not supported for the specified address family.","resolution":"Use a supported address family or format. Check the configuration for proper syntax."},{"function":"setsockaddroptions","message_template":"invalid port number: %s","reason":"The specified port number is not valid.","resolution":"Use a valid port number (1-65535) or a service name defined in \/etc\/services."},{"function":"setsockaddroptions","message_template":"service \"%s\" unknown","reason":"The specified service name is not defined in the services database.","resolution":"Add an entry for the service in \/etc\/services or use a port number instead."},{"function":"setsockaddroptions","message_template":"Port= option unsupported for family %d","reason":"The port option is not supported for the specified address family.","resolution":"Use a supported address family or format. Check the configuration for proper syntax."},{"function":"setsockaddroptions","message_template":"PortOptions parameter \"%s\" unknown","reason":"An unknown parameter was specified in PortOptions.","resolution":"Check the configuration for proper syntax and valid parameters. Refer to the documentation for valid PortOptions."},{"function":"setsockaddroptions","message_template":"Unknown address family %s in Family=option","reason":"An unknown address family was specified in the Family option.","resolution":"Use a supported address family (e.g., 'inet', 'inet6', 'unix'). Check the configuration for proper syntax."},{"function":"setsockaddroptions","message_template":"Unknown delivery mode %c","reason":"An unknown delivery mode was specified.","resolution":"Use a supported delivery mode (e.g., 'i' for interactive, 'b' for background, 'd' for deferred). Check the configuration."},{"function":"setdaemonoptions","message_template":"Warning: SuperSafe=PostMilter requires Milter support (-DMILTER)","reason":"The SuperSafe=PostMilter option was specified, but Sendmail was not compiled with Milter support.","resolution":"Recompile Sendmail with Milter support (-DMILTER) or use a different SuperSafe option."},{"function":"getmodifiers","message_template":"getmodifiers too long, ignored","reason":"The modifiers string specified is too long and was ignored.","resolution":"Use a shorter modifiers string. Check the configuration for proper syntax."},{"function":"getrequests","message_template":"cannot fork","reason":"Failed to fork a child process to handle a client connection. This could be due to system resource limitations.","resolution":"Check system resources, process limits, and memory. May need to restart the system if resources are exhausted."},{"function":"getrequests","message_template":"sm_notify_start(false) failed=%d","reason":"Failed to initialize the notification system. This affects the ability to handle certain types of notifications.","resolution":"Check system resources and configuration. May require restarting sendmail."},{"function":"getrequests","message_template":"cannot open SMTP server channel, fd=%d","reason":"Failed to open I\/O channels for the SMTP server connection. This prevents communication with the client.","resolution":"Check system resources, file descriptor limits, and memory. May require restarting sendmail."},{"function":"makeconnection","message_template":"Cannot connect to address family %d","reason":"Failed to establish a connection to the specified address family. The address family may not be supported.","resolution":"Use a supported address family. Check network configuration and firewall rules."},{"function":"makeconnection","message_template":"cannot create socket","reason":"Failed to create a socket for outgoing connection. This prevents sending mail to remote hosts.","resolution":"Check system resources, file descriptor limits, and network configuration. May require system restart if socket resources are exhausted."},{"function":"makeconnection","message_template":"makeconnection: setsockopt(SO_SNDBUF)","reason":"Failed to set the socket send buffer size for an outgoing connection.","resolution":"Check if the system allows adjusting socket buffer sizes, may need to increase kernel limits (sysctl net.core.wmem_max)."},{"function":"makeconnection","message_template":"makeconnection: setsockopt(SO_RCVBUF)","reason":"Failed to set the socket receive buffer size for an outgoing connection.","resolution":"Check if the system allows adjusting socket buffer sizes, may need to increase kernel limits (sysctl net.core.rmem_max)."},{"function":"makeconnection","message_template":"cannot bind socket [%s]","reason":"Failed to bind the socket to the specified local address for outgoing connection.","resolution":"Check if the address is valid and available. Check permissions and network configuration."},{"function":"makeconnection","message_template":"makeconnection (%s [%s].%d (%d)) failed: %s","reason":"Failed to establish a connection to the specified host and port. The specific error is included.","resolution":"Check network connectivity, DNS resolution, firewall rules, and the availability of the remote host."},{"function":"makeconnection","message_template":"cannot open SMTP client channel, fd=%d","reason":"Failed to open I\/O channels for the SMTP client connection. This prevents communication with the remote server.","resolution":"Check system resources, file descriptor limits, and memory. May require restarting sendmail."},{"function":"makeconnection_ds","message_template":"makeconnection_ds: unsafe domain socket %s","reason":"The specified UNIX domain socket is considered unsafe due to permissions or ownership issues.","resolution":"Check and correct the permissions and ownership of the socket file or directory."},{"function":"makeconnection_ds","message_template":"makeconnection_ds: domain socket name %s too long","reason":"The specified UNIX domain socket path exceeds the maximum allowed length.","resolution":"Use a shorter path for the socket file. Consider using symbolic links to shorten the path."},{"function":"makeconnection_ds","message_template":"makeconnection_ds: could not create domain socket %s","reason":"Failed to create a socket for connection to the specified UNIX domain socket.","resolution":"Check system resources, file descriptor limits, and permissions. Ensure the socket path is valid."},{"function":"makeconnection_ds","message_template":"Could not connect to socket %s","reason":"Failed to connect to the specified UNIX domain socket.","resolution":"Ensure the server process that should be listening on the socket is running. Check permissions and the socket file."},{"function":"shutdown_daemon","message_template":"stopping daemon, reason=%s","reason":"The daemon is being shut down with the specified reason.","resolution":"Informational message. If the shutdown was unexpected, check for signals, configuration changes, or system issues."},{"function":"shutdown_daemon","message_template":"Could not remove daemon %s socket: %s: %s","reason":"Failed to remove the socket file for the daemon during shutdown.","resolution":"Check permissions and the filesystem. The socket file may need to be manually removed."},{"function":"restart_daemon","message_template":"could not restart: need full path","reason":"Failed to restart the daemon because the executable path is not a full path.","resolution":"Ensure the daemon is started with a full path to the executable. Use absolute paths in the configuration."},{"function":"restart_daemon","message_template":"restarting %s due to %s","reason":"The daemon is being restarted with the specified reason.","resolution":"Informational message. If the restart was unexpected, check for signals, configuration changes, or system issues."},{"function":"restart_daemon","message_template":"could not drop privileges: %s","reason":"Failed to drop privileges before restarting the daemon.","resolution":"Check user and group permissions. Ensure the user specified in the configuration exists and is usable."},{"function":"restart_daemon","message_template":"could not exec %s: %s","reason":"Failed to execute the daemon executable during restart.","resolution":"Check file permissions, existence of the executable, and system resources. Ensure the path is correct."},{"function":"myhostname","message_template":"My unqualified host name (%s) unknown; sleeping for retry","reason":"The daemon's hostname is not fully qualified and could not be resolved.","resolution":"Check hostname configuration and DNS setup. Ensure the hostname is properly set with the domain part."},{"function":"myhostname","message_template":"unable to qualify my own domain name (%s) -- using short name","reason":"The daemon could not determine the fully qualified domain name for its hostname.","resolution":"Check hostname configuration and DNS setup. Add an entry to \/etc\/hosts or configure DNS properly."},{"function":"host_map_lookup","message_template":"host_map_lookup(%s): bogus NULL cache entry, errno=%d, h_errno=%d","reason":"A NULL entry was found in the hostname cache, which indicates a potential internal error.","resolution":"This suggests an internal Sendmail issue. Consider restarting Sendmail or clearing the cache."},{"function":"host_map_lookup","message_template":"851 %s: Name server timeout","reason":"A DNS lookup timed out when trying to resolve the hostname.","resolution":"Check DNS server connectivity and configuration. May be a temporary network issue or DNS server problem."},{"function":"getauthinfo","message_template":"stat=occ_exceeded, host=%s, addr=%s","reason":"The outgoing connection count (OCC) limit has been exceeded for the specified host.","resolution":"Wait for some connections to complete or increase the connection limit. Check for possible connection leaks."},{"function":"getauthinfo","message_template":"450 occ_exceeded","reason":"The outgoing connection count (OCC) limit has been exceeded.","resolution":"Wait for some connections to complete or increase the connection limit. Check for possible connection leaks."},{"function":"getauthinfo","message_template":"421 4.4.5 Too many SMTP sessions for this host","reason":"Too many concurrent SMTP sessions from the client host, exceeding the XLA limit.","resolution":"Wait for some connections to complete or increase the XLA limit. Check if the client is behaving properly."},{"function":"getauthinfo","message_template":"421 4.4.5 Too many SMTP sessions for this host","reason":"Too many concurrent SMTP sessions from the client host.","resolution":"Wait for some connections to complete or increase connection limits. Check if the client is behaving properly."},{"function":"refuseconnections","message_template":"554 5.3.5 service \"smtp\" unknown","reason":"The SMTP service is not defined in the services database.","resolution":"Add an entry for SMTP in \/etc\/services or use a hardcoded port number in the configuration."},{"function":"getauthinfo","message_template":"service \"smtp\" unknown","reason":"The SMTP service is not defined in the services database during getauthinfo.","resolution":"Add an entry for SMTP in \/etc\/services or use a hardcoded port number in the configuration."},{"function":"getauthinfo","message_template":"service \"%s\" unknown","reason":"The specified service name is not defined in the services database during authentication.","resolution":"Add an entry for the service in \/etc\/services or use a port number instead."},{"function":"getauthinfo","message_template":"long sa_data: family %d len %d","reason":"The socket address data is longer than expected for the specified family.","resolution":"This suggests an internal Sendmail issue or possibly a malformed packet. May need to restart Sendmail."}]}