{"project":"sendmail","module":"envelope.c","summary":"This module handles the creation, manipulation, and disposal of mail envelopes in sendmail. It manages envelope metadata, job queuing, recipient processing, and implements delivery timeout handling.","logs":[{"function":"dropenvelope","message_template":"dropenvelope, e_flags=0x%lx, OpMode=%c, pid=%d","reason":"Debug log showing the internal state of the envelope during processing, including flags, operation mode, and process ID","resolution":"Informational log for debugging purposes, no resolution required"},{"function":"dropenvelope","message_template":"Cannot send message for %s","reason":"Indicates a message delivery failure due to a timeout, with the timeout period shown","resolution":"Check for network issues, DNS problems, or overloaded destination mail servers. May require increasing timeout values in configuration if destinations are consistently slow."},{"function":"dropenvelope","message_template":"Delivery time (%lds) expired","reason":"Indicates that the Deliver-By time for the message was exceeded","resolution":"This is an RFC 2852 delivery time constraint violation. Review network connectivity or increase deliver-by timeouts if appropriate."},{"function":"dropenvelope","message_template":"Message could not be delivered for %s","reason":"Final notification that a message timed out after maximum retries","resolution":"Investigate mail routing issues or recipient server availability. Check queue processing and timeout configuration."},{"function":"dropenvelope","message_template":"Message will be deleted from queue","reason":"Notification that an undeliverable message will be removed from the queue","resolution":"Informational message after final delivery failure. No resolution needed, but investigate delivery failures if occurring frequently."},{"function":"dropenvelope","message_template":"Warning: Delivery time (%lds) exceeded","reason":"Warning that the Deliver-By time for the message was exceeded but delivery attempts will continue","resolution":"This is a warning about an RFC 2852 delivery time constraint. Check network or server issues causing delivery delays."},{"function":"dropenvelope","message_template":"Warning: could not send message for past %s","reason":"Warning that a message has been in the queue for longer than the warning threshold","resolution":"Check for network connectivity issues, DNS problems, or verify recipient address validity. May require queue monitoring if persistent."},{"function":"dropenvelope","message_template":"Will keep trying until message is %s old","reason":"Informs that delivery attempts will continue until the message reaches the maximum age threshold","resolution":"Informational message, no resolution required, but may indicate delivery problems if seen frequently."},{"function":"dropenvelope","message_template":"done; delay=%s, ntries=%d","reason":"Logs successful completion of mail processing, showing delay time and number of attempts required","resolution":"Informational log, no resolution required. High ntries values might indicate delivery problems."},{"function":"dropenvelope","message_template":"!dropenvelope(%s): cannot commit data file %s, uid=%ld","reason":"Critical error indicating failure to write the message data file to disk during queue processing","resolution":"Check filesystem permissions, disk space, and I\/O errors. May require maintenance on the mail spool filesystem."},{"function":"openxscript","message_template":"openxscript: job not locked","reason":"Error indicating an attempt to create a transcript file for a job that is not properly locked","resolution":"This may indicate a race condition or programming error. Verify sendmail queue processing is not corrupted."},{"function":"openxscript","message_template":"Can't create transcript file %s","reason":"Error when unable to create the transcript file for logging message processing","resolution":"Check filesystem permissions, disk space, and directory write access. Ensure the mail spool directory is properly configured."},{"function":"openxscript","message_template":"!Can't open %s","reason":"Critical error when failing to open \/dev\/null as a fallback for the transcript file","resolution":"System may have serious issues if \/dev\/null cannot be opened. Check system integrity and device nodes."},{"function":"closexscript","message_template":"closexscript: job not locked","reason":"Error indicating an attempt to close a transcript file for a job that is not properly locked","resolution":"This may indicate a race condition or programming error. Verify sendmail queue processing is not corrupted."},{"function":"setsender","message_template":"setsender: %s: invalid or unparsable, received from %s","reason":"Logs when a sender address is invalid or cannot be parsed correctly","resolution":"Review the mail client or system generating the invalid addresses. May require sender verification configuration changes."},{"function":"setsender","message_template":"553 Invalid sender address","reason":"Error returned to client when the FROM address is invalid or unparsable","resolution":"The sending client needs to correct the malformed email address format. This may be due to misconfigured mail clients."},{"function":"setsender","message_template":"553 5.3.0 setsender: can't even parse postmaster!","reason":"Critical error indicating that even the fallback postmaster address couldn't be parsed","resolution":"This indicates a serious system issue or corruption. Verify mail configuration and address parsing rules."},{"function":"setsender","message_template":"cannot prescan from (%s)","reason":"Error indicating failure to preprocess the FROM address","resolution":"This may be due to a malformed email address or syntax issues. Check mail client configuration generating the address."}]}