{"project":"sendmail","module":"..\/working\/sendmail\/sendmail\/err.c","summary":"This module implements Sendmail's error handling and logging system. It provides functions for reporting system errors, user errors, and informational messages, generating properly formatted SMTP responses, and logging errors to syslog with appropriate severity levels.","logs":[{"function":"fatal_error","message_template":"!%s","reason":"Logs a fatal exception that is terminating the process, typically due to out-of-memory conditions or other unrecoverable errors.","resolution":"Check system resources, particularly memory availability. May require increasing system memory, reducing the load on the server, or fixing memory leaks in the application."},{"function":"syserr","message_template":"SYSERR(%s): %.900s","reason":"Logs system errors to syslog with LOG_ALERT (for panic errors) or LOG_CRIT priority. These indicate serious problems with the mail system.","resolution":"Check system logs for more context. May require investigation of system-level issues, configuration problems, or resource constraints."},{"function":"syserr","message_template":"syserr: ExitStat = %d\n","reason":"Logs the exit status when in debug mode (tTd(54, 1)) during a system error condition.","resolution":"Informational for debugging purposes. If seen frequently, review the exit code patterns to identify recurring issues."},{"function":"usrerr","message_template":"%.900s","reason":"Logs user errors to syslog with LOG_NOTICE priority when LogLevel > 3 and LogUsrErrs is enabled.","resolution":"Review the specific error message for details. Usually indicates issues with message content, recipient addresses, or user permissions that need to be corrected by the user."},{"function":"usrerrenh","message_template":"Postmaster warning: %.*s","reason":"Generates a warning message to the postmaster when a message starts with code '6', indicating a serious but non-fatal issue.","resolution":"The postmaster should review these warnings to identify potential mail system issues or misconfigurations that need attention."},{"function":"usrerrenh","message_template":"%.900s","reason":"Logs enhanced user errors to syslog with LOG_NOTICE priority when LogLevel > 3 and LogUsrErrs is enabled.","resolution":"Review the specific error message and enhanced status code for details. May require configuration changes or addressing issues with message content or delivery."},{"function":"putoutmsg","message_template":"--- %s%s%s","reason":"Logs message details for debugging (tTd(54, 8)) or when LogLevel > 14 in SMTP or daemon mode.","resolution":"Informational log for debugging purposes. No resolution needed unless errors are indicated."},{"function":"putoutmsg","message_template":"SYSERR: putoutmsg (%s): error on output channel sending \"%s\": %s","reason":"Logs an error that occurred while trying to send a message to the output channel, indicating communication problems.","resolution":"Check network connectivity, SMTP server configuration, and client connectivity. May indicate connection issues or server overload."},{"function":"sm_errstring","message_template":"Error %d","reason":"Generic error message when a specific error string is not available for the given error code.","resolution":"Check system documentation for the specific error code. May require additional context from surrounding logs to diagnose."},{"function":"sm_errstring","message_template":"Timeout on file open","reason":"Indicates that a file open operation timed out, possibly due to file system issues or resource contention.","resolution":"Check file system health, disk I\/O performance, and file permissions. May require system maintenance or configuration changes."},{"function":"sm_errstring","message_template":"Symbolic links not allowed","reason":"Security restriction preventing the use of symbolic links in certain contexts.","resolution":"Review security settings and use direct file paths instead of symbolic links, or modify the configuration to allow symbolic links if appropriate."},{"function":"sm_errstring","message_template":"Hard links not allowed","reason":"Security restriction preventing the use of hard links in certain contexts.","resolution":"Review security settings and use direct file paths instead of hard links, or modify the configuration to allow hard links if appropriate."},{"function":"sm_errstring","message_template":"Regular files only","reason":"An operation that requires a regular file was attempted on a special file, directory, or other non-regular file.","resolution":"Ensure that only regular files are used for the operation in question. Check configuration and file paths."},{"function":"sm_errstring","message_template":"Executable files not allowed","reason":"Security restriction preventing the use of executable files in certain contexts.","resolution":"Review security settings and use non-executable files, or modify the configuration to allow executable files if appropriate and secure."},{"function":"sm_errstring","message_template":"World writable directory","reason":"Security warning about a directory with world-writable permissions, which could allow unauthorized modifications.","resolution":"Change the directory permissions to remove world-write access (chmod o-w directory). This is a security best practice."},{"function":"sm_errstring","message_template":"Group writable directory","reason":"Security warning about a directory with group-writable permissions, which could allow unauthorized modifications by group members.","resolution":"Change the directory permissions to remove group-write access (chmod g-w directory) or ensure the group membership is properly restricted."},{"function":"sm_errstring","message_template":"File changed after open","reason":"Indicates that a file was modified after it was opened, which could be a sign of tampering or race conditions.","resolution":"Check for concurrent processes accessing the same file. May require file locking mechanisms or process coordination to prevent race conditions."},{"function":"sm_errstring","message_template":"World writable file","reason":"Security warning about a file with world-writable permissions, which could allow unauthorized modifications.","resolution":"Change the file permissions to remove world-write access (chmod o-w file). This is a security best practice."},{"function":"sm_errstring","message_template":"Group writable file","reason":"Security warning about a file with group-writable permissions, which could allow unauthorized modifications by group members.","resolution":"Change the file permissions to remove group-write access (chmod g-w file) or ensure the group membership is properly restricted."},{"function":"sm_errstring","message_template":"Group readable file","reason":"Security warning about a file with group-readable permissions, which could allow unauthorized access by group members.","resolution":"Change the file permissions to remove group-read access (chmod g-r file) if the file contains sensitive information."},{"function":"sm_errstring","message_template":"World readable file","reason":"Security warning about a file with world-readable permissions, which could allow unauthorized access.","resolution":"Change the file permissions to remove world-read access (chmod o-r file) if the file contains sensitive information."},{"function":"sm_errstring","message_template":"Name server: %s: %s","reason":"Indicates a DNS-related error when looking up a host name, which can cause mail delivery problems.","resolution":"Check DNS configuration, network connectivity, and the status of DNS servers. May require updating DNS records or resolving network issues."},{"function":"sm_errstring","message_template":"Host %s is down","reason":"Indicates that the mail server couldn't connect to the specified host because it appears to be down.","resolution":"Check if the remote host is running and accessible. May require contacting the administrator of the remote host or trying alternative mail routes."},{"function":"sm_errstring","message_template":"Connection refused by %s","reason":"Indicates that the remote host actively refused the connection attempt, suggesting it's up but not accepting connections on that port.","resolution":"Verify that the remote mail server is running and configured to accept connections. Check firewall rules and service status on the remote host."},{"function":"sm_errstring","message_template":"Connection reset by %s during %s","reason":"Indicates that the remote host abruptly closed the connection during a specific SMTP phase, possibly due to timeout or error.","resolution":"Check network stability and remote server logs. May indicate server-side issues, network problems, or incompatible SMTP implementations."},{"function":"sm_errstring","message_template":"host not found","reason":"DNS lookup failed because the host name doesn't exist in DNS records.","resolution":"Verify the correctness of the domain name. May require updating DNS records or correcting email addresses."},{"function":"sm_errstring","message_template":"host name lookup failure","reason":"Temporary DNS lookup failure, possibly due to DNS server issues or network problems.","resolution":"Retry later as this is usually a temporary condition. If persistent, check DNS server health and network connectivity."},{"function":"sm_errstring","message_template":"non-recoverable error","reason":"A serious DNS-related error occurred that cannot be resolved by retrying.","resolution":"Check DNS configuration and server logs. May require DNS server maintenance or configuration changes."},{"function":"sm_errstring","message_template":"no data known","reason":"The DNS name exists but doesn't have the requested record type.","resolution":"Verify that the domain has proper MX or A records configured. May require updating DNS records with the correct information."},{"function":"sm_errstring","message_template":"Operation not permitted","reason":"The current user doesn't have permission to perform the requested operation.","resolution":"Check user permissions and file ownership. May require running the operation as a different user or changing permissions."}]}