{"project":"sendmail","module":"headers.c","summary":"This module handles email header processing in Sendmail, including parsing, validation, and modification of headers. It includes functions to prepare headers for delivery, check for potential security issues in MIME headers, and log message information for tracking purposes.","logs":[{"function":"dochompheader","message_template":"553 5.3.0 header syntax error, line \"%s\"","reason":"Logs an error when a header line cannot be properly parsed due to syntax errors","resolution":"Review the message source for improperly formatted headers. This may indicate a malformed email or an attempt to exploit vulnerabilities."},{"function":"dochompheader","message_template":"Warning: redefined ruleset for header=%s, old=%s, new=%s","reason":"Logs a warning when a ruleset for a header is redefined, potentially causing unexpected behavior","resolution":"Check your configuration files for duplicate header ruleset definitions. The first definition was overridden by a later one."},{"function":"dochompheader","message_template":"Warning: truncated header '%s' before check with '%s' len=%d max=%d","reason":"Indicates that a header was too long and had to be truncated before processing","resolution":"This may be legitimate for very long headers or indicate a potential attack. Consider adjusting MaxHeaderLength if this occurs frequently with legitimate email."},{"function":"crackaddr","message_template":"Dropped invalid comments from header address","reason":"The system had to drop invalid comments from an email address to maintain proper syntax","resolution":"This is usually benign, but repeated occurrences from the same source may indicate a misconfigured mailer or an attempt to exploit address parsing."},{"function":"logsender","message_template":"from=%.200s, size=%ld, class=%d, nrcpts=%d","reason":"Logs basic information about an incoming message including sender, size, priority class, and recipient count","resolution":"Informational log, no resolution required. Useful for tracking message flow."},{"function":"logsender","message_template":", msgid=%.*s","reason":"Logs the Message-ID of an email for tracking purposes","resolution":"Informational log, no resolution required. Use the Message-ID to track this message across systems."},{"function":"logsender","message_template":", bodytype=%.20s","reason":"Logs the content type of the message body","resolution":"Informational log, no resolution required."},{"function":"logsender","message_template":", proto=%.20s","reason":"Logs the protocol used to receive the message","resolution":"Informational log, no resolution required."},{"function":"logsender","message_template":", relay=%s","reason":"Logs the relay host that sent the message","resolution":"Informational log, no resolution required. Can be useful for tracking message origins."},{"function":"putheader","message_template":"Truncated MIME %s header due to field size (length = %ld) (possible attack)","reason":"A MIME header field exceeded MaxMimeFieldLength and was truncated, which may indicate a security attack","resolution":"Check the message source as this could be an attempt to exploit MIME header parsing vulnerabilities. Consider blocking mail from the sender if this is repeated."},{"function":"putheader","message_template":"Truncated long MIME %s header (length = %ld) (possible attack)","reason":"A MIME header exceeded MaxMimeHeaderLength and was truncated, which may indicate a security attack","resolution":"Review the message as this might be an attempt to perform a buffer overflow attack. Consider configuring spam filters to detect abnormally long headers."},{"function":"putheader","message_template":"Fixed MIME %s header (possible attack)","reason":"The system needed to rebalance a malformed MIME header, which could indicate a deliberate attack","resolution":"Monitor for patterns of such messages from the same source, as these may be attempts to exploit MIME parsing vulnerabilities."},{"function":"fix_mime_header","message_template":"Fixed MIME %s header field (possible attack)","reason":"A MIME header field had to be rebalanced due to malformed structure, potentially indicating an attack","resolution":"This may be a sign of a malicious mail client attempting to exploit MIME parsing. If seen frequently from the same source, consider implementing additional filtering."}]}