{"project":"sendmail","module":"macro.c","summary":"This module handles macro processing in Sendmail, including macro definition, expansion, and value retrieval. It provides functionality for macro name parsing, lookup, and class membership testing to support Sendmail's macro system.","logs":[{"function":"doexpand","message_template":"expand: recursion too deep (%d max)","reason":"Generated when macro expansion exceeds the maximum allowed recursion depth. This typically happens when macros reference each other in a circular way or are deeply nested.","resolution":"Check for circular macro references or simplify deeply nested macro definitions. Consider increasing MaxMacroRecursion if appropriate for your environment."},{"function":"macid_parse","message_template":"Name required for macro\/class","reason":"Generated when attempting to define a macro without providing a name. This happens when an empty macro name is encountered.","resolution":"Inspect your Sendmail configuration for empty macro definitions. Each macro must have a valid name defined."},{"function":"macid_parse","message_template":"Invalid macro\/class character %c","reason":"Generated when a macro name contains characters that aren't allowed. Only alphanumeric characters and underscores are permitted.","resolution":"Check macro names in your configuration and ensure they only contain alphanumeric characters and underscores."},{"function":"macid_parse","message_template":"Unbalanced { on %s","reason":"Generated when a macro name has an opening curly brace without a matching closing brace.","resolution":"Check your Sendmail configuration for macro definitions with unbalanced braces and ensure all opening braces have matching closing braces."},{"function":"macid_parse","message_template":"Macro\/class name ({%s}) too long (%d chars max)","reason":"Generated when a macro name exceeds the maximum allowed length (MAXMACNAMELEN).","resolution":"Shorten the macro name in your configuration to be within the allowed limit (typically around 25 characters)."},{"function":"macid_parse","message_template":"Macro\/class {%s}: too many long names","reason":"Generated when attempting to define too many macros with long names. The system has a limit on the number of long-named macros it can handle.","resolution":"Reduce the number of macros with long names in your configuration or consider using shorter, single-character macro names where possible."},{"function":"macid_parse","message_template":"Unable to assign macro\/class ID (mid = 0x%x)","reason":"Generated when the system cannot assign an ID to a macro, possibly due to exceeding the maximum number of allowed macros or internal errors.","resolution":"Review your configuration for excessive macro definitions and consider simplifying it."},{"function":"wordinclass","message_template":"dynamic class: A{%s}: map lookup failed: key=%s, status=%d","reason":"Generated when a dynamic class map lookup operation fails. This could be due to database or access issues.","resolution":"Check the map configuration and ensure the associated database or data source is accessible and properly configured. Verify status code to determine specific failure reason."},{"function":"wordinclass","message_template":"451 4.3.1 temporary error","reason":"Generated when encountering a temporary error during dynamic class lookups, presented to mail clients to indicate a temporary server issue.","resolution":"Investigate prior error messages in logs related to map lookups, check database connections, and ensure all required resources are available."}]}