{"project":"sendmail","module":"mci.c","summary":"The Mail Connection Information (MCI) caching module manages open connections to remote SMTP servers and persistent host status information. It provides functionality for caching, locking, and retrieving connection status to avoid repeatedly opening new connections to the same host.","logs":[{"function":"mci_cache","message_template":"mci_cache: caching %lx (%.100s) in slot %d","reason":"Logs when a connection is being cached in the open connection cache. This is a debug log to trace connection caching.","resolution":"Informational log, no resolution required. Useful for diagnosing connection reuse issues."},{"function":"mci_uncache","message_template":"mci_uncache: uncaching %lx (%.100s) from slot %d (%d)","reason":"Logs when a connection is being removed from the cache. This helps trace connection lifecycle.","resolution":"Informational log, no resolution required. May provide insight for connection reuse issues."},{"function":"mci_uncache","message_template":"Closing connection to %s","reason":"User-visible message indicating a connection to a host is being closed.","resolution":"Informational message, no resolution required. Normal part of mail delivery."},{"function":"mci_get","message_template":"!negative mno %d (%s)","reason":"System error when a mailer number is negative, which should never happen in valid configurations.","resolution":"Check your mailer configuration. This indicates a corrupted mailer definition in sendmail.cf or other configuration source."},{"function":"mci_lock_host","message_template":"mci_lock_host: NULL mci","reason":"Debug log when attempting to lock a NULL MCI structure, which is an unusual condition.","resolution":"Informational debug log. If seen frequently, may indicate a programming error in mail delivery code."},{"function":"mci_lock_host_statfile","message_template":"mci_lock_host: attempting to lock %s","reason":"Debug log indicating an attempt to lock a host for exclusive delivery.","resolution":"Informational debug log, no resolution required."},{"function":"mci_lock_host_statfile","message_template":"mci_lock_host: Failed to generate host path for %s","reason":"Failed to generate a valid file system path for host status storage.","resolution":"Check the HostStatDir configuration and ensure the host name is valid and not malformed. May indicate issues with hostname validation or directory permissions."},{"function":"mci_lock_host_statfile","message_template":"mci_lock_host: cannot create host lock file %s","reason":"System error when unable to create a host lock file, likely due to file system permissions or storage issues.","resolution":"Check permissions on the HostStatDir directory, available disk space, and file system mount status. Ensure sendmail has write access to the directory."},{"function":"mci_lock_host_statfile","message_template":"mci_lock_host: couldn't get lock on %s","reason":"Debug log when a host lock cannot be acquired, likely because another process has the lock.","resolution":"Usually indicates another sendmail process is delivering to this host. If persistent, check for stuck processes or stale locks."},{"function":"mci_unlock_host","message_template":"mci_unlock_host: NULL mci","reason":"Debug log when attempting to unlock a NULL MCI structure.","resolution":"Informational debug log. If seen frequently, may indicate a programming error in mail delivery code."},{"function":"mci_unlock_host","message_template":"mci_unlock_host: stat file already locked","reason":"Debug log when unable to lock a host stat file that's being unlocked, indicating concurrent access.","resolution":"Informational debug log. Usually harmless, but if persistent, may indicate lock contention issues."},{"function":"mci_unlock_host","message_template":"mci_unlock_host: store prior to unlock","reason":"Debug log indicating host status is being stored before releasing the lock.","resolution":"Informational debug log, no resolution required."},{"function":"mci_load_persistent","message_template":"mci_load_persistent: NULL mci","reason":"Debug log when attempting to load persistent information for a NULL MCI structure.","resolution":"Informational debug log. If seen frequently, may indicate a programming error in mail delivery code."},{"function":"mci_load_persistent","message_template":"mci_load_persistent: Attempting to load persistent information for %s","reason":"Debug log indicating an attempt to load cached information about a host.","resolution":"Informational debug log, no resolution required."},{"function":"mci_load_persistent","message_template":"mci_load_persistent: Couldn't generate host path","reason":"Debug log when unable to generate a valid file system path for host status retrieval.","resolution":"If frequent, check the HostStatDir configuration and ensure the host name validation is working properly."},{"function":"mci_load_persistent","message_template":"mci_load_persistent: open(%s): %s","reason":"Debug log when unable to open a persistent host status file, with error details.","resolution":"If this occurs for legitimate hosts, check file system permissions and availability of the HostStatDir directory."},{"function":"mci_read_persistent","message_template":"mci_read_persistent: NULL fp","reason":"System error when attempting to read persistent information from a NULL file pointer.","resolution":"This is likely a programming error. If seen in logs, report to the sendmail maintainers."},{"function":"mci_read_persistent","message_template":"mci_read_persistent: NULL mci","reason":"System error when attempting to read persistent information into a NULL MCI structure.","resolution":"This is likely a programming error. If seen in logs, report to the sendmail maintainers."},{"function":"mci_read_persistent","message_template":"Unknown host status version %d: %d max","reason":"System error when reading an unsupported version of host status file format.","resolution":"This could indicate data corruption or an attempt to use host status files from an incompatible version of sendmail. Check if multiple versions are running."},{"function":"mci_read_persistent","message_template":"%s: line %d: Unknown host status line \"%s\"","reason":"System log when encountering an unknown format in a host status file, which may indicate corruption.","resolution":"Check for file system corruption or manual editing of status files. May require purging the host cache with 'purgestat'."},{"function":"mci_store_persistent","message_template":"mci_store_persistent: NULL mci","reason":"Debug log when attempting to store persistent information for a NULL MCI structure.","resolution":"Informational debug log. If seen frequently, may indicate a programming error in mail delivery code."},{"function":"mci_store_persistent","message_template":"mci_store_persistent: Storing information for %s","reason":"Debug log indicating host status information is being stored to persistent storage.","resolution":"Informational debug log, no resolution required."},{"function":"mci_store_persistent","message_template":"mci_store_persistent: no statfile","reason":"Debug log when unable to store persistent information because the status file is not open.","resolution":"If persistent, check for file system issues or permission problems with the HostStatDir directory."},{"function":"mci_traverse","message_template":"mci_traverse: pathname is %s","reason":"Debug log showing the path being traversed when walking the host status directory tree.","resolution":"Informational debug log, no resolution required."},{"function":"mci_traverse","message_template":"mci_traverse: Failed to stat %s: %s","reason":"Debug log when unable to stat a file or directory during host status directory traversal.","resolution":"Check file system permissions and structure. May indicate permission issues or file system corruption."},{"function":"mci_traverse","message_template":"mci_traverse: opendir %s: %s","reason":"Debug log when unable to open a directory during host status directory traversal.","resolution":"Check directory permissions and ensure HostStatDir is properly configured and accessible."},{"function":"mci_traverse","message_template":"mci_traverse: path \"%s\" too long","reason":"Debug log when a path exceeds the maximum allowed length during directory traversal.","resolution":"Consider relocating the HostStatDir to a location with a shorter absolute path."},{"function":"mci_traverse","message_template":"mci_traverse: path \"%s%s\" too long","reason":"Debug log when a path with a filename added exceeds the maximum allowed length during directory traversal.","resolution":"Consider relocating the HostStatDir to a location with a shorter absolute path."},{"function":"mci_print_persistent","message_template":"mci_print_persistent: cannot open %s: %s","reason":"Debug log when unable to open a status file for printing host status information.","resolution":"Check file permissions and existence. This is usually seen during manual purgestat or hoststat commands."},{"function":"mci_print_persistent","message_template":"%s: could not read status file","reason":"System error when unable to read the contents of a host status file during status display.","resolution":"Check for file corruption or permission issues. May require purging the status file with 'purgestat'."},{"function":"mci_purge_persistent","message_template":"mci_purge_persistent: purging %s","reason":"Debug log indicating a host status file is being purged from persistent storage.","resolution":"Informational debug log, no resolution required. Normal during 'purgestat' operations."},{"function":"mci_purge_persistent","message_template":"mci_purge_persistent: Failed to stat %s: %s","reason":"Debug log when unable to stat a file during host status purging.","resolution":"Check file system permissions and structure. May indicate files were already removed or permission issues."},{"function":"mci_purge_persistent","message_template":"mci_purge_persistent: failed to unlink %s: %s","reason":"System log warning that a host status file could not be deleted during purging.","resolution":"Check file permissions and ensure the sendmail process has permission to delete files in HostStatDir."},{"function":"mci_purge_persistent","message_template":"mci_purge_persistent: dpurge %s","reason":"Debug log indicating a directory is being purged from the host status tree.","resolution":"Informational debug log, no resolution required. Normal during comprehensive 'purgestat' operations."},{"function":"mci_purge_persistent","message_template":"mci_purge_persistent: rmdir %s: %s","reason":"Debug log when unable to remove a directory during host status purging.","resolution":"Check if the directory is not empty or if permission issues exist. Usually not critical as directories will be cleaned up in future purges."},{"function":"mci_generate_persistent_path","message_template":"mci_generate_persistent_path: null host","reason":"System error when attempting to generate a path with a NULL hostname.","resolution":"This is likely a programming error. If seen in logs, report to the sendmail maintainers or check for configuration issues that could lead to empty hostnames."},{"function":"mci_generate_persistent_path","message_template":"mci_generate_persistent_path: null path","reason":"System error when attempting to write a path to a NULL buffer.","resolution":"This is likely a programming error. If seen in logs, report to the sendmail maintainers."}]}