{"project":"sendmail","module":"milter.c","summary":"The milter.c module implements mail filtering functionality in Sendmail, facilitating communication with external mail filters via a socket protocol. It handles the connection, negotiation, and command exchange between Sendmail and filter applications, including processing filter responses that can modify, reject, or accept messages.","logs":[{"function":"milter_timeout","message_template":"milter_%s(%s): socket %d is larger than FD_SETSIZE %d","reason":"Logs when a socket file descriptor is too large for select() functionality, which would cause a security issue. This likely occurs when the system has too many open files or sockets.","resolution":"Reduce the number of concurrent connections or reconfigure the system to allow larger FD_SETSIZE."},{"function":"milter_timeout","message_template":"Milter (%s): socket(%s) %d is larger than FD_SETSIZE %d","reason":"A more detailed version of the previous message when MilterLogLevel is higher, indicating a socket file descriptor is too large for select() calls.","resolution":"Reduce the number of concurrent connections or reconfigure the system to allow larger FD_SETSIZE."},{"function":"milter_timeout","message_template":"milter_%s(%s): timeout, where=%s","reason":"Indicates a timeout occurred while waiting for a socket operation. The filter isn't responding in time to a request.","resolution":"Check if the filter process is running correctly and not overloaded. Consider increasing timeout values in the configuration."},{"function":"milter_timeout","message_template":"Milter (%s): timeout %s data %s, where=%s","reason":"A more detailed timeout message with information about what stage the timeout occurred, and what type of data was expected.","resolution":"Check if the filter process is running and responding. You may need to increase the timeout values or investigate why the filter is slow to respond."},{"function":"milter_timeout","message_template":"milter_%s(%s): select: %s","reason":"Error occurred during a select() system call when trying to read from or write to the filter socket.","resolution":"Check system resources, especially socket descriptors and memory. The error string provides more details about the specific failure."},{"function":"milter_timeout","message_template":"Milter (%s): select(%s): %s","reason":"Detailed version of the select() error message with the milter name and operation type.","resolution":"Investigate the specific error in the system call that's referenced in the error message. May require checking system resources or network configuration."},{"function":"milter_timeout","message_template":"milter_%s(%s): socket not ready","reason":"The socket for communicating with the filter is not ready for reading or writing within the timeout period.","resolution":"Check the filter process and ensure it's running correctly. Consider increasing timeout values if filters are normally slow to respond."},{"function":"milter_timeout","message_template":"Milter (%s): socket(%s) not ready","reason":"More detailed version of the socket not ready message that includes the milter name.","resolution":"Check if the filter process is running and responsive. You may need to restart the filter or increase timeout values."},{"function":"milter_sysread","message_template":"milter_sys_read (%s): timeout %s data read in %s","reason":"A timeout occurred while reading data from the filter socket. The filter isn't sending expected data in time.","resolution":"Check if the filter is running and responsive. This could indicate a hung or overloaded filter process."},{"function":"milter_sysread","message_template":"Milter (%s): timeout %s data read in %s","reason":"More detailed version of the read timeout message that includes information about what stage the timeout occurred.","resolution":"Investigate why the filter is not responding. May need to restart the filter, increase timeout values, or check for filter bugs."},{"function":"milter_sysread","message_template":"milter_sys_read(%s): read returned %ld: %s","reason":"Error occurred when reading from the filter socket. The system call returned an error.","resolution":"Check system resources and network connectivity. The error string provides specific details about the failure."},{"function":"milter_sysread","message_template":"Milter (%s): read returned %ld: %s","reason":"More detailed version of the read error message that includes the milter name.","resolution":"Investigate the specific error in the system call. May require checking system resources, network connectivity, or filter process state."},{"function":"milter_sysread","message_template":"milter_sys_read(%s): cmd read returned %ld, expecting %ld","reason":"The read operation from the filter socket returned less data than expected, indicating a protocol error or connection issue.","resolution":"Verify that the filter is correctly implementing the milter protocol. Check for any network issues that might truncate messages."},{"function":"milter_sysread","message_template":"milter_sys_read(%s): cmd read returned %ld, expecting %ld","reason":"Same as previous, but logged at a different level. Indicates insufficient data read from the filter.","resolution":"Check filter implementation for protocol compliance. Also verify network settings for any issues that might cause packet truncation."},{"function":"milter_read","message_template":"milter_read(%s): socket closed, where=%s","reason":"The socket connection to the filter has been closed unexpectedly during operation.","resolution":"Check if the filter process crashed or was terminated. May need to restart the filter or investigate why it's closing connections."},{"function":"milter_read","message_template":"milter_read(%s): timeout before data read, where=%s","reason":"A timeout occurred before any data could be read from the filter socket.","resolution":"Verify filter process is running and responsive. This could indicate an overloaded or hung filter that's not responding to requests."},{"function":"milter_read","message_template":"Milter read(%s): timeout before data read, where=%s","reason":"More detailed version of the read timeout message.","resolution":"Check if the filter is running correctly and not overloaded. Consider increasing timeout settings if filters are normally slow."},{"function":"milter_read","message_template":"milter_read(%s): expecting %ld bytes","reason":"Debug message indicating the number of bytes expected to be read from the filter.","resolution":"This is an informational message, no action required unless investigating filter communication issues."},{"function":"milter_read","message_template":"milter_read(%s): read size %ld out of range, where=%s","reason":"The filter reported a data size that's invalid or out of acceptable range, which could indicate a protocol error.","resolution":"Check filter implementation for protocol compliance. May indicate a bug in the filter or protocol version mismatch."},{"function":"milter_read","message_template":"milter_read(%s): read size %ld out of range, where=%s","reason":"Same as previous, but logged at a different level. Indicates invalid data size from filter.","resolution":"Check filter implementation for protocol compliance. May indicate a bug in the filter or malformed responses."},{"function":"milter_read","message_template":"milter_read(%s): Returning %*s","reason":"Debug message showing the data being returned from the read operation.","resolution":"Informational message, no action needed unless debugging communication issues."},{"function":"milter_write","message_template":"milter_write(%s): length %ld out of range, mds=%ld, cmd=%c","reason":"Attempting to write data that exceeds the maximum allowed size to the filter socket.","resolution":"Check why message content is exceeding size limits. You may need to increase MilterMaxDataSize configuration or modify the message being sent."},{"function":"milter_write","message_template":"milter_write(%s): buf=%s","reason":"Debug message showing the buffer content being written to the filter.","resolution":"Informational message, no action needed unless debugging communication issues."},{"function":"milter_write","message_template":"milter_write(%s): length %ld out of range, cmd=%c","reason":"Similar to previous message, but logged at a different level. The data size exceeds allowed limits.","resolution":"Check message content size and consider increasing MilterMaxDataSize configuration if appropriate."},{"function":"milter_write","message_template":"milter_write(%s): socket closed","reason":"The socket connection to the filter has been closed unexpectedly when trying to write data.","resolution":"Check if the filter process has crashed or terminated. May need to restart the filter or investigate connection issues."},{"function":"milter_write","message_template":"milter_write(%s): cmd %c, len %ld","reason":"Debug message showing the command and length of data being written to the filter.","resolution":"Informational message, no action needed unless debugging communication issues."},{"function":"milter_write","message_template":"milter_write(%s): Sending %*s","reason":"Debug message showing the actual content being sent to the filter.","resolution":"Informational message, no action needed unless debugging communication issues."},{"function":"milter_write","message_template":"milter_write(%s): write(%c) returned %ld, expected %ld: %s","reason":"Error occurred when writing to the filter socket. The system call did not write all requested data.","resolution":"Check system resources and network connectivity. The error string provides specific details about the failure."},{"function":"milter_write","message_template":"Milter (%s): write(%c) returned %ld, expected %ld: %s","reason":"More detailed version of the write error message that includes the milter name.","resolution":"Investigate the specific error in the system call. May require checking system resources, network capacity, or filter process state."},{"function":"milter_open","message_template":"X%s: empty or missing socket information","reason":"The milter filter configuration is missing socket connection information, making it impossible to connect.","resolution":"Check filter configuration to ensure the socket path or network address is properly specified."},{"function":"milter_open","message_template":"X%s: empty or missing socket information","reason":"Same as previous, but logged at a different level. Socket information is missing in configuration.","resolution":"Review and correct the filter configuration to include valid socket information."},{"function":"milter_open","message_template":"Milter (%s): empty or missing socket information","reason":"Similar to previous messages, but logged during operation rather than configuration parsing.","resolution":"Check filter configuration in sendmail.cf or other config files to ensure valid socket information is provided."},{"function":"milter_open","message_template":"Milter (%s): no valid socket protocols available","reason":"None of the supported socket protocols (UNIX, INET, INET6) are available in this build.","resolution":"Rebuild sendmail with support for at least one socket protocol or modify filter to use supported protocols."},{"function":"milter_open","message_template":"X%s: unknown socket type %s","reason":"The socket type specified in the filter configuration is not recognized or supported.","resolution":"Change the socket type to a supported value: 'unix', 'local', 'inet', or 'inet6' depending on available protocols."},{"function":"milter_open","message_template":"X%s: unknown socket type %s","reason":"Same as previous, but logged at a different level. Socket type is not recognized.","resolution":"Modify filter configuration to use a supported socket type."},{"function":"milter_open","message_template":"Milter (%s): unknown socket type %s","reason":"Same as previous messages, but logged during operation rather than configuration parsing.","resolution":"Change the socket type in filter configuration to one of the supported types."},{"function":"milter_open","message_template":"X%s: local socket name %s too long","reason":"The UNIX domain socket path specified is too long for the system limits.","resolution":"Use a shorter path for the UNIX socket. Move it to a directory with a shorter path if necessary."},{"function":"milter_open","message_template":"X%s: local socket name %s too long","reason":"Same as previous, but logged at a different level. Socket path exceeds length limits.","resolution":"Shorten the socket path in filter configuration."},{"function":"milter_open","message_template":"Milter (%s): local socket name %s too long","reason":"Same as previous messages, but logged during operation rather than configuration parsing.","resolution":"Modify filter configuration to use a shorter socket path."},{"function":"milter_open","message_template":"WARNING: X%s: local socket name %s missing","reason":"The UNIX socket file doesn't exist, which might be expected during configuration parsing.","resolution":"Ensure the filter creates the socket file before connections are attempted, or check for permission issues."},{"function":"milter_open","message_template":"X%s: local socket name %s unsafe","reason":"The UNIX socket path has insufficient permissions or other security issues.","resolution":"Check file and directory permissions on the socket path. Ensure it's owned by the correct user and not writable by others."},{"function":"milter_open","message_template":"X%s: local socket name %s unsafe","reason":"Same as previous, but logged at a different level. Socket path has security issues.","resolution":"Adjust permissions or ownership of the socket path to make it secure."},{"function":"milter_open","message_template":"Milter (%s): local socket name %s unsafe","reason":"Same as previous messages, but logged during operation rather than configuration parsing.","resolution":"Fix permissions and ownership of the socket path. May need to run filter as a different user."},{"function":"milter_open","message_template":"X%s: bad address %s (expected port@host)","reason":"For INET\/INET6 sockets, the address format is incorrect. Should be port@host format.","resolution":"Correct the filter address in configuration to use the proper format 'port@host' for network sockets."},{"function":"milter_open","message_template":"X%s: bad address %s (expected port@host)","reason":"Same as previous, but logged at a different level. Address format is incorrect.","resolution":"Modify filter configuration to use the port@host format for network sockets."},{"function":"milter_open","message_template":"Milter (%s): bad address %s (expected port@host)","reason":"Same as previous messages, but logged during operation rather than configuration parsing.","resolution":"Fix the filter address format in configuration files."},{"function":"milter_open","message_template":"X%s: invalid port number %s","reason":"The port number specified for a network socket is not a valid number.","resolution":"Specify a valid port number (1-65535) or a service name in the filter configuration."},{"function":"milter_open","message_template":"X%s: invalid port number %s","reason":"Same as previous, but logged at a different level. Port number is invalid.","resolution":"Correct the port number in filter configuration."},{"function":"milter_open","message_template":"Milter (%s): invalid port number %s","reason":"Same as previous messages, but logged during operation rather than configuration parsing.","resolution":"Change the port number to a valid value in filter configuration."},{"function":"milter_open","message_template":"X%s: unknown port name %s","reason":"The service name specified for the port could not be resolved to a port number.","resolution":"Use a numeric port or a service name that exists in \/etc\/services."},{"function":"milter_open","message_template":"X%s: unknown port name %s","reason":"Same as previous, but logged at a different level. Port name not found.","resolution":"Use a port number or verify the service name exists in system services database."},{"function":"milter_open","message_template":"Milter (%s): unknown port name %s","reason":"Same as previous messages, but logged during operation rather than configuration parsing.","resolution":"Change to a numeric port or valid service name in filter configuration."},{"function":"milter_open","message_template":"X%s: Invalid numeric domain spec \"%s\"","reason":"The IP address format provided in bracket notation is invalid.","resolution":"Correct the IP address format in the filter configuration. For IPv4 use [n.n.n.n] format, for IPv6 use [ipv6:...] format."},{"function":"milter_open","message_template":"X%s: Invalid numeric domain spec \"%s\"","reason":"Same as previous, but logged at a different level. IP address format is invalid.","resolution":"Fix the IP address format in the filter configuration."},{"function":"milter_open","message_template":"Milter (%s): Invalid numeric domain spec \"%s\"","reason":"Same as previous messages, but logged during operation rather than configuration parsing.","resolution":"Correct the IP address format in your filter configuration."},{"function":"milter_open","message_template":"X%s: Unknown host name %s","reason":"The hostname specified for the filter connection could not be resolved to an IP address.","resolution":"Check DNS settings and ensure the hostname is correct and resolvable. Consider using an IP address instead."},{"function":"milter_open","message_template":"X%s: Unknown host name %s","reason":"Same as previous, but logged at a different level. Host name resolution failed.","resolution":"Verify the hostname is correct and resolvable, or use an IP address instead."},{"function":"milter_open","message_template":"Milter (%s): Unknown host name %s","reason":"Same as previous messages, but logged during operation rather than configuration parsing.","resolution":"Check DNS configuration and hostname, or switch to using IP addresses."},{"function":"milter_open","message_template":"X%s: Unknown protocol for %s (%d)","reason":"The address family returned by hostname resolution is not supported (not IPv4 or IPv6).","resolution":"Use a hostname that resolves to IPv4 or IPv6 addresses only, or specify the IP address directly."},{"function":"milter_open","message_template":"X%s: Unknown protocol for %s (%d)","reason":"Same as previous, but logged at a different level. Address family not supported.","resolution":"Use hostnames that resolve to supported address families or specify IP addresses directly."},{"function":"milter_open","message_template":"Milter (%s): Unknown protocol for %s (%d)","reason":"Same as previous messages, but logged during operation rather than configuration parsing.","resolution":"Modify filter configuration to use hostnames that resolve to supported address families."},{"function":"milter_open","message_template":"X%s: unknown socket protocol","reason":"The socket protocol is not recognized or not supported in this build.","resolution":"Check filter configuration and use only supported socket protocols. Rebuild sendmail with support for necessary protocols."},{"function":"milter_open","message_template":"X%s: unknown socket protocol","reason":"Same as previous, but logged at a different level. Socket protocol not supported.","resolution":"Use only supported socket protocols in filter configuration."},{"function":"milter_open","message_template":"Milter (%s): unknown socket protocol","reason":"Same as previous messages, but logged during operation rather than configuration parsing.","resolution":"Change to a supported socket protocol in filter configuration."},{"function":"milter_open","message_template":"Milter (%s): Trying to open filter in state %c","reason":"Attempting to open a filter connection when the filter is in an unexpected state.","resolution":"This indicates a programming error or state corruption. Check for previous errors with this filter."},{"function":"milter_open","message_template":"Milter (%s): error creating socket: %s","reason":"System call to create a socket for filter communication failed.","resolution":"Check system resources, particularly file descriptors. The error message provides specific details to investigate."},{"function":"milter_open","message_template":"Milter (%s): error creating socket: %s","reason":"Same as previous, but logged at a different level. Socket creation failed.","resolution":"Check system resources and limits. The error message provides details about what failed."},{"function":"milter_open","message_template":"milter_open (%s): open %s failed: %s","reason":"Failed to connect to the filter socket, likely because the filter is not running.","resolution":"Verify the filter is running and listening on the specified socket. Check permissions and network settings."},{"function":"milter_open","message_template":"Milter (%s): open %s failed: %s","reason":"More detailed version of the socket open failure message.","resolution":"Ensure the filter is running and accessible. Check permissions, network settings, and filter logs for issues."},{"function":"milter_open","message_template":"X%s: Unknown protocol for %s (%d)","reason":"The protocol returned by hostname resolution is not supported during connection attempt.","resolution":"Use hostnames that resolve to supported protocols or specify IP addresses directly."},{"function":"milter_open","message_template":"Milter (%s): Unknown protocol for %s (%d)","reason":"More detailed version of the protocol error message during connection attempt.","resolution":"Configure filter to use supported protocols or modify hostname resolution."},{"function":"milter_open","message_template":"X%s: error connecting to filter: %s","reason":"Failed to connect to the filter socket after all address resolution attempts.","resolution":"Verify filter is running and listening. Check network connectivity and permissions for the socket."},{"function":"milter_open","message_template":"Milter (%s): error connecting to filter: %s","reason":"More detailed version of the connection error message with specific error information.","resolution":"Check filter process status, socket permissions, and network connectivity based on the error message."},{"function":"milter_setup","message_template":"name required for mail filter","reason":"Attempting to configure a mail filter without specifying a name for it.","resolution":"Provide a name for the filter in the configuration. Format should be 'name, options...'."},{"function":"milter_setup","message_template":"X%s: `=' expected","reason":"The filter configuration syntax is incorrect, missing an equals sign between option and value.","resolution":"Correct the filter configuration syntax to use proper 'option=value' format."},{"function":"milter_setup","message_template":"X%s: unknown filter equate %c=","reason":"The filter configuration contains an unrecognized option letter.","resolution":"Use only valid option letters (S for socket, F for flags, T for timeouts, etc.) in filter configuration."},{"function":"milter_setup","message_template":"X%s: duplicate filter definition","reason":"Multiple filters with the same name were defined, which is not allowed.","resolution":"Use unique names for each filter in your configuration."},{"function":"milter_config","message_template":"Too many filters defined, %d max","reason":"The number of filters defined exceeds the maximum allowed.","resolution":"Reduce the number of filters in your configuration or increase MAXFILTERS at compile time."},{"function":"milter_config","message_template":"InputFilter %s not defined","reason":"A filter is referenced in the InputFilters option but has not been defined using the MAIL_FILTER macro.","resolution":"Define the referenced filter using the MAIL_FILTER macro or remove it from InputFilters."},{"function":"milter_parse_timeouts","message_template":"X%s, T=: `:' expected","reason":"The filter timeout specification syntax is incorrect, missing a colon separator.","resolution":"Correct the timeout specification format to use 'T=X:n;Y:m' syntax."},{"function":"milter_parse_timeouts","message_template":"X%s: unknown filter timeout %c","reason":"The filter timeout specification contains an unrecognized timeout type letter.","resolution":"Use only valid timeout type letters (C, S, R, E) in timeout specifications."},{"function":"milter_set_macros","message_template":"milter_set_option: too many macros in Milter.%s (max %d)","reason":"The number of macros specified for a particular filter stage exceeds the maximum allowed.","resolution":"Reduce the number of macros for that filter stage or increase MAXFILTERMACROS at compile time."},{"function":"milter_set_option","message_template":"milter_set_option: invalid Milter option, must specify suboption","reason":"The Milter option specification is missing a required sub-option.","resolution":"Use the correct format for Milter options, specifying both option and sub-option (e.g., 'Milter.macros.connect')."},{"function":"milter_set_option","message_template":"milter_set_option: invalid Milter option %s","reason":"The Milter option specified is not recognized or supported.","resolution":"Use only valid Milter options as listed in the documentation."},{"function":"milter_set_option","message_template":"WARNING: Milter.%s=%lu, allowed are only %d, %d, and %d","reason":"The value specified for maxdatasize is not one of the allowed values (64K, 256K, 1M).","resolution":"Change the maxdatasize setting to one of the allowed values. The value will be adjusted to the nearest allowed value."},{"function":"milter_set_option","message_template":"milter_set_option: invalid Milter option %s","reason":"Same as previous similar message but in a different code branch.","resolution":"Use only supported Milter options as documented."},{"function":"milter_reopen_df","message_template":"milter_reopen_df: sm_io_open %s: %s","reason":"Failed to open the message data file for writing during body replacement.","resolution":"Check permissions and disk space for the queue directory. Make sure Sendmail has write access to its queue files."},{"function":"milter_reopen_df","message_template":"milter_reopen_df: NULL e_dfp (%s: %s)","reason":"The message data file pointer is NULL when it should be valid.","resolution":"This indicates a programming error or corrupted message state. Check for previous errors with this message."},{"function":"milter_reset_df","message_template":"milter_reset_df: error writing\/flushing %s: %s","reason":"Failed to flush or write to the message data file after body replacement.","resolution":"Check disk space and file system health. Ensure queue directory is writable and has sufficient space."},{"function":"milter_reset_df","message_template":"milter_reset_df: error sync'ing %s: %s","reason":"Failed to synchronize (fsync) the message data file to disk.","resolution":"Check file system health and permissions. May indicate disk full condition or hardware issues."},{"function":"milter_reset_df","message_template":"milter_reset_df: error closing %s: %s","reason":"Failed to close the message data file after writing.","resolution":"Check for file system issues or resource exhaustion. May require system administrator attention."},{"function":"milter_reset_df","message_template":"milter_reset_df: error reopening %s: %s","reason":"Failed to reopen the message data file for reading after writing.","resolution":"Check permissions and file system health. Ensure Sendmail has read access to its queue files."},{"function":"milter_quit_filter","message_template":"milter_quit_filter(%s)","reason":"Debug message indicating a request to close a filter connection.","resolution":"Informational message, no action needed unless debugging connection issues."},{"function":"milter_quit_filter","message_template":"Milter (%s): quit filter","reason":"Informational message that a filter connection is being closed gracefully.","resolution":"No action needed, this is normal operation when connections are ended."},{"function":"milter_abort_filter","message_template":"milter_abort_filter(%s)","reason":"Debug message indicating a request to abort processing for a filter.","resolution":"Informational message, no action needed unless debugging filter issues."},{"function":"milter_abort_filter","message_template":"Milter (%s): abort filter","reason":"Informational message that message processing for a filter is being aborted.","resolution":"No action needed, this is normal operation when a message is rejected or processing is interrupted."},{"function":"milter_send_macros","message_template":"milter_send_macros(%s, %c): %s=%s","reason":"Debug message showing macros being sent to the filter.","resolution":"Informational message, no action needed unless debugging filter communication."},{"function":"milter_send_command","message_template":"milter_send_command(%s): cmd %c len %ld","reason":"Debug message showing a command being sent to the filter.","resolution":"Informational message, no action needed unless debugging filter communication."},{"function":"milter_send_command","message_template":"milter=%s, action=%s, reject=%s","reason":"Informational message that a filter has rejected something with a custom message.","resolution":"Check the rejection message to understand why the filter is rejecting the message. May require configuration changes."},{"function":"milter_send_command","message_template":"milter=%s, action=%s, reject","reason":"Informational message that a filter has rejected something without a custom message.","resolution":"Check filter logs to understand why it's rejecting the message. May require configuration changes."},{"function":"milter_send_command","message_template":"milter=%s, action=%s, discard","reason":"Informational message that a filter has requested to silently discard the message.","resolution":"Check filter logs to understand why it's discarding messages. This is usually intentional behavior for spam or policy violations."},{"function":"milter_send_command","message_template":"milter=%s, action=%s, tempfail","reason":"Informational message that a filter has requested a temporary failure for the message.","resolution":"Check filter logs to understand the temporary condition. The sender will typically retry later."},{"function":"milter_send_command","message_template":"milter=%s, action=%s, accepted","reason":"Informational message that a filter has accepted the message or connection.","resolution":"No action needed, this is normal operation when filters approve messages."},{"function":"milter_send_command","message_template":"milter=%s, action=%s, continue","reason":"Informational message that a filter is allowing processing to continue.","resolution":"No action needed, this is normal operation when filters don't make a final decision yet."},{"function":"milter_send_command","message_template":"milter=%s, action=%s, skip","reason":"Informational message that a filter has requested to skip some processing.","resolution":"No action needed, this is normal when a filter wants to skip parts of message processing (like body scanning)."},{"function":"milter_send_command","message_template":"milter_send_command(%s): action=%s returned bogus response %c","reason":"The filter returned an invalid or unexpected response code to a command.","resolution":"Check filter implementation for protocol compliance. May indicate a bug in the filter or version mismatch."},{"function":"milter_command","message_template":"milter_command: cmd %c len %ld","reason":"Debug message showing a command being processed by the milter system.","resolution":"Informational message, no action needed unless debugging filter communication."},{"function":"milter_command","message_template":"Milter (%s): time command (%c), %d","reason":"Performance monitoring message showing how long a command took to process by a filter.","resolution":"Informational message. If times are consistently high, investigate filter performance issues."},{"function":"milter_getsymlist","message_template":"milter_getsymlist(%s, %s, \"%s\")=%d","reason":"Debug message showing the result of parsing a symbol list from a filter.","resolution":"Informational message, no action needed unless debugging filter negotiation."},{"function":"milter_negotiate","message_template":"Milter (%s): negotiate, impossible state","reason":"Filter is in an invalid state for negotiation, which should not happen.","resolution":"This indicates a programming error or state corruption. Check for previous errors with this filter."},{"function":"milter_negotiate","message_template":"milter_negotiate(%s): send: version %lu, fflags 0x%lx, pflags 0x%lx","reason":"Debug message showing the protocol version and feature flags being sent to a filter.","resolution":"Informational message, no action needed unless debugging filter negotiation."},{"function":"milter_negotiate","message_template":"milter_negotiate(%s): returned %c instead of %c","reason":"Filter returned an unexpected response code during protocol negotiation.","resolution":"Check filter implementation for protocol compliance. May indicate a bug in the filter or version mismatch."},{"function":"milter_negotiate","message_template":"Milter (%s): negotiate: returned %c instead of %c","reason":"More detailed version of the previous message.","resolution":"Check filter implementation for protocol compliance. Filter may not properly implement the milter protocol."},{"function":"milter_negotiate","message_template":"milter_negotiate(%s): did not return valid info","reason":"Filter did not provide valid protocol information during negotiation.","resolution":"Check filter implementation for protocol compliance. May indicate a bug in the filter or corrupted response."},{"function":"milter_negotiate","message_template":"Milter (%s): negotiate: did not return valid info","reason":"More detailed version of the previous message.","resolution":"Verify filter implementation correctly responds to negotiation requests. May require filter updates."},{"function":"milter_negotiate","message_template":"milter_negotiate(%s): did not return enough info","reason":"Filter response during negotiation was truncated or incomplete.","resolution":"Check filter implementation for protocol compliance. May indicate network issues or filter bugs."},{"function":"milter_negotiate","message_template":"Milter (%s): negotiate: did not return enough info","reason":"More detailed version of the previous message.","resolution":"Verify filter implementation properly responds with complete negotiation data. May require filter updates."},{"function":"milter_negotiate","message_template":"milter_negotiate(%s): version %d != MTA milter version %d","reason":"Filter protocol version is incompatible with the MTA's supported version.","resolution":"Update either the filter or Sendmail to versions that use compatible protocol versions."},{"function":"milter_negotiate","message_template":"Milter (%s): negotiate: version %d != MTA milter version %d","reason":"More detailed version of the previous message.","resolution":"Update filter or MTA to ensure protocol version compatibility."},{"function":"milter_negotiate","message_template":"milter_negotiate(%s): filter abilities 0x%x != MTA milter abilities 0x%lx","reason":"Filter requested actions that the MTA does not support.","resolution":"Update filter configuration to only request supported actions, or update MTA to support required features."},{"function":"milter_negotiate","message_template":"Milter (%s): negotiate: filter abilities 0x%x != MTA milter abilities 0x%lx","reason":"More detailed version of the previous message.","resolution":"Adjust filter configuration to request only supported actions or update MTA."},{"function":"milter_negotiate","message_template":"WARNING: Milter.maxdatasize: configured=%lu, set by milter(%s)=%d","reason":"Filter requested a different maximum data size than configured.","resolution":"No action required, the system will adapt to the filter's request. Informational only."},{"function":"milter_negotiate","message_template":"milter_negotiate(%s): protocol abilities 0x%x != MTA milter abilities 0x%lx","reason":"Filter requested protocol features that the MTA does not support.","resolution":"Update filter configuration to only use supported protocol features, or update MTA to support required features."},{"function":"milter_negotiate","message_template":"Milter (%s): negotiate: protocol abilities 0x%x != MTA milter abilities 0x%lx","reason":"More detailed version of the previous message.","resolution":"Adjust filter to use only supported protocol features or update MTA."},{"function":"milter_negotiate","message_template":"milter_negotiate(%s): received: version %u, fflags 0x%x, pflags 0x%x","reason":"Debug message showing the negotiation parameters received from a filter.","resolution":"Informational message, no action needed unless debugging filter negotiation."},{"function":"milter_error","message_template":"Milter (%s): to error state","reason":"A filter is being marked as in error state due to a communication or protocol issue.","resolution":"Check filter logs and previous error messages to determine the cause. May require restarting filter or fixing configuration."},{"function":"milter_headers","message_template":"Milter (%s): headers, send","reason":"Informational message that message headers are being sent to a filter.","resolution":"No action needed, this is normal operation during message processing."},{"function":"milter_headers","message_template":"milter_headers: %s:%s","reason":"Debug message showing a header being sent to a filter.","resolution":"Informational message, no action needed unless debugging header processing."},{"function":"milter_headers","message_template":"Milter (%s): header, %s","reason":"More detailed message about a specific header being sent to a filter.","resolution":"Informational message, no action needed unless debugging header processing."},{"function":"milter_headers","message_template":"Milter (%s): headers, sent","reason":"Informational message that all message headers have been sent to a filter.","resolution":"No action needed, this is normal operation during message processing."},{"function":"milter_body","message_template":"milter_body","reason":"Debug message indicating the body processing function has been called.","resolution":"Informational message, no action needed unless debugging body processing."},{"function":"milter_body","message_template":"milter_body: %s\/%cf%s: rewind error","reason":"Failed to rewind the message data file before sending body to filter.","resolution":"Check file system health and permissions. May indicate a file corruption or disk issue."},{"function":"milter_body","message_template":"Milter (%s): body, send","reason":"Informational message that message body is being sent to a filter.","resolution":"No action needed, this is normal operation during message processing."},{"function":"milter_body","message_template":"milter_body: %s\/%cf%s: read error","reason":"Failed to read from the message data file while sending body to filter.","resolution":"Check file system health and permissions. May indicate a file corruption or disk issue."},{"function":"milter_body","message_template":"Milter (%s): body, sent","reason":"Informational message that message body has been sent to a filter.","resolution":"No action needed, this is normal operation during message processing."},{"function":"milter_addheader","message_template":"NULL response","reason":"Received a NULL response when processing an add header request from a filter.","resolution":"Check filter implementation for protocol compliance. May indicate a bug in the filter."},{"function":"milter_addheader","message_template":"didn't follow protocol (total len %d != rlen %d)","reason":"Filter response for adding a header doesn't match expected protocol format.","resolution":"Check filter implementation for protocol compliance. Filter may be sending malformed commands."},{"function":"milter_addheader","message_template":"didn't follow protocol (part len)","reason":"Filter response for adding a header has inconsistent internal length values.","resolution":"Check filter implementation for protocol compliance. Filter may be sending malformed data."},{"function":"milter_addheader","message_template":"empty field name","reason":"Filter requested adding a header with an empty field name, which is invalid.","resolution":"Check filter implementation. Filter should provide a valid field name for headers."},{"function":"milter_addheader","message_template":"Replace default header %s value with %s","reason":"Debug message showing a default header being replaced with a new value.","resolution":"Informational message, no action needed unless debugging header modifications."},{"function":"milter_addheader","message_template":"Milter (%s) change: default header %s value with %s","reason":"More detailed message about a default header being replaced.","resolution":"No action needed, this is normal operation when filters modify default headers."},{"function":"milter_addheader","message_template":"Add %s: %s","reason":"Debug message showing a new header being added to the message.","resolution":"Informational message, no action needed unless debugging header additions."},{"function":"milter_addheader","message_template":"Milter (%s) add: header: %s: %s","reason":"More detailed message about a header being added by a filter.","resolution":"No action needed, this is normal operation when filters add headers."},{"function":"milter_insheader","message_template":"NULL response","reason":"Received a NULL response when processing an insert header request from a filter.","resolution":"Check filter implementation for protocol compliance. May indicate a bug in the filter."},{"function":"milter_insheader","message_template":"didn't follow protocol (total len)","reason":"Filter response for inserting a header doesn't match expected protocol format.","resolution":"Check filter implementation for protocol compliance. Filter may be sending malformed commands."},{"function":"milter_insheader","message_template":"didn't follow protocol (part len)","reason":"Filter response for inserting a header has inconsistent internal length values.","resolution":"Check filter implementation for protocol compliance. Filter may be sending malformed data."},{"function":"milter_insheader","message_template":"empty field name","reason":"Filter requested inserting a header with an empty field name, which is invalid.","resolution":"Check filter implementation. Filter should provide a valid field name for headers."},{"function":"milter_insheader","message_template":"Insert (%d) %s: %s","reason":"Debug message showing a header being inserted at a specific position.","resolution":"Informational message, no action needed unless debugging header insertions."},{"function":"milter_insheader","message_template":"Milter (%s) insert (%d): header: %s: %s","reason":"More detailed message about a header being inserted by a filter.","resolution":"No action needed, this is normal operation when filters insert headers."},{"function":"milter_changeheader","message_template":"NULL response","reason":"Received a NULL response when processing a change header request from a filter.","resolution":"Check filter implementation for protocol compliance. May indicate a bug in the filter."},{"function":"milter_changeheader","message_template":"didn't follow protocol (total len)","reason":"Filter response for changing a header doesn't match expected protocol format.","resolution":"Check filter implementation for protocol compliance. Filter may be sending malformed commands."},{"function":"milter_changeheader","message_template":"didn't follow protocol (part len)","reason":"Filter response for changing a header has inconsistent internal length values.","resolution":"Check filter implementation for protocol compliance. Filter may be sending malformed data."},{"function":"milter_changeheader","message_template":"empty field name","reason":"Filter requested changing a header with an empty field name, which is invalid.","resolution":"Check filter implementation. Filter should provide a valid field name for headers."},{"function":"milter_changeheader","message_template":"Delete (noop) %s","reason":"Debug message showing an attempt to delete a non-existent header.","resolution":"No action required. This is normal when filter tries to delete a header that doesn't exist in the message."},{"function":"milter_changeheader","message_template":"Milter (%s) delete (noop): header: %s","reason":"More detailed message about an attempt to delete a non-existent header.","resolution":"No action required. This is expected when filter tries to delete a header that doesn't exist."},{"function":"milter_changeheader","message_template":"Add %s: %s","reason":"Debug message showing a header being added when change was requested but header didn't exist.","resolution":"No action required. This is normal behavior when filter tries to change a header that doesn't exist."},{"function":"milter_changeheader","message_template":"Milter (%s) change (add): header: %s: %s","reason":"More detailed message about a header being added instead of changed.","resolution":"No action required. This happens when filter tries to change a non-existent header."},{"function":"milter_changeheader","message_template":"Delete%s %s:%s","reason":"Debug message showing a header being deleted by a filter.","resolution":"Informational message, no action needed unless debugging header deletions."},{"function":"milter_changeheader","message_template":"Change%s %s: from %s to %s","reason":"Debug message showing a header value being changed by a filter.","resolution":"Informational message, no action needed unless debugging header modifications."},{"function":"milter_changeheader","message_template":"Milter (%s) delete: header%s %s:%s","reason":"More detailed message about a header being deleted by a filter.","resolution":"No action needed, this is normal operation when filters delete headers."},{"function":"milter_changeheader","message_template":"Milter (%s) change: header%s %s: from %s to %s","reason":"More detailed message about a header being modified by a filter.","resolution":"No action needed, this is normal operation when filters modify headers."},{"function":"milter_split_response","message_template":"didn't follow protocol (total len %d != rlen %d)","reason":"Filter response for a multi-argument command doesn't match expected protocol format.","resolution":"Check filter implementation for protocol compliance. Filter may be sending malformed data."},{"function":"milter_split_response","message_template":"argv[%d]=\"%s\"","reason":"Debug message showing the parsed arguments from a filter response.","resolution":"Informational message, no action needed unless debugging filter responses."},{"function":"milter_chgfrom","message_template":"NULL response","reason":"Received a NULL response when processing a change sender request from a filter.","resolution":"Check filter implementation for protocol compliance. May indicate a bug in the filter."},{"function":"milter_chgfrom","message_template":"didn't follow protocol (total len %d != rlen %d)","reason":"Filter response for changing sender doesn't match expected protocol format.","resolution":"Check filter implementation for protocol compliance. Filter may be sending malformed data."},{"function":"milter_chgfrom","message_template":"%s","reason":"Debug message showing the new sender address.","resolution":"Informational message, no action needed unless debugging sender changes."},{"function":"milter_chgfrom","message_template":"Milter (%s) chgfrom: %s","reason":"More detailed message about sender address being changed by a filter.","resolution":"No action needed, this is normal operation when filters change the sender."},{"function":"milter_chgfrom","message_template":"didn't follow protocol argc=%d","reason":"Filter response for changing sender has an invalid number of arguments.","resolution":"Check filter implementation for protocol compliance. Filter may be sending malformed data."},{"function":"milter_addrcpt_par","message_template":"NULL response","reason":"Received a NULL response when processing an add recipient with parameters request.","resolution":"Check filter implementation for protocol compliance. May indicate a bug in the filter."},{"function":"milter_addrcpt_par","message_template":"%s","reason":"Debug message showing the recipient being added with parameters.","resolution":"Informational message, no action needed unless debugging recipient additions."},{"function":"milter_addrcpt_par","message_template":"Milter (%s) add: rcpt: %s","reason":"More detailed message about a recipient being added by a filter with parameters.","resolution":"No action needed, this is normal operation when filters add recipients."},{"function":"milter_addrcpt_par","message_template":"didn't follow protocol argc=%d","reason":"Filter response for adding recipient has an invalid number of arguments.","resolution":"Check filter implementation for protocol compliance. Filter may be sending malformed data."},{"function":"milter_addrcpt","message_template":"NULL response","reason":"Received a NULL response when processing an add recipient request from a filter.","resolution":"Check filter implementation for protocol compliance. May indicate a bug in the filter."},{"function":"milter_addrcpt","message_template":"didn't follow protocol (total len %d != rlen %d)","reason":"Filter response for adding recipient doesn't match expected protocol format.","resolution":"Check filter implementation for protocol compliance. Filter may be sending malformed data."},{"function":"milter_addrcpt","message_template":"%s","reason":"Debug message showing the recipient being added.","resolution":"Informational message, no action needed unless debugging recipient additions."},{"function":"milter_addrcpt","message_template":"Milter (%s) add: rcpt: %s","reason":"More detailed message about a recipient being added by a filter.","resolution":"No action needed, this is normal operation when filters add recipients."},{"function":"milter_delrcpt","message_template":"NULL response","reason":"Received a NULL response when processing a delete recipient request from a filter.","resolution":"Check filter implementation for protocol compliance. May indicate a bug in the filter."},{"function":"milter_delrcpt","message_template":"didn't follow protocol (total len %d != rlen %d)","reason":"Filter response for deleting recipient doesn't match expected protocol format.","resolution":"Check filter implementation for protocol compliance. Filter may be sending malformed data."},{"function":"milter_delrcpt","message_template":"%s","reason":"Debug message showing the recipient being deleted.","resolution":"Informational message, no action needed unless debugging recipient deletions."},{"function":"milter_delrcpt","message_template":"Milter (%s) delete: rcpt %s, naddrs=%d","reason":"More detailed message about a recipient being deleted by a filter.","resolution":"No action needed, this is normal operation when filters delete recipients."},{"function":"milter_replbody","message_template":"milter_replbody","reason":"Debug message indicating the body replacement function has been called.","resolution":"Informational message, no action needed unless debugging body replacement."},{"function":"milter_replbody","message_template":"milter_replbody: sm_io truncate %s: %s","reason":"Failed to truncate the message data file during body replacement.","resolution":"Check file system permissions and disk space. May indicate file system issues or permission problems."},{"function":"milter_replbody","message_template":"milter_replbody: sm_io_seek %s: %s","reason":"Failed to seek within the message data file during body replacement.","resolution":"Check file system health and permissions. May indicate file corruption or disk issues."},{"function":"milter_replbody","message_template":"milter_replbody: ftruncate not available on this platform (%s:%s)","reason":"The ftruncate function needed for body replacement is not available on this platform.","resolution":"Body replacement cannot work on this platform. Use a different platform or rebuild with ftruncate support."},{"function":"milter_replbody","message_template":"milter_replbody: sm_io ftruncate %s: %s","reason":"Failed to truncate the message data file using ftruncate during body replacement.","resolution":"Check file system permissions and disk space. May indicate file system issues or permission problems."},{"function":"milter_replbody","message_template":"Milter (%s) message: body replaced","reason":"Informational message that a filter has successfully replaced the message body.","resolution":"No action needed, this is normal operation when filters modify message bodies."},{"function":"milter_init","message_template":"milter_init","reason":"Debug message indicating the milter initialization function has been called.","resolution":"Informational message, no action needed unless debugging filter initialization."},{"function":"milter_init","message_template":"Milter: no active filter","reason":"No mail filters are configured or active for this message.","resolution":"If filters should be active, check filter configuration. Otherwise, this is normal operation."},{"function":"milter_init","message_template":"milter_init(%s): failed to %s","reason":"Failed to initialize a filter due to connection or negotiation failure.","resolution":"Check if the filter is running and accessible. Check network connectivity and filter logs."},{"function":"milter_init","message_template":"Milter (%s): init failed to %s","reason":"More detailed message about filter initialization failure.","resolution":"Verify filter is running and accessible. Check configurations and network settings."},{"function":"milter_init","message_template":"Milter (%s): init success to %s","reason":"Filter was successfully initialized and negotiated.","resolution":"No action needed, this is normal operation when filters start correctly."},{"function":"milter_connect","message_template":"milter_connect(%s)","reason":"Debug message indicating the connect event is being sent to filters.","resolution":"Informational message, no action needed unless debugging connection processing."},{"function":"milter_connect","message_template":"Milter: connect to filters","reason":"Informational message that connection information is being sent to filters.","resolution":"No action needed, this is normal operation during SMTP connection handling."},{"function":"milter_connect","message_template":"Milter: connect, ending","reason":"Connection processing is ending because a filter rejected or made a final decision.","resolution":"Check previous messages to determine which filter rejected the connection and why."},{"function":"milter_helo","message_template":"milter_helo(%s)","reason":"Debug message indicating the HELO\/EHLO event is being sent to filters.","resolution":"Informational message, no action needed unless debugging HELO processing."},{"function":"milter_envfrom","message_template":"milter_envfrom","reason":"Debug message indicating the MAIL FROM event is being sent to filters.","resolution":"Informational message, no action needed unless debugging MAIL FROM processing."},{"function":"milter_envfrom","message_template":"Milter: reject, no sender","reason":"The MAIL FROM command has no sender address, which is invalid.","resolution":"Check client behavior. SMTP clients should not send MAIL FROM without an address."},{"function":"milter_envfrom","message_template":"Milter: sender: %s","reason":"Informational message showing the sender address being processed.","resolution":"No action needed, this is normal operation during MAIL FROM processing."},{"function":"milter_envfrom","message_template":"Milter: reject, sender","reason":"A filter has rejected the message based on the sender address.","resolution":"Check filter logs to determine which filter rejected the sender and why. May be policy or spam prevention."},{"function":"milter_envrcpt","message_template":"milter_envrcpt","reason":"Debug message indicating the RCPT TO event is being sent to filters.","resolution":"Informational message, no action needed unless debugging RCPT TO processing."},{"function":"milter_envrcpt","message_template":"Milter: reject, no rcpt","reason":"The RCPT TO command has no recipient address, which is invalid.","resolution":"Check client behavior. SMTP clients should not send RCPT TO without an address."},{"function":"milter_envrcpt","message_template":"Milter: rcpts: %s","reason":"Informational message showing the recipient address being processed.","resolution":"No action needed, this is normal operation during RCPT TO processing."},{"function":"milter_data_cmd","message_template":"milter_data_cmd","reason":"Debug message indicating the DATA command event is being sent to filters.","resolution":"Informational message, no action needed unless debugging DATA command processing."},{"function":"milter_data","message_template":"milter_data","reason":"Debug message indicating the message body and EOM events are being processed.","resolution":"Informational message, no action needed unless debugging message content processing."},{"function":"milter_data","message_template":"milter_data: eoh","reason":"Debug message indicating the end-of-headers marker is being sent to filters.","resolution":"Informational message, no action needed unless debugging message processing."},{"function":"milter_data","message_template":"milter_data(%s): EOM ACK\/NAK timeout","reason":"A timeout occurred waiting for the filter to acknowledge the end of message.","resolution":"Check filter performance and responsiveness. May need to increase timeout values or fix filter issues."},{"function":"milter_data","message_template":"milter_data(%s): EOM ACK\/NAK timeout","reason":"Same as previous, but logged at a different level.","resolution":"Investigate filter performance issues or increase timeout settings if filter is normally slow."},{"function":"milter_data","message_template":"milter_data(%s): state %c","reason":"Debug message showing the current filter state during message processing.","resolution":"Informational message, no action needed unless debugging filter state."},{"function":"milter_data","message_template":"milter=%s, reject=%s","reason":"A filter has rejected the message with a custom rejection message.","resolution":"Check the rejection message to understand why the filter rejected the message. May need policy adjustments."},{"function":"milter_data","message_template":"milter=%s, reject","reason":"A filter has rejected the message without a custom message.","resolution":"Check filter logs to understand why it's rejecting messages. May need configuration changes."},{"function":"milter_data","message_template":"milter=%s, discard","reason":"A filter has requested to silently discard the message.","resolution":"This is usually intentional behavior for spam or policy violations. Check filter logs if unexpected."},{"function":"milter_data","message_template":"milter=%s, tempfail","reason":"A filter has requested a temporary failure for the message.","resolution":"Check filter logs to understand the temporary condition. The sender will typically retry later."},{"function":"milter_data","message_template":"milter_data(%s): lied about quarantining, honoring request anyway","reason":"Filter requested quarantine but didn't declare this capability during negotiation.","resolution":"Update filter to properly declare its capabilities, but no immediate action needed as request is being honored."},{"function":"milter_data","message_template":"milter=%s, quarantine=%s","reason":"A filter has requested to quarantine the message with a reason.","resolution":"Check quarantine settings and the reason provided. This is normal for suspicious messages."},{"function":"milter_data","message_template":"milter_data(%s): lied about adding headers, honoring request anyway","reason":"Filter requested adding headers but didn't declare this capability during negotiation.","resolution":"Update filter to properly declare its capabilities, but no immediate action needed as request is being honored."},{"function":"milter_data","message_template":"milter_data(%s): lied about adding headers, honoring request anyway","reason":"Same as previous, but for a different code path.","resolution":"Update filter to properly declare its capabilities during negotiation."},{"function":"milter_data","message_template":"milter_data(%s): lied about changing headers, honoring request anyway","reason":"Filter requested changing headers but didn't declare this capability during negotiation.","resolution":"Update filter to properly declare its capabilities, but no immediate action needed as request is being honored."},{"function":"milter_data","message_template":"milter_data(%s) lied about changing sender, honoring request anyway","reason":"Filter requested changing the sender but didn't declare this capability during negotiation.","resolution":"Update filter to properly declare its capabilities, but no immediate action needed as request is being honored."},{"function":"milter_data","message_template":"milter_data(%s) lied about adding recipients, honoring request anyway","reason":"Filter requested adding recipients but didn't declare this capability during negotiation.","resolution":"Update filter to properly declare its capabilities, but no immediate action needed as request is being honored."},{"function":"milter_data","message_template":"milter_data(%s) lied about adding recipients with parameters, honoring request anyway","reason":"Filter requested adding recipients with parameters but didn't declare this capability.","resolution":"Update filter to properly declare its capabilities, but no immediate action needed as request is being honored."},{"function":"milter_data","message_template":"milter_data(%s): lied about removing recipients, honoring request anyway","reason":"Filter requested removing recipients but didn't declare this capability during negotiation.","resolution":"Update filter to properly declare its capabilities, but no immediate action needed as request is being honored."},{"function":"milter_data","message_template":"milter_data(%s): lied about replacing body, rejecting request and tempfailing message","reason":"Filter requested replacing the message body but didn't declare this capability. Request is rejected.","resolution":"Update filter to properly declare the body replacement capability during negotiation to enable this feature."},{"function":"milter_data","message_template":"milter_data(%s): returned bogus response %c","reason":"Filter returned an invalid or unexpected response code during message processing.","resolution":"Check filter implementation for protocol compliance. May indicate a bug in the filter or version mismatch."},{"function":"milter_data","message_template":"milter_data: %s\/%cf%s: read error","reason":"Failed to read from the message data file during processing.","resolution":"Check file system health and permissions. May indicate a file corruption or disk issue."},{"function":"milter_data","message_template":"Milter: reject, data","reason":"A filter has rejected the message during or after DATA processing.","resolution":"Check filter logs to determine which filter rejected the message and why."},{"function":"milter_unknown","message_template":"milter_unknown(%s)","reason":"Debug message indicating an unknown SMTP command is being sent to filters.","resolution":"Informational message, no action needed unless debugging unknown command handling."},{"function":"milter_quit","message_template":"milter_quit(%s)","reason":"Debug message indicating the QUIT command is being processed or connections are being closed.","resolution":"Informational message, no action needed unless debugging connection termination."},{"function":"milter_abort","message_template":"milter_abort","reason":"Debug message indicating message processing is being aborted for filters.","resolution":"Informational message, no action needed unless debugging message abortion."}]}