{"project":"sendmail","module":"mime.c","summary":"This module handles MIME encoding conversions, particularly between 7-bit and 8-bit representations. It implements functions to encode 8-bit MIME content into 7-bit formats (base64, quoted-printable) and decode 7-bit MIME back to 8-bit, while handling multipart messages and boundaries.","logs":[{"function":"mime8to7","message_template":"mime8to7: too deep, level=%d","reason":"Log message emitted when MIME nesting level exceeds the maximum allowed depth, which could indicate a malformed or malicious email.","resolution":"This could indicate a maliciously crafted email or a misconfigured email client. Check the original message source and consider adjusting MAXMIMENESTING if appropriate."},{"function":"mime8to7","message_template":"mime8to7: recursion level %d exceeded","reason":"User error reported when the MIME nesting level recursion is too deep, causing the processing to fail.","resolution":"This is likely due to a malformed email with too many nested MIME parts. The email will be processed with the EF_DONT_MIME flag, which may affect how it's displayed to recipients."},{"function":"mime8to7","message_template":"mime8to7: flags = %x, boundaries =","reason":"Debug log that shows the current flags and boundaries during MIME processing.","resolution":"Informational debug log, no resolution required."},{"function":"mime8to7","message_template":"mime8to7: Empty parameter in Content-Type header","reason":"User error reported when a Content-Type header contains an empty parameter, indicating a malformed MIME message.","resolution":"The email will be processed with the EF_DONT_MIME flag to avoid bounce loops. Check the sender's email client for compliance with MIME standards."},{"function":"mime8to7","message_template":"mime8to7: Content-Type: \"%s\": %s boundary","reason":"User error reported when a Content-Type header for a multipart message has a missing or bogus boundary parameter.","resolution":"The system will use a default boundary (\"---\") and process the email with the EF_DONT_MIME flag. This indicates a malformed message from the sender's client."},{"function":"mime8to7","message_template":"mime8to7: multipart boundary \"%s\" too long","reason":"User error reported when a multipart boundary string exceeds the buffer size, which could lead to buffer overflow.","resolution":"The email will be processed with the EF_DONT_MIME flag. This could be due to a malicious email or a misconfigured client. Check the sender's system."},{"function":"mime8to7","message_template":"mime8to7: multipart boundary \"%s\"","reason":"Debug log showing the current multipart boundary being processed.","resolution":"Informational debug log, no resolution required."},{"function":"mime8to7","message_template":"mime8to7: too deep, i=%d","reason":"Debug log indicating that the nesting level of MIME boundaries has exceeded the allowed maximum.","resolution":"Informational debug log, but could indicate a problem with deeply nested MIME messages. Check for malformed or malicious emails."},{"function":"mime8to7","message_template":"mime8to7: multipart nesting boundary too deep","reason":"User error when multipart nesting exceeds the maximum allowed depth (MAXMIMENESTING), indicating a possible error in message structure.","resolution":"The email will be processed with the EF_DONT_MIME and EF_TOODEEP flags. Check for malicious emails or increase MAXMIMENESTING if needed."},{"function":"mime8to7","message_template":"mime8to7: cannot sm_io_tell on %cf%s","reason":"System error when unable to determine the current position in the message file, which prevents proper MIME processing.","resolution":"This may indicate a problem with file descriptors or disk space. Check system resources and file permissions."},{"function":"mime8to7","message_template":"mime8to7: cannot sm_io_fseek on %cf%s","reason":"System error when unable to reposition within the message file, which prevents proper MIME processing.","resolution":"Check for file system errors, insufficient disk space, or permission issues that might prevent seeking within temporary files."},{"function":"mime8to7","message_template":"mime8to7: %ld high bit(s) in %ld byte(s), cte=%s, type=%s\/%s","reason":"Debug log showing statistics about high-bit characters in the message, which helps determine the appropriate encoding method.","resolution":"Informational debug log, no resolution required."},{"function":"mime8to7","message_template":"mime8to7=>%s (multipart)","reason":"Debug log indicating the completion of multipart MIME processing with the result type.","resolution":"Informational debug log, no resolution required."},{"function":"mime8to7","message_template":"mime8to7=>%s (basic)","reason":"Debug log indicating the completion of basic (non-multipart) MIME processing with the result type.","resolution":"Informational debug log, no resolution required."},{"function":"mimeboundary","message_template":"mimeboundary: line=\"%s\"... ","reason":"Debug log showing the current line being examined as a potential MIME boundary.","resolution":"Informational debug log, no resolution required."},{"function":"mime7to8","message_template":"mime7to8: unparsable CTE %s","reason":"User error when the Content-Transfer-Encoding header contains a value that cannot be parsed, preventing proper decoding.","resolution":"The message will be processed with the EF_DONT_MIME flag. This is likely due to a malformed email from the sender's client."},{"function":"mime7to8","message_template":"mime7to8 => %s to 8bit done","reason":"Debug log indicating successful conversion from 7-bit encoding to 8-bit.","resolution":"Informational debug log, no resolution required."},{"function":"mime7to8","message_template":"Content-Transfer-Encoding: 8bit","reason":"Information added to headers when content is converted to 8-bit encoding.","resolution":"Informational header change, no resolution required."},{"function":"mime7to8","message_template":"X-MIME-Autoconverted: from %.200s to 8bit by %s id %s","reason":"Header added to indicate automatic conversion from a specified encoding to 8-bit by the mail server.","resolution":"Informational header addition, no resolution required."}]}