{"project":"sendmail","module":"parseaddr.c","summary":"The parseaddr module handles email address parsing, validation, and transformation. It processes addresses through rulesets, validates syntax, applies rewriting rules, and maps addresses for delivery. It's central to Sendmail's routing decisions and address canonicalization.","logs":[{"function":"parseaddr","message_template":"can't find queue group name %s, selection ignored","reason":"A queue group specified in QUEUEGROUP ruleset couldn't be found, so the selection is ignored.","resolution":"Check that all queue groups referenced in rulesets are defined in the configuration file. Verify ruleset syntax and queue group names."},{"function":"parseaddr","message_template":"queue group name %s -> %d","reason":"Debugging info showing the mapping of a queue group name to its internal ID number.","resolution":"Informational log, no resolution required."},{"function":"parseaddr","message_template":"Transient parse error -- message queued for future delivery","reason":"A temporary error occurred during address parsing, causing the message to be queued.","resolution":"Check for temporary resource issues or DNS problems that might cause parsing failures. The message will be retried later automatically."},{"function":"parseaddr","message_template":"Deferring message until queue run","reason":"Message processing is being deferred until the next queue run because of sendmode=defer.","resolution":"This is expected behavior when the server is configured to defer messages. No action required unless this is not the intended behavior."},{"function":"invalidaddr","message_template":"553 5.1.0 Address \"%s\" too long (%d bytes max)","reason":"The email address exceeds the maximum allowed length (usually MAXNAME-1).","resolution":"Modify the address to be shorter or increase MAXNAME parameter in Sendmail configuration if appropriate. Generally, users need to use shorter email addresses."},{"function":"invalidaddr","message_template":"501 5.1.3 8-bit character in mailbox address \"%s\"","reason":"The recipient address contains 8-bit characters which are not allowed when EightBitAddrOK is disabled.","resolution":"Either remove 8-bit characters from the address or enable the EightBitAddrOK option in Sendmail configuration if 8-bit addresses should be accepted."},{"function":"invalidaddr","message_template":"501 5.1.7 8-bit character in mailbox address \"%s\"","reason":"The sender address contains 8-bit characters which are not allowed when EightBitAddrOK is disabled.","resolution":"Either remove 8-bit characters from the address or enable the EightBitAddrOK option in Sendmail configuration if 8-bit addresses should be accepted."},{"function":"hasctrlchar","message_template":"501 5.1.3 Syntax error in mailbox address \"%s\" (%s)","reason":"The recipient address contains syntax errors such as non-printable characters, unbalanced quotes, or other invalid elements.","resolution":"Correct the syntax of the email address. This usually requires the sender to provide a properly formatted address."},{"function":"hasctrlchar","message_template":"501 5.1.7 Syntax error in mailbox address \"%s\" (%s)","reason":"The sender address contains syntax errors such as non-printable characters, unbalanced quotes, or other invalid elements.","resolution":"Correct the syntax of the email address. The sending mail client may need to be configured correctly or upgraded."},{"function":"prescan","message_template":"553 5.1.1 Address too long","reason":"During token processing, the email address exceeded the maximum allowed length.","resolution":"Use a shorter email address. If this happens with valid addresses, check if the Sendmail configuration needs adjustment for your environment."},{"function":"prescan","message_template":"553 Unbalanced '\"'","reason":"The email address has an unbalanced (unclosed) quote character.","resolution":"Fix the address to ensure all quotes are properly balanced. This is typically a user error in address formatting."},{"function":"prescan","message_template":"553 Unbalanced '('","reason":"The email address has an unbalanced (unclosed) parenthesis.","resolution":"Fix the address to ensure all parentheses are properly balanced. This is typically a user error in address formatting."},{"function":"prescan","message_template":"553 Unbalanced '<'","reason":"The email address has an unbalanced (unclosed) angle bracket.","resolution":"Fix the address to ensure all angle brackets are properly paired. This is typically a user error in address formatting."},{"function":"prescan","message_template":"553 Unbalanced ')'","reason":"The email address has an unmatched closing parenthesis.","resolution":"Fix the address to ensure all parentheses are properly balanced. This is typically a user error in address formatting."},{"function":"prescan","message_template":"553 Unbalanced '>'","reason":"The email address has an unmatched closing angle bracket.","resolution":"Fix the address to ensure all angle brackets are properly paired. This is typically a user error in address formatting."},{"function":"prescan","message_template":"553 Illegal character %c","reason":"A printable but illegal character was found in the email address.","resolution":"Remove the illegal character from the address. Some special characters are not allowed in email addresses."},{"function":"prescan","message_template":"553 Illegal character 0x%02x","reason":"A non-printable illegal character (shown as hex code) was found in the email address.","resolution":"Remove the illegal character from the address. Non-printable characters should not appear in email addresses."},{"function":"prescan","message_template":"553 5.1.0 prescan: too many tokens","reason":"The address has too many tokens and exceeds the MAXATOM limit.","resolution":"Simplify the email address. Complex addresses with many components are not supported."},{"function":"prescan","message_template":"553 5.1.0 prescan: token too long","reason":"A token in the address exceeds the maximum allowed length (MAXNAME).","resolution":"Use shorter components in the email address. This might be triggered by very long domain names or local parts."},{"function":"rewrite","message_template":"554 5.3.5 rewrite: illegal ruleset number %d","reason":"An attempt was made to use a ruleset with an invalid number.","resolution":"Fix the ruleset reference in the configuration. Ruleset numbers must be within valid range (0 to MAXRWSETS-1)."},{"function":"rewrite","message_template":"rewrite: excessive recursion (max %d), ruleset %s","reason":"Ruleset processing has exceeded the maximum recursion level (MaxRuleRecursion).","resolution":"Simplify ruleset definitions to avoid deep recursion, or increase MaxRuleRecursion in configuration if appropriate."},{"function":"rewrite","message_template":"554 5.3.5 Infinite loop in ruleset %s, rule %d","reason":"A ruleset is caught in an infinite loop, detected after 100 iterations.","resolution":"Fix the ruleset configuration to avoid infinite recursion. Look for patterns that continually match and rewrite to the same form."},{"function":"rewrite","message_template":"554 5.3.5 rewrite: ruleset %s: replacement $%c out of bounds","reason":"A replacement pattern in the ruleset refers to a non-existent match.","resolution":"Fix the ruleset definition. The replacement pattern refers to a numbered match that doesn't exist in the pattern."},{"function":"rewrite","message_template":"554 5.3.0 rewrite: expansion too long","reason":"The result of applying rewrite rules has become too long.","resolution":"Adjust the ruleset to prevent excessive expansion of addresses. This may indicate a poorly designed ruleset."},{"function":"rewrite","message_template":"rewrite: expansion too long, ruleset=%s, ruleno=%d","reason":"The rewrite expansion for a specific ruleset and rule number has exceeded buffer limits.","resolution":"Modify the specified rule to avoid excessive expansion of the address. The rule may need to be simplified."},{"function":"rewrite","message_template":"554 5.3.0 rewrite: missing mapname","reason":"A map lookup was attempted but no map name was provided.","resolution":"Fix the ruleset definition to include a map name in the lookup operation. This is a configuration error."},{"function":"rewrite","message_template":"554 5.3.0 rewrite: map %s not found","reason":"The map referenced in a rewrite rule doesn't exist.","resolution":"Check the configuration to ensure the map is properly defined or correct the map name in the rewrite rule."},{"function":"rewrite","message_template":"554 5.3.0 rewrite: missing key for map %s","reason":"A map lookup was attempted but no key was provided.","resolution":"Fix the ruleset to provide a lookup key for the map operation. This is a configuration error."},{"function":"rewrite","message_template":"554 5.3.5 Unknown ruleset %s","reason":"A ruleset name referenced in the configuration doesn't exist.","resolution":"Check the configuration to ensure the ruleset is properly defined or correct the ruleset name reference."},{"function":"rewrite","message_template":"554 5.3.0 Too many subroutine calls (%d max)","reason":"The maximum number of subroutine calls (MAX_SUBR) has been exceeded during ruleset processing.","resolution":"Simplify ruleset definitions to reduce the number of subroutine calls, or increase MAX_SUBR in the code if appropriate."},{"function":"map_lookup","message_template":"%.80s map: lookup (%s): deferred","reason":"A map lookup has been deferred due to a temporary failure, likely a resource issue.","resolution":"Check the resources required by the map (e.g., DNS, database) to ensure they are functioning properly. The operation will be retried later."},{"function":"buildaddr","message_template":"554 5.3.5 buildaddr: no mailer in parsed address","reason":"The parsed address doesn't contain a mailer specification.","resolution":"This usually indicates a programming error or corrupted internal address structure. Check ruleset definitions that process addresses."},{"function":"buildaddr","message_template":"554 5.3.5 buildaddr: no user","reason":"The parsed address is missing the user part.","resolution":"This usually indicates a programming error or incomplete address specification. Check ruleset definitions that process addresses."},{"function":"buildaddr","message_template":"553 5.3.0 %s","reason":"An error occurred during address building, with a specific error message.","resolution":"The specific error message provides details on what went wrong. Address the particular issue mentioned in the error."},{"function":"buildaddr","message_template":"554 5.3.5 buildaddr: unknown mailer %s","reason":"The specified mailer in the address doesn't exist.","resolution":"Check the mailer definition in the configuration to ensure it exists and is properly defined."},{"function":"buildaddr","message_template":"554 5.3.5 buildaddr: no host","reason":"The address is missing the host part for a non-local mailer.","resolution":"This usually indicates a ruleset problem that created an incomplete address. Check ruleset definitions for correctness."},{"function":"cataddr","message_template":"cataddr: string too long","reason":"The concatenated address exceeds the buffer size.","resolution":"This usually indicates an internal problem with address processing. Check for very long addresses or ruleset expansions that could cause buffer overflow."},{"function":"remotename","message_template":"553 5.1.0 remotename: too many tokens","reason":"The remotename processing has resulted in too many tokens in the address.","resolution":"Simplify address format or rewriting rules to avoid excessive tokens in processed addresses."},{"function":"maplocaluser","message_template":"maplocaluser: rewrite tempfail","reason":"A temporary failure occurred during rewriting in maplocaluser.","resolution":"Check resources that might affect rewriting (DNS, maps, etc.). The operation will be retried later."},{"function":"rscheck","message_template":"ruleset=%s, arg1=%s%s, discard","reason":"The rscheck function determined that the message should be discarded based on ruleset evaluation.","resolution":"This is expected behavior if discard action is configured. If unintended, check the ruleset definitions to understand why messages are being discarded."},{"function":"rscheck","message_template":"ruleset=%s, arg1=%s%s, quarantine=%s","reason":"The rscheck function determined that the message should be quarantined based on ruleset evaluation.","resolution":"This is expected behavior if quarantine action is configured. If unintended, check the ruleset definitions to understand why messages are being quarantined."},{"function":"rscheck","message_template":"ruleset=%s, arg1=%s%s, %s=%s","reason":"The rscheck function evaluated arguments against a ruleset and produced a result (reject or status).","resolution":"This is informational about ruleset processing. If the action is unintended, review the ruleset definitions."},{"function":"rscheck","message_template":"rscheck: cannot prescan input","reason":"The input to rscheck couldn't be prescanned, likely due to syntax errors.","resolution":"Check the input format provided to the ruleset. This might indicate malformed input or resource issues."},{"function":"rscheck","message_template":"rscheck: cannot prescan input: \"%s\"","reason":"The specific input string to rscheck couldn't be prescanned, with the input shown.","resolution":"Examine the specific input string to identify syntax errors or other issues that prevent it from being properly parsed."}]}