{"project":"sendmail","module":"ratectrl.c","summary":"This module implements connection rate control for Sendmail by tracking and limiting both global and per-client connection rates. It helps protect against denial-of-service attacks by monitoring and potentially limiting connection rates from specific IP addresses and globally across the server.","logs":[{"function":"connection_rate_check","message_template":"connection_rate_check entering...","reason":"Debug log indicating the start of connection rate check processing. Only appears when RATECTL_DEBUG is enabled.","resolution":"This is an informational debug message that requires no resolution. If seen frequently in logs, connection rate checks are being triggered often which could indicate high traffic volume."},{"function":"connection_rate_check","message_template":"global connection rate: %d","reason":"Debug log showing the calculated global connection rate. Only appears when RATECTL_DEBUG is enabled.","resolution":"This is an informational debug message. If the rate is consistently high, consider adjusting ConnectionRateWindowSize or implementing additional rate limits to protect server resources."},{"function":"conn_limits","message_template":"conn_limits: addr=%s, flags=0x%x, rate=%d\/%d, conc=%d\/%d, exc=%d","reason":"Logs connection limit information including client address, connection rate, and whether limits were exceeded. Appears in debug mode or when limits are exceeded in _FFR_OCC mode.","resolution":"If the exceeded flag (exc) is 1, the client is exceeding configured connection limits. Consider blocking persistent offenders, adjusting rate limits, or implementing IP-based access controls if this happens frequently."},{"function":"total_rate","message_template":"total: cnt=%d, CHTSIZE=%d, ChtGran=%d","reason":"Debug log showing the total connection count, time window size, and time granularity. Only appears when RATECTL_DEBUG is enabled.","resolution":"This is an informational debug message. If connection counts are consistently high, consider adjusting server capacity or connection rate limits."},{"function":"dump_ch","message_template":"dump_ch","reason":"Debug header indicating the start of a connection hash table dump. Only appears when RATECTL_DEBUG or _FFR_OCC is enabled.","resolution":"This is an informational debug message that requires no resolution. It's used for debugging connection tracking issues."},{"function":"dump_ch","message_template":"ip=%s","reason":"Debug log showing an IP address from the connection hash table. Only appears when RATECTL_DEBUG or _FFR_OCC is enabled.","resolution":"This is an informational debug message that requires no resolution. If suspicious IPs appear frequently, they may be attempting to abuse your mail server."},{"function":"dump_ch","message_template":"time=%ld cnt=%d","reason":"Debug log showing the last access time and connection count for an IP. Only appears when RATECTL_DEBUG or _FFR_OCC is enabled.","resolution":"This is an informational debug message. If specific IPs show very high counts, consider implementing additional restrictions for those addresses."},{"function":"dump_ch","message_template":"oc=%d","reason":"Debug log showing the number of open connections for an IP address. Only appears when RATECTL_DEBUG and _FFR_OCC are enabled.","resolution":"This is an informational debug message. If specific IPs maintain many open connections, they might be attempting a resource exhaustion attack."}]}