{"project":"sendmail","module":"savemail.c","summary":"This module handles error processing for mail delivery failures, responsible for generating error notifications, saving copies of failed messages, creating delivery status notifications, and handling message bounces.","logs":[{"function":"savemail","message_template":"553 5.3.5 Cannot parse Postmaster!","reason":"Failed to parse the 'Postmaster' address when it was substituted as a fallback sender address in a situation where the original sender is unknown","resolution":"Check configuration for a valid Postmaster address, verify MTA settings, and ensure the defined Postmaster email address is properly formatted."},{"function":"savemail","message_template":"554 5.3.0 savemail: bogus errormode x%x","reason":"The error mode specified for the mail envelope is invalid or unknown","resolution":"Check and correct the configuration settings that define error handling modes, as the system detected an invalid error mode value."},{"function":"savemail","message_template":"553 5.3.0 cannot parse %s!","reason":"Failed to parse the bounce address (DoubleBounceAddr) after expansion","resolution":"Verify that the DoubleBounceAddr configuration is valid and properly formatted, and check that any macros it uses expand correctly."},{"function":"savemail","message_template":"554 5.3.5 savemail: unknown state %d","reason":"The internal state machine reached an unknown state during error mail processing","resolution":"This indicates a possible internal error in sendmail. Check for software updates, as this shouldn't happen in normal operation."},{"function":"savemail","message_template":"savemail panic","reason":"A severe error occurred during savemail processing that required abandoning the current operation","resolution":"Check system resources, file permissions, and disk space. May require examination of mail queue and manual intervention to resolve stuck messages."},{"function":"savemail","message_template":"554 savemail: cannot save rejected email anywhere","reason":"Failed to save the rejected email to any available location (mail queue, dead.letter, etc.)","resolution":"Check file permissions, disk space, and configuration settings. Ensure that DeadLetterDrop is properly configured and writeable if enabled."},{"function":"savemail","message_template":"Saved message in %s","reason":"Successfully saved a copy of the rejected message to a dead.letter file or to the DeadLetterDrop location","resolution":"Informational message only, no action required. The message was successfully saved for later review."},{"function":"savemail","message_template":"Cannot open %s","reason":"Failed to open the transcript file for the failed message","resolution":"Check permissions and paths for queue files. Make sure the queue directory is properly configured and accessible."},{"function":"returntosender","message_template":"554 5.3.0 returntosender: infinite recursion on %s","reason":"Detected too many levels of recursion when trying to return an error message about an error message","resolution":"This often happens when there are mail loops or invalid return addresses. Check for mail loops, invalid addresses, and verify mail routing configuration."},{"function":"returntosender","message_template":"554 5.3.0 returntosender: cannot select queue for %s","reason":"Unable to select an appropriate mail queue for returning the message to the sender","resolution":"Check queue directory permissions and configuration settings. Verify that queue directories exist and are properly configured."},{"function":"returntosender","message_template":"returntosender: q_finalrcpt is NULL","reason":"The final recipient address field is unexpectedly NULL during delivery status notification generation","resolution":"This indicates a potential internal data structure inconsistency. Check for software updates or patches that might address this issue."},{"function":"errbody","message_template":"errbody: null parent","reason":"The envelope parent pointer is unexpectedly NULL during error message body generation","resolution":"This indicates an internal error in message handling. Check for software updates or patches, or investigate if custom mail handling scripts might be causing issues."},{"function":"errbody","message_template":"errbody: I\/O error","reason":"Encountered an I\/O error while attempting to write the error message body","resolution":"Check system resources like disk space and file handles. Verify that mail queues are not corrupted and that file system permissions are correct."},{"function":"xuntextify","message_template":"bogus xtext: +%c","reason":"Found invalid encoding in an xtext format string - the first digit after '+' is not a valid hex digit","resolution":"This indicates corrupted data in delivery status notifications. May require manual inspection and repair of queue files if occurring frequently."},{"function":"xuntextify","message_template":"bogus xtext: +%x%c","reason":"Found invalid encoding in an xtext format string - the second digit is not a valid hex digit","resolution":"This indicates corrupted data in delivery status notifications. May require manual inspection and repair of queue files if occurring frequently."},{"function":"xtextify","message_template":"!xtextify string too long","reason":"The string being converted to xtext format is too long and would cause an integer overflow","resolution":"Check for unusually large addresses or headers that might be causing this issue. Consider adjusting configuration to limit address or header sizes."}]}