{"project":"sendmail","module":"..\/working\/sendmail\/sendmail\/sched.c","summary":"This module implements a queue manager that handles notifications and processes queue entries. It forks a child process to monitor notifications and triggers queue processing for identified entries.","logs":[{"function":"FORK_P1","message_template":"%s: %s","reason":"Logs when the fork operation for the queue manager fails, including the specific error message. This typically occurs due to system resource constraints.","resolution":"Check system resources like maximum processes allowed, memory availability, and system limits. Consider increasing system limits or reducing load on the server."},{"function":"qm","message_template":"queue manager: start","reason":"Indicates that the queue manager process is starting. This is an informational message indicating normal operation.","resolution":"No resolution required, this is an informational log."},{"function":"qm","message_template":"sm_notify_start() failed=%d","reason":"Logs when the notification system initialization fails. This prevents the queue manager from receiving notifications about new queue entries.","resolution":"Check system resources, notification system configuration, and permissions. The error code provides specific information about what failed in the notification system."},{"function":"qm","message_template":"queue manager: rcv=start","reason":"Indicates the queue manager is starting to receive a notification. This is an informational debug message for tracing the operation flow.","resolution":"No resolution required, this is a debug-level informational log."},{"function":"qm","message_template":"queue manager: rcv=timed_out","reason":"Indicates that waiting for a notification timed out. This is normal behavior when no new items are being added to the queue.","resolution":"No resolution required, unless this message appears very frequently and queue processing is expected. In that case, check if notifications are being properly sent."},{"function":"qm","message_template":"queue manager: rcv=%d","reason":"Logs an error code from the notification receive operation. A negative value indicates a failure in the notification system.","resolution":"Investigate the specific error code returned. Check notification system configuration, permissions, and connectivity. May require restarting the notification system or the queue manager."},{"function":"qm","message_template":"queue manager: got=%s","reason":"Logs the content of a notification message received by the queue manager. This helps track what items are being processed.","resolution":"No resolution required, this is a debug-level informational log."},{"function":"qm","message_template":"queue manager: buf=%s, scan=%d","reason":"Indicates a failure to parse a notification message. The expected format is 'N:qgrp:qdir:id' and the scan count shows how many fields were successfully parsed.","resolution":"Check the format of notification messages being sent to the queue manager. Ensure they follow the required format. This might indicate a mismatch in notification system versions or configuration."},{"function":"qm","message_template":"queue manager: stop","reason":"Indicates that the queue manager process is shutting down. This typically occurs when the entire mail system is being shut down or restarted.","resolution":"No resolution required unless the queue manager is stopping unexpectedly. In that case, check for errors in previous log messages that might indicate why it's terminating."}]}