{"project":"sendmail","module":"sendmail\/sendmail.h","summary":"Core header file for Sendmail mail transfer agent that defines data structures, constants, macros, and function prototypes for the mail delivery system. It includes definitions for memory management, error handling, logging facilities, SMTP communication, TLS, SASL authentication, and queue management.","logs":[{"function":"compile_time_check","message_template":"DANE set but STARTTLS not defined","reason":"Configuration error occurs when DANE (DNS-based Authentication of Named Entities) is enabled but STARTTLS is not defined, which is an invalid configuration because DANE requires TLS support.","resolution":"Either enable STARTTLS or disable DANE in the configuration. DANE requires TLS to function properly."},{"function":"compile_time_check","message_template":"_FFR_TLS_ALTNAMES set but STARTTLS not defined","reason":"Configuration error when TLS alternative names feature is enabled but STARTTLS support isn't compiled in, creating an invalid configuration.","resolution":"Either enable STARTTLS or disable the _FFR_TLS_ALTNAMES feature flag in the configuration."},{"function":"compile_time_check","message_template":"_FFR_TLSFB2CLEAR set but STARTTLS not defined","reason":"Configuration error when TLS fallback to cleartext feature is enabled but STARTTLS isn't defined, causing an incompatible configuration.","resolution":"Enable STARTTLS support or disable the _FFR_TLSFB2CLEAR feature flag in the configuration."},{"function":"compile_time_check","message_template":"_FFR_TLS_USE_CERTIFICATE_CHAIN_FILE set but STARTTLS not defined","reason":"Configuration error when certificate chain file feature is enabled but STARTTLS isn't defined, resulting in an invalid configuration.","resolution":"Either enable STARTTLS or disable the _FFR_TLS_USE_CERTIFICATE_CHAIN_FILE feature flag in the configuration."},{"function":"compile_time_check","message_template":"Cannot enable both of these FFRs: _FFR_EAI _FFR_EIGHT_BIT_ADDR_OK","reason":"Configuration conflict between Email Address Internationalization and 8-bit address features which cannot be simultaneously enabled.","resolution":"Choose only one of these features to enable: either _FFR_EAI or _FFR_EIGHT_BIT_ADDR_OK, as they are mutually exclusive."},{"function":"compile_time_check","message_template":"_FFR_OCC requires SM_CONF_SHM","reason":"Feature flag dependency error where the OCC (On-Connection Control) feature requires shared memory support that isn't enabled.","resolution":"Enable SM_CONF_SHM (shared memory support) in the configuration to use the _FFR_OCC feature."},{"function":"compile_time_check","message_template":"_FFR_SM_LDAP_DBG requires LDAPMAP and LBER_OPT_LOG_PRINT_FN","reason":"LDAP debugging feature requires both LDAP map support and a specific LDAP logging function that aren't available.","resolution":"Enable both LDAPMAP and ensure the LBER_OPT_LOG_PRINT_FN function is available in your LDAP library to use the debugging feature."},{"function":"compile_time_check","message_template":"_FFR_LOG_MORE1 != _FFR_LOG_MORE2","reason":"Configuration error where two related logging level features are set to inconsistent values.","resolution":"Set _FFR_LOG_MORE1 and _FFR_LOG_MORE2 to the same value in the configuration to maintain consistency."},{"function":"compile_time_check","message_template":"LDAP_NETWORK_TIMEOUT requires LDAPMAP","reason":"LDAP network timeout feature is enabled but the required LDAPMAP support is missing.","resolution":"Enable LDAPMAP in the configuration to use the LDAP_NETWORK_TIMEOUT feature."},{"function":"compile_time_check","message_template":"LDAP_REFERRALS requires LDAPMAP","reason":"LDAP referrals feature is enabled but the required LDAPMAP support is missing.","resolution":"Enable LDAPMAP in the configuration to use the LDAP_REFERRALS feature."},{"function":"compile_time_check","message_template":"_FFR_VRFY_TRUSTED_FIRST set but X509_V_FLAG_TRUSTED_FIRST not defined","reason":"TLS certificate verification feature is enabled but the OpenSSL API flag it depends on is not available.","resolution":"Upgrade to a newer version of OpenSSL that supports X509_V_FLAG_TRUSTED_FIRST or disable the _FFR_VRFY_TRUSTED_FIRST feature."},{"function":"compile_time_check","message_template":"README: -DSASL (SASL) does not agree with the version of the CYRUS_SASL library (SASL_VERSION)","reason":"Version mismatch between the SASL version defined at compile time and the actual Cyrus SASL library version being used.","resolution":"Update the -DSASL compile-time option to match the version of the CYRUS_SASL library installed on the system."},{"function":"compile_time_check","message_template":"README: please set -DSASL to the version of the CYRUS_SASL library","reason":"SASL configuration error where the version of SASL needs to be explicitly specified at compile time.","resolution":"Set the -DSASL compile option to the specific version number of your Cyrus SASL library as documented in the README file."},{"function":"compile_time_check","message_template":"change SASL_SEC_MASK notify sendmail.org!","reason":"Internal development warning about changes to SASL security mask that should be reported to sendmail.org.","resolution":"This is primarily for sendmail developers. If encountered, check if you've modified SASL security settings and consult with sendmail.org."},{"function":"compile_time_check","message_template":"change SASL_AUTH_AUTH notify sendmail.org!","reason":"Internal development warning about changes to SASL authentication flags that should be reported to sendmail.org.","resolution":"This is primarily for sendmail developers. If encountered, check if you've modified SASL authentication settings and consult with sendmail.org."},{"function":"run_work_group","message_template":"%s: CurRunners=%d, i=%d, count=%d, status=should not happen","reason":"Runtime error indicating an unexpected state in the queue runner count mechanism, which could indicate thread safety issues or memory corruption.","resolution":"This indicates a potential bug in sendmail. Check for version updates that might fix this issue, or report it to sendmail developers if recurring. Review the mail queue for stuck jobs."}]}