{"project":"sendmail","module":"..\/working\/sendmail\/sendmail\/sfsasl.c","summary":"This module implements file type handlers for Sendmail's SASL (Simple Authentication and Security Layer) and TLS\/SSL encrypted communications. It manages the encryption and decryption of data between the application and network, handling various error conditions and timeouts.","logs":[{"function":"sasl_read","message_template":"AUTH: sasl_decode error=%d","reason":"SASL encountered an error during decoding of encrypted data. This indicates the authentication mechanism could not properly decrypt the received message.","resolution":"Check SASL library compatibility, ensure both client and server support the same authentication mechanisms, and verify proper credentials are being used. The error code can help identify the specific issue in the SASL library."},{"function":"sasl_read","message_template":"@sasl_read failure: outbuf == NULL but outlen != 0","reason":"Internal inconsistency in SASL buffer handling where buffer pointer is NULL but length is non-zero. This should never happen in normal operation and represents a bug in the code.","resolution":"This is a critical system error that indicates a bug in the SASL implementation. Report this to the Sendmail maintainers with details about your configuration and SASL library version."},{"function":"sasl_write","message_template":"AUTH: sasl_encode error=%d","reason":"SASL encountered an error while encoding (encrypting) data for transmission. This could be due to an issue with the SASL library or an invalid authentication state.","resolution":"Check SASL library compatibility and verify that authentication has been completed successfully before attempting to send data. The error code provides specific information about the failure from the SASL library."},{"function":"tls_retry","message_template":"STARTTLS=%s, info: fds=%d\/%d, err=%d","reason":"Informational message about TLS operation retry showing the operation type, file descriptors, and error code. This is logged during SSL\/TLS handshaking or renegotiation.","resolution":"This is an informational message at high log levels. No resolution needed unless it appears very frequently, which might indicate network issues or a problem with the SSL\/TLS configuration."},{"function":"tls_retry","message_template":"STARTTLS=%s, error: fd %d\/%d too large","reason":"A file descriptor used for TLS communication exceeds the maximum allowed value for select() operations. This can happen on systems with limits on file descriptor values.","resolution":"Reconfigure system limits for file descriptors or modify the application to use fewer file descriptors. This may require adjusting system parameters like ulimit or kernel parameters depending on the operating system."},{"function":"tls_read","message_template":"STARTTLS: read error=timeout","reason":"A timeout occurred while attempting to read data through the TLS connection. The peer didn't send a complete SSL record within the configured timeout period.","resolution":"Check network connectivity between client and server. Consider increasing the timeout values if the network has high latency. Verify that the remote end is still actively communicating and hasn't crashed or stalled."},{"function":"tls_read","message_template":"STARTTLS: read error=%s (%d), errno=%d, get_error=%s, retry=%d, ssl_err=%d","reason":"Detailed error information for a TLS read operation failure, including the error type, return code, system error number, OpenSSL error string, retry counter, and SSL error code.","resolution":"The specific resolution depends on the error values. Common issues include network connectivity problems, SSL certificate validation failures, or protocol version mismatches. Check OpenSSL documentation for the specific error codes to diagnose further."},{"function":"tls_read","message_template":"STARTTLS: read error=%s (%d), errno=%d, retry=%d, ssl_err=%d","reason":"Less detailed error information for a TLS read operation failure, logged at lower log levels, showing the error type, return code, system error number, retry counter, and SSL error code.","resolution":"Similar to the more detailed version, resolution depends on the specific error. Check network connectivity, SSL configuration, and certificate validity. The SSL error code can be referenced against OpenSSL documentation."},{"function":"tls_write","message_template":"STARTTLS: write error=timeout","reason":"A timeout occurred while attempting to write data through the TLS connection. The peer didn't accept a complete SSL record within the configured timeout period.","resolution":"Check if the remote system is still responsive and accepting data. Network congestion, remote system overload, or an unresponsive peer can cause this issue. Consider increasing the timeout if operating over high-latency connections."},{"function":"tls_write","message_template":"STARTTLS: write error=%s (%d), errno=%d, get_error=%s, retry=%d, ssl_err=%d","reason":"Detailed error information for a TLS write operation failure, including the error type, return code, system error number, OpenSSL error string, retry counter, and SSL error code.","resolution":"The specific resolution depends on the error values. Network issues, remote peer closing the connection, or SSL protocol errors are common causes. Check OpenSSL documentation for the specific error codes to determine the exact issue."},{"function":"tls_write","message_template":"STARTTLS: write error=%s (%d), errno=%d, retry=%d, ssl_err=%d","reason":"Less detailed error information for a TLS write operation failure, logged at lower log levels, showing the error type, return code, system error number, retry counter, and SSL error code.","resolution":"Similar to the more detailed version, resolution depends on the specific error. Check network connectivity, remote system status, and SSL configuration. The SSL error code provides specific information when referenced against OpenSSL documentation."}]}