{"project":"sendmail","module":"stab.c","summary":"This module manages the symbol table for the Sendmail system. It provides functions for looking up, inserting, and manipulating symbols of different types, with functionality for applying operations to all symbols, managing class macros, copying classes, and removing expired entries.","logs":[{"function":"stab","message_template":"STAB: %s %d ","reason":"Debug message printed when tracing is enabled, showing the symbol name and type being processed by the stab function","resolution":"This is a debug message only visible when trace flags are enabled. No resolution required."},{"function":"stab","message_template":"(hfunc=%d) ","reason":"Debug message showing the computed hash function value for a symbol","resolution":"This is a debug message only visible when trace flags are enabled. No resolution required."},{"function":"stab","message_template":"not found\n","reason":"Debug message indicating that a symbol lookup failed to find the requested entry","resolution":"This is a debug message only visible when trace flags are enabled. No resolution required."},{"function":"stab","message_template":"type %d val %lx %lx %lx %lx\n","reason":"Debug message showing details of a found symbol entry including its type and memory values","resolution":"This is a debug message only visible when trace flags are enabled. No resolution required."},{"function":"stab","message_template":"entered\n","reason":"Debug message indicating a new symbol was successfully entered into the symbol table","resolution":"This is a debug message only visible when trace flags are enabled. No resolution required."},{"function":"stab","message_template":"stab: unknown symbol type %d","reason":"Error message when an unknown symbol type is encountered during symbol table entry creation","resolution":"This indicates a code error or possibly a corrupted configuration. Check if a custom mailer or configuration is attempting to create a symbol with an invalid type. This may require updating the code or correcting the configuration."},{"function":"stab","message_template":"size of stab entry: %d\n","reason":"Debug message showing the calculated size of a new symbol table entry","resolution":"This is a debug message only visible when trace flags are enabled. No resolution required."},{"function":"stabapply","message_template":"stabapply: trying %d\/%s\n","reason":"Debug message showing which symbol type and name is being processed during symbol table iteration","resolution":"This is a debug message only visible when trace flags are enabled. No resolution required."},{"function":"dumpstab","message_template":"stab: total=%d (%d)","reason":"Informational message logging the total number of symbols in the symbol table and the change since last check","resolution":"This is an informational message from the heap checking function. If the number is growing continuously, it might indicate a memory leak that should be investigated."},{"function":"dumpstab","message_template":"stab: type[%2d]=%2d (%d)","reason":"Informational message logging the number of symbols of each type and the change since last check","resolution":"This is an informational message from the heap checking function. If a particular type count is growing continuously, it might indicate a memory leak for that symbol type that should be investigated."}]}