{"project":"sendmail","module":"timers.c","summary":"This module provides timer management functionality for Sendmail, allowing precise tracking of execution time using both wall clock and CPU metrics. It includes functions for pushing and popping timers on a stack, calculating time differences, and formatting timer values as strings.","logs":[{"function":"warntimer","message_template":"%s; e_timers=0x%lx","reason":"Generic logging function used to report timer-related warnings. The message contains a custom warning message followed by the memory address of the current environment's timers.","resolution":"This is a general-purpose logging mechanism for timer issues. Review the specific message content to determine the appropriate action. May indicate internal timer management problems that require code review."},{"function":"pushtimer","message_template":"Timer@0x%lx already on stack, index=%d, NTimers=%d","reason":"Logs a warning when attempting to push a timer onto the stack that is already present. This indicates a potential logic error in the timer management code.","resolution":"This likely indicates an application bug where the same timer is being pushed multiple times without being popped. Review the code flow for timer management to ensure proper timer stack handling."},{"function":"poptimer","message_template":"poptimer: odd pop (timer=0x%lx, index=%d, NTimers=%d)","reason":"Warns about an attempt to pop a timer that is not at the top of the stack, indicating timers are being popped out of order.","resolution":"This indicates a bug in the timer stack management where timers are not being correctly paired with push\/pop operations. Review application code to ensure timers are properly managed and that each push has a corresponding pop in the correct order."},{"function":"strtimer","message_template":"%ld.%06ldr\/%ld.%06ldc","reason":"Formats a timer value as a string showing wall clock time and CPU time. This isn't directly logged but the formatted string may appear in logs through other means.","resolution":"This is an informational format, not an error. No resolution needed unless the timer values appearing in logs are unexpected. The format shows wall clock time and CPU time in seconds and microseconds."}]}