{"project":"sendmail","module":"..\/working\/sendmail\/sendmail\/tls.h","summary":"This module defines structures, macros, and function prototypes for TLS (Transport Layer Security) functionality in sendmail. It includes constants for TLS initialization, authentication, DANE verification, and error handling, providing a comprehensive interface for secure email transmission.","logs":[{"function":"tlslogerr","message_template":"TLS error logging function, specific messages not in header","reason":"Logs TLS errors with error codes and descriptive messages. Used throughout the TLS functionality when errors occur during connection, handshake, or verification.","resolution":"Resolution depends on the specific TLS error. Check certificate validity, file permissions, network connectivity, or OpenSSL configuration."},{"function":"dane_tlsa_chk","message_template":", status=all TLSA RRs are unsupported","reason":"Logs when DANE verification cannot proceed because all TLSA resource records are unsupported by the implementation. This indicates DANE security cannot be established.","resolution":"Verify that the DNS server is providing TLSA records in a format supported by sendmail. Update DNS records with supported TLSA record types and parameters."},{"function":"endtls","message_template":"TLS connection termination messages not in header","reason":"Likely logs issues when ending a TLS session, such as errors in the shutdown handshake or resource cleanup.","resolution":"Most TLS termination issues are transient. For persistent problems, check for network issues, connection resets, or client behavior that might interrupt proper TLS shutdown."},{"function":"inittls","message_template":"TLS initialization messages not in header","reason":"Logs errors during TLS initialization, such as problems loading certificates, keys, or setting up TLS parameters.","resolution":"Verify certificate and key file paths, permissions, and formats. Ensure OpenSSL is properly configured and that cipher specifications are valid."},{"function":"load_certkey","message_template":"Certificate\/key loading messages not in header","reason":"Logs issues when loading certificates or private keys, which could include file access problems, format errors, or key\/certificate mismatches.","resolution":"Check certificate and key file permissions, formats, and validity. Ensure the certificate matches the private key and hasn't expired."},{"function":"tls_get_info","message_template":"TLS connection information messages not in header","reason":"Retrieves and potentially logs information about established TLS connections, including cipher, protocol version, and certificate details.","resolution":"Informational only; no resolution required unless weak ciphers or protocols are detected, in which case TLS configuration should be updated."}]}