{"project":"sendmail","module":"tls.c","summary":"This module implements TLS functionality for secure mail transfer in sendmail. It handles certificate management, TLS session establishment and teardown, cryptographic operations, and DANE validation for secure communication.","logs":[{"function":"tls_rand_init","message_template":"STARTTLS: RAND_egd(%s) failed: random number generator not seeded","reason":"EGD (Entropy Gathering Daemon) failed to provide enough entropy for secure random number generation, which is critical for TLS security.","resolution":"Check if EGD is running properly. Consider providing an alternative entropy source or using OS-provided random devices if available."},{"function":"tls_rand_init","message_template":"STARTTLS: can't fstat(%s)","reason":"Cannot get file status for the random seed file, which is needed to verify the file's security and usability.","resolution":"Check file permissions and that the path exists. The RandFile configuration option may need to be corrected."},{"function":"tls_rand_init","message_template":"STARTTLS: RandFile %s too old: %s","reason":"The random seed file is too old and may contain outdated entropy, marked as either 'unsafe' or 'unusable'.","resolution":"The random seed file should be regularly updated. Consider setting up a cron job to refresh entropy or enable DontBlameSendmail option for INSUFFICIENTENTROPY to bypass this check (not recommended for production)."},{"function":"tls_rand_init","message_template":"STARTTLS: size(%s) < %d: %s","reason":"The random seed file is too small to provide sufficient entropy, marked as either 'unsafe' or 'unusable'.","resolution":"Ensure the random seed file contains at least the minimum required number of bytes (128 bytes). Consider using a hardware random number generator or OS-provided entropy source."},{"function":"tls_rand_init","message_template":"STARTTLS: RAND_load_file(%s) failed: random number generator not seeded","reason":"OpenSSL could not load enough entropy from the provided random file to seed the random number generator.","resolution":"Verify the random file exists and has good entropy. Consider using \/dev\/urandom or another system entropy source."},{"function":"tls_rand_init","message_template":"STARTTLS: Warning: safeopen(%s) failed","reason":"Cannot safely open the random seed file due to permission issues or file path problems.","resolution":"Check file permissions and path. Ensure the file is owned by the user running sendmail and has appropriate permissions."},{"function":"tls_rand_init","message_template":"STARTTLS: Error: no proper random file definition %s","reason":"The random file is defined but has an unrecognized format or prefix (not 'file:' or 'egd:').","resolution":"Correct the RandFile configuration option to use a proper prefix (file: or egd:) followed by the path."},{"function":"tls_rand_init","message_template":"STARTTLS: Error: missing random file definition","reason":"No random file is defined, which is required for seeding the random number generator in some configurations.","resolution":"Set the RandFile configuration option to a valid entropy source if not using \/dev\/urandom or a similar system device."},{"function":"tls_rand_init","message_template":"STARTTLS: Warning: random number generator not properly seeded","reason":"The random number generator is not properly seeded, but operation continues due to DontBlameSendmail setting for INSUFFICIENTENTROPY.","resolution":"This is a security risk. Consider providing a proper entropy source instead of bypassing the check."},{"function":"init_tls_library","message_template":"fipsmode=%d, evp_is_FIPS=%d","reason":"Informational log showing FIPS mode status and whether OpenSSL's EVP interface is in FIPS mode.","resolution":"Informational log, no resolution required."},{"function":"init_tls_library","message_template":"STARTTLS=init, SSL_get_ex_new_index=%d","reason":"Error obtaining a new SSL index for storing custom data in SSL structures.","resolution":"Check OpenSSL installation and available memory. This error indicates a problem with OpenSSL initialization."},{"function":"init_tls_library","message_template":"STARTTLS=init, FIPSMode=%s","reason":"Failed to set FIPS mode, including the OpenSSL error string.","resolution":"Check if OpenSSL is compiled with FIPS support and if the FIPS module is properly installed and configured."},{"function":"init_tls_library","message_template":"STARTTLS=init, FIPSMode=ok","reason":"Successfully enabled FIPS mode in OpenSSL.","resolution":"Informational log, no resolution required."},{"function":"init_tls_library","message_template":"STARTTLS=init, engine=%s, TLS_set_engine=failed","reason":"Failed to set up the specified SSL engine, which could be a hardware or software crypto provider.","resolution":"Verify the engine name is correct and that the engine is installed and available. Check that dynamic engine loading paths are correctly configured."},{"function":"init_tls_library","message_template":"STARTTLS=init, CertFingerprintAlgorithm=%s, status=invalid","reason":"The configured certificate fingerprint algorithm is not supported by OpenSSL.","resolution":"Change CertFingerprintAlgorithm to a supported value like 'sha1', 'sha256', or 'md5'."},{"function":"tls_ok_f","message_template":"STARTTLS: %s%s missing","reason":"A required TLS configuration file (certificate, key, CA cert) is missing for either server or client.","resolution":"Ensure the appropriate certificate and key files are configured and accessible with absolute paths."},{"function":"tls_safe_f","message_template":"STARTTLS=%s: file %s unsafe: %s","reason":"A TLS-related file (certificate, key, CA cert) fails security checks due to permissions or ownership issues.","resolution":"Check the file permissions and ownership. TLS files should be owned by the user running sendmail and not writable by others."},{"function":"load_certkey","message_template":"STARTTLS=%s, error: %s(%s) failed","reason":"Failed to load a certificate file into the SSL context. Could be a format issue or file access problem.","resolution":"Verify the certificate is in PEM format and readable. Check for syntax errors in the certificate file."},{"function":"load_certkey","message_template":"STARTTLS=%s, error: SSL_use_PrivateKey_file(%s) failed","reason":"Failed to load a private key file into the SSL context. Could be a format issue, passphrase problem, or file access issue.","resolution":"Check that the key file is in PEM format and readable. If the key is encrypted, provide the correct passphrase. Verify the key matches the certificate."},{"function":"load_certkey","message_template":"STARTTLS=%s, error: SSL_check_private_key failed(%s): %d","reason":"The private key does not match the certificate public key.","resolution":"Ensure the private key corresponds to the certificate. Generate a new certificate signing request from the existing key or generate a matched key-certificate pair."},{"function":"load_crlfile","message_template":"STARTTLS=%s, error: BIO_new=failed","reason":"Failed to create a new BIO (I\/O abstraction) object for reading a Certificate Revocation List (CRL) file.","resolution":"Check OpenSSL installation and available memory. This error indicates a problem with OpenSSL functionality."},{"function":"load_crlfile","message_template":"STARTTLS=%s, error: BIO_read_filename(%s)=failed","reason":"Failed to open the CRL file for reading, likely due to file access permissions or a non-existent file.","resolution":"Check that the CRL file exists and has proper permissions for the sendmail process to read it."},{"function":"load_crlfile","message_template":"STARTTLS=%s, error: PEM_read_bio_X509_CRL(%s)=failed","reason":"Failed to parse the CRL file. The file might not be in the expected PEM format or could be corrupted.","resolution":"Verify the CRL is in valid PEM format. Try regenerating or redownloading the CRL from the certificate authority."},{"function":"load_crlfile","message_template":"STARTTLS=%s, error: X509_STORE_add_crl=failed","reason":"Failed to add the CRL to the X509 certificate store, which prevents certificate revocation checking.","resolution":"Check if the CRL is valid and compatible with the current OpenSSL version. Try using OpenSSL command line tools to verify the CRL format."},{"function":"load_crlpath","message_template":"STARTTLS=%s, error: X509_STORE_add_lookup(hash)=failed","reason":"Failed to add a directory lookup method to the X509 certificate store for CRL checking.","resolution":"Check OpenSSL installation and available memory. This error indicates a problem with OpenSSL functionality."},{"function":"load_crlpath","message_template":"STARTTLS=%s, error: X509_LOOKUP_add_dir(%s)=failed","reason":"Failed to add a directory for CRL lookups, which prevents certificate revocation checking.","resolution":"Verify the CRL directory exists and has proper permissions. Ensure it contains hash-named CRL files in PEM format."},{"function":"inittls","message_template":"STARTTLS=%s, error: illegal value '%s' for DHParameters","reason":"The DHParameters configuration value is invalid. Valid values are 'none', 'I', '512', '1024', '2048', or a path to a parameter file.","resolution":"Correct the DHParameters configuration to one of the allowed values or provide a valid path to a DH parameter file."},{"function":"inittls","message_template":"STARTTLS=%s, error: SSL_CTX_new(SSLv23_%s_method()) failed","reason":"Failed to create a new SSL context, which is required for TLS functionality.","resolution":"Check OpenSSL installation and available memory. This error may occur if OpenSSL is not properly initialized."},{"function":"inittls","message_template":"STARTTLS=%s, SSL_MODE_AUTO_RETRY=set, mode=%#lx","reason":"Informational log indicating the SSL_MODE_AUTO_RETRY flag is set, which affects I\/O handling.","resolution":"Informational log, no resolution required."},{"function":"inittls","message_template":"STARTTLS=%s, error: RSA_generate_key failed","reason":"Failed to generate a temporary RSA key for SSL sessions, which may affect backwards compatibility with older clients.","resolution":"Check OpenSSL installation and available memory. Try reducing the RSA key length in the configuration."},{"function":"inittls","message_template":"STARTTLS=%s, error: SSL_CTX_use_PrivateKey_file(%s) failed","reason":"Failed to load a private key file into the SSL context. Could be a format issue, passphrase problem, or file access issue.","resolution":"Check that the key file is in PEM format and readable. If the key is encrypted, provide the correct passphrase."},{"function":"inittls","message_template":"STARTTLS=%s, error: %s(%s) failed","reason":"Failed to load a certificate file into the SSL context. Could be a format issue or file access problem.","resolution":"Verify the certificate is in PEM format and readable. Check for syntax errors in the certificate file."},{"function":"inittls","message_template":"STARTTLS=%s, error: SSL_CTX_check_private_key failed(%s): %d","reason":"The private key does not match the certificate public key.","resolution":"Ensure the private key corresponds to the certificate. Generate a new certificate signing request from the existing key or generate a matched key-certificate pair."},{"function":"inittls","message_template":"STARTTLS=%s, error: SSL_CTX_check_private_key 2 failed: %d","reason":"The secondary private key does not match its certificate public key.","resolution":"Ensure the secondary private key corresponds to its certificate. Generate a new certificate signing request from the existing key or generate a matched key-certificate pair."},{"function":"inittls","message_template":"inittls: where=try_dh, req=%#lx, status=%#lx","reason":"Debugging information about Diffie-Hellman (DH) parameter initialization.","resolution":"Informational log, no resolution required."},{"function":"inittls","message_template":"STARTTLS=%s, error: cannot read DH parameters(%s): %s","reason":"Failed to read Diffie-Hellman parameters from the specified file, with OpenSSL error details.","resolution":"Check that the DH parameter file exists, is readable, and contains valid parameters in PEM format."},{"function":"inittls","message_template":"STARTTLS=%s, error: BIO_new_file(%s) failed","reason":"Failed to open a file using OpenSSL's BIO abstraction, likely due to file access permissions or a non-existent file.","resolution":"Check that the file exists and has proper permissions for the sendmail process to read it."},{"function":"inittls","message_template":"inittls: Generating %d bit DH parameters","reason":"Informational log indicating DH parameters of the specified bit length are being generated, which may take some time.","resolution":"Informational log, no resolution required. Consider pre-generating and storing DH parameters if this causes delays at startup."},{"function":"inittls","message_template":"inittls: Using precomputed 2048 bit DH parameters","reason":"Informational log indicating built-in 2048-bit DH parameters are being used.","resolution":"Informational log, no resolution required."},{"function":"inittls","message_template":"inittls: Using precomputed 512 bit DH parameters","reason":"Informational log indicating built-in 512-bit DH parameters are being used. Note that 512 bits is considered weak by modern standards.","resolution":"Consider using stronger DH parameters (2048 bits) for better security."},{"function":"inittls","message_template":"STARTTLS=%s, error: cannot read or set DH parameters(%s): %s","reason":"Failed to set up Diffie-Hellman parameters, with OpenSSL error details.","resolution":"Check the DH parameter configuration. Either use built-in parameters or provide a valid parameter file."},{"function":"inittls","message_template":"STARTTLS=%s, Diffie-Hellman init, key=%d bit (%c)","reason":"Informational log showing the Diffie-Hellman key size and type being used.","resolution":"Informational log, no resolution required."},{"function":"inittls","message_template":"STARTTLS=%s, EC_KEY_new_by_curve_name(NID_X9_62_prime256v1)=failed, error=%s","reason":"Failed to create a new elliptic curve key using the prime256v1 curve, with OpenSSL error details.","resolution":"Check if OpenSSL supports ECC (Elliptic Curve Cryptography) and if the prime256v1 curve is available in the build."},{"function":"inittls","message_template":"STARTTLS=%s, error: load verify locs %s, %s failed: %d","reason":"Failed to load CA certificate locations for verification, which may prevent proper certificate validation.","resolution":"Check that CA certificate files and paths exist and have proper permissions. Verify the CA certificates are in PEM format."},{"function":"inittls","message_template":"STARTTLS=%s, error: SSL_CTX_set_cipher_list(%s) failed, list ignored","reason":"Failed to set the cipher list, likely due to no valid ciphers being found in the specified list.","resolution":"Check the CipherList configuration and ensure it contains valid OpenSSL cipher strings. See OpenSSL documentation for valid cipher names."},{"function":"inittls","message_template":"STARTTLS=%s, error: SSL_CTX_set_ciphersuites(%s) failed, suites ignored","reason":"Failed to set TLS 1.3 cipher suites, likely due to no valid suites being found in the specified list.","resolution":"Check the CipherSuites configuration and ensure it contains valid TLS 1.3 cipher suite names. See OpenSSL documentation for valid suite names."},{"function":"inittls","message_template":"STARTTLS=%s, init=%d","reason":"Informational log about TLS initialization result.","resolution":"Informational log, no resolution required."},{"function":"getaltnames","message_template":"STARTTLS=%s, relay=%.100s, field=AltName, status=value contains non IA5","reason":"A certificate Subject Alternative Name contains characters that are not IA5 (ASCII), which may indicate a malformed certificate.","resolution":"Check the certificate for non-ASCII characters in alternative names. Re-issue the certificate if needed."},{"function":"getaltnames","message_template":"STARTTLS=%s, relay=%.100s, AltName=%s","reason":"Informational log showing a Subject Alternative Name from the certificate.","resolution":"Informational log, no resolution required."},{"function":"dane_res","message_template":"ERROR: dane_res: dane_vrfy_ctx=NULL","reason":"An internal error occurred in the DANE validation context handling.","resolution":"This is likely a software bug. Check for updates to sendmail or report the issue to the developers."},{"function":"dane_res","message_template":"dane_res: dane_vrfy_dane_enabled=%d, chk=%#x, res=%d","reason":"Debugging information about DANE validation settings and results.","resolution":"Informational log, no resolution required."},{"function":"dane_res","message_template":"dane_res: SSL_get0_dane_authority() depth=%d","reason":"Debugging information about DANE authority depth in the certificate chain.","resolution":"Informational log, no resolution required."},{"function":"dane_res","message_template":"dane_res: SSL_get0_dane_tlsa=%d, status=%s","reason":"Debugging information about DANE TLSA record status, with details on the type of match.","resolution":"Informational log, no resolution required."},{"function":"dane_res","message_template":"DANE_depth=%d, DANE_res=%d, SSL_get0_dane_tlsa=%d, fp=%s, status=%s","reason":"Detailed DANE validation result information, including certificate depth, DANE result code, fingerprint, and status description.","resolution":"Informational log, no resolution required."},{"function":"tls_get_info","message_template":"STARTTLS=%s, get_verify: %ld get_peer: 0x%lx","reason":"Debugging information about the verification result and peer certificate pointer.","resolution":"Informational log, no resolution required."},{"function":"tls_get_info","message_template":"STARTTLS=%s, relay=%.100s, field=%s, status=failed to extract CN","reason":"Failed to extract the Common Name field from the certificate subject or issuer, possibly due to a malformed certificate.","resolution":"Check the certificate format and structure. Consider replacing the certificate if it appears corrupted."},{"function":"tls_get_info","message_template":"STARTTLS=%s, relay=%.100s, field=%s, status=CN too long","reason":"The Common Name field in the certificate is too long to be processed properly.","resolution":"Use a certificate with a shorter Common Name. Most systems limit CNs to 64 characters or less."},{"function":"tls_get_info","message_template":"STARTTLS=%s, relay=%.100s, field=%s, status=CN contains NUL","reason":"The Common Name field in the certificate contains a NUL character, which could be a sign of a malicious certificate.","resolution":"This is a security issue. Reject the certificate and ask the sender to provide a valid certificate without embedded NUL characters."},{"function":"tls_get_info","message_template":"STARTTLS=%s, relay=%.100s, X509_digest=%d, CertFingerprintAlgorithm=%s","reason":"Failed to calculate a certificate fingerprint using the specified algorithm.","resolution":"Check if the CertFingerprintAlgorithm is supported by your OpenSSL version. Use a standard algorithm like 'sha256' or 'sha1'."},{"function":"tls_get_info","message_template":"tls_get_info: verifyok=%d, dane_vrfy_res=%d","reason":"Debugging information about certificate verification and DANE validation results.","resolution":"Informational log, no resolution required."},{"function":"tls_get_info","message_template":"STARTTLS=%s, relay=%.100s, version=%.16s, verify=%.16s, cipher=%.64s, bits=%.6s\/%.6s%s%s%s%s","reason":"Detailed information about a TLS connection, including TLS version, verification status, cipher, and key lengths.","resolution":"Informational log, no resolution required. If verification fails, check certificate trust settings and validity."},{"function":"tls_get_info","message_template":"STARTTLS=%s, cert-subject=%.256s, cert-issuer=%.256s, verifymsg=%s","reason":"Detailed certificate information including subject, issuer, and verification message.","resolution":"Informational log, no resolution required. If verification fails, the verifymsg provides details about the reason."},{"function":"endtls","message_template":"STARTTLS=%s, SSL_shutdown failed: %d","reason":"Failed to properly shut down the SSL connection, possibly due to network issues or SSL state problems.","resolution":"This is usually not critical but may indicate network issues or an abrupt connection termination. Check network stability if it occurs frequently."},{"function":"endtls","message_template":"STARTTLS=%s, SSL_shutdown not done","reason":"The SSL shutdown process was not completed fully, which is a common issue with OpenSSL's SSL_shutdown function.","resolution":"This is a known behavior with certain OpenSSL versions and is often harmless. Update to a newer OpenSSL version if this causes problems."},{"function":"tmp_rsa_key","message_template":"STARTTLS=server, tmp_rsa_key: RSA_generate_key failed!","reason":"Failed to generate a temporary RSA key for SSL sessions, which may affect backwards compatibility with older clients.","resolution":"Check OpenSSL installation and available memory. Try reducing the RSA key length in the configuration."},{"function":"tmp_rsa_key","message_template":"STARTTLS=server, tmp_rsa_key: new temp RSA key","reason":"Informational log indicating a new temporary RSA key was generated for SSL sessions.","resolution":"Informational log, no resolution required."},{"function":"apps_ssl_info_cb","message_template":"STARTTLS: info_callback where=0x%x, ret=%d","reason":"Debugging information from the SSL information callback, showing the SSL state and return code.","resolution":"Informational log, no resolution required."},{"function":"apps_ssl_info_cb","message_template":"STARTTLS: %s:%s","reason":"Informational log about the SSL state during connection establishment.","resolution":"Informational log, no resolution required."},{"function":"apps_ssl_info_cb","message_template":"STARTTLS: SSL3 alert %s:%s:%s","reason":"SSL alert received, which may indicate a problem with the TLS handshake or connection.","resolution":"Check the alert description. Common issues include certificate validation failures, unsupported protocol versions, or cipher mismatches."},{"function":"apps_ssl_info_cb","message_template":"STARTTLS: %s:failed in %s","reason":"SSL operation failed during a specific state in the handshake.","resolution":"Check logs for more specific error messages. This could indicate certificate problems, cipher negotiation issues, or network problems."},{"function":"apps_ssl_info_cb","message_template":"STARTTLS: %s:error in %s","reason":"SSL operation encountered an error during a specific state in the handshake.","resolution":"Check logs for more specific error messages. This could indicate certificate problems, cipher negotiation issues, or network problems."},{"function":"tls_verify_log","message_template":"STARTTLS: %s cert verify: depth=%d %s, state=%d, reason=%s","reason":"Certificate verification log showing the depth in the chain, subject name, verification state, and reason for failure if applicable.","resolution":"If verification failed, check the reason field for details. Common issues include expired certificates, untrusted issuers, or hostname mismatches."},{"function":"dane_get_tlsa","message_template":"dane_get_tlsa: chk=%#x, host=%s, n=%d, stat=entry found","reason":"Debugging information about TLSA record lookup for DANE validation, showing a successful lookup.","resolution":"Informational log, no resolution required."},{"function":"dane_get_tlsa","message_template":"dane_get_tlsa: chk=%#x, host=%s, stat=no valid entry found","reason":"Debugging information about TLSA record lookup for DANE validation, showing no valid records were found.","resolution":"If DANE validation is expected, check the DNS for properly configured TLSA records for the host."},{"function":"dane_verify","message_template":"dane_verify: cert=%p, supported=%d","reason":"Debugging information about DANE certificate verification, showing the certificate pointer and support status.","resolution":"Informational log, no resolution required."},{"function":"dane_verify","message_template":"dane_verify: alg=%d, mdalg=%d","reason":"Debugging information about DANE verification algorithms.","resolution":"Informational log, no resolution required."},{"function":"dane_verify","message_template":"dane_verify: alg=%d, r=%d, len=%d","reason":"Debugging information about DANE verification algorithm, result length, and expected length.","resolution":"Informational log, no resolution required."},{"function":"dane_verify","message_template":"dane_verify: status=match","reason":"Debugging information indicating a successful DANE TLSA record match.","resolution":"Informational log, no resolution required."},{"function":"dane_verify","message_template":"dane_verify: pubkey_fp=%s","reason":"Debugging information showing the public key fingerprint used in DANE verification.","resolution":"Informational log, no resolution required."},{"function":"ssl_dane_enable","message_template":"ssl_dane_enable: dane_vrfy_ctx=%p, dane_vrfy_dane_enabled=%d, dane_vrfy_chk=%#x","reason":"Debugging information about DANE verification context initialization.","resolution":"Informational log, no resolution required."},{"function":"ssl_dane_enable","message_template":"ssl_dane_enable: dane_tlsa=%p, n=%d, supported=%d","reason":"Debugging information about DANE TLSA records and support status.","resolution":"Informational log, no resolution required."},{"function":"ssl_dane_enable","message_template":"ssl_dane_enable: test=simulate SSL_dane_enable error","reason":"Debugging log indicating a simulated DANE enablement error for testing purposes.","resolution":"Informational test log, no resolution required."},{"function":"ssl_dane_enable","message_template":"STARTTLS=client, SSL_dane_enable=%d","reason":"Log showing the result of enabling DANE validation in the SSL session.","resolution":"If negative, check OpenSSL version and TLSA record availability. DANE support requires OpenSSL 1.1.0 or later with specific patches."},{"function":"ssl_dane_enable","message_template":"STARTTLS=client, SSL_dane_enable=%d, domain=%s","reason":"Log showing the result of enabling DANE validation in the SSL session for a specific domain.","resolution":"If negative, check OpenSSL version and TLSA record availability for the domain. DANE support requires OpenSSL 1.1.0 or later with specific patches."},{"function":"ssl_dane_enable","message_template":"TLSA, type=%d-%d-%d:%02x, status=unsupported_due_to_test","reason":"Test log indicating a TLSA record type is being treated as unsupported for testing purposes.","resolution":"Informational test log, no resolution required."},{"function":"ssl_dane_enable","message_template":"STARTTLS=client, %s=%d, type=%d-%d-%d, fp=%s","reason":"Log showing DANE TLSA record processing results, including record type and fingerprint.","resolution":"If the result is negative, check the TLSA record format and OpenSSL compatibility."},{"function":"ssl_dane_enable","message_template":"ssl_dane_enable: SSL_dane_tlsa_add=%d, u=%d, s=%d, d=%d, len=%d, fp=%s","reason":"Debugging information about adding a TLSA record to the SSL session for DANE validation.","resolution":"Informational log, no resolution required."},{"function":"ssl_dane_enable","message_template":"ssl_dane_enable: usable=%d","reason":"Debugging information showing the number of usable TLSA records for DANE validation.","resolution":"Informational log, no resolution required."},{"function":"ssl_dane_enable","message_template":"ERROR: ssl_dane_enable() INCONSISTENY: %d usable TLSA RRs found but \"supported\" flag is set (%d)","reason":"An inconsistency was detected where no usable TLSA records were found despite the supported flag being set.","resolution":"This is likely a software bug or DNS issue. Check that TLSA records exist and are properly formatted. Consider reporting the issue to sendmail developers."},{"function":"tls_verify_cb","message_template":"tls_verify_cb: tlsi_ctx=%p, vrfy_chk=%#x","reason":"Debugging information about the TLS verification callback context.","resolution":"Informational log, no resolution required."},{"function":"tls_verify_cb","message_template":"tls_verify_cb: enabled=%d, chk=%#x, depth=%d","reason":"Debugging information about the TLS verification settings and certificate depth.","resolution":"Informational log, no resolution required."},{"function":"tls_verify_cb","message_template":"tls_verify_cb: dane_verify=%d, res=%d","reason":"Debugging information about DANE verification result in the TLS callback.","resolution":"Informational log, no resolution required."},{"function":"tls_verify_cb","message_template":"tls_verify_cb: basic check? enabled=%d, chk=%#x","reason":"Debugging information about basic certificate checks in the TLS verification callback.","resolution":"Informational log, no resolution required."},{"function":"tlslogerr","message_template":"STARTTLS=%s: %s:%s:%d:%s","reason":"Logs detailed OpenSSL error information, including error string, source file, line number, and additional data.","resolution":"Check the specific OpenSSL error message for resolution. This provides low-level details about TLS\/SSL errors."},{"function":"TLS_set_engine","message_template":"engine=%s, path=%s, ispre=%d, pre=%d, initialized=%d","reason":"Debugging information about TLS engine initialization settings.","resolution":"Informational log, no resolution required."},{"function":"TLS_set_engine","message_template":"engine=%s, status=engines_not_support","reason":"The OpenSSL build does not support engines, which is required for hardware acceleration or custom cryptographic implementations.","resolution":"Rebuild OpenSSL with engine support if cryptographic hardware acceleration is needed."},{"function":"TLS_set_engine","message_template":"engine=%s, by_id=failed","reason":"Failed to load the specified engine by ID, which prevents using hardware acceleration or custom cryptographic implementations.","resolution":"Verify the engine ID is correct and that the engine is installed and available to OpenSSL."},{"function":"TLS_set_engine","message_template":"engine=%s, SO_PATH=%s, status=failed","reason":"Failed to set the shared object path for the dynamic engine, which prevents loading the engine.","resolution":"Check that the engine shared library exists at the specified path and is readable by the sendmail process."},{"function":"TLS_set_engine","message_template":"engine=%s, ID=failed","reason":"Failed to set the engine ID for a dynamic engine, which prevents properly identifying the engine.","resolution":"Check that the engine ID is correct and that the engine shared library is compatible with your OpenSSL version."},{"function":"TLS_set_engine","message_template":"engine=%s, LOAD=failed","reason":"Failed to load the engine, which prevents using hardware acceleration or custom cryptographic implementations.","resolution":"Check engine dependencies and compatibility with your OpenSSL version. Some engines require additional configuration."},{"function":"TLS_set_engine","message_template":"engine=%s, init=failed","reason":"Failed to initialize the engine, which prevents using it for cryptographic operations.","resolution":"Check engine-specific initialization requirements. Some engines require configuration files or hardware initialization steps."},{"function":"TLS_set_engine","message_template":"engine=%s, set_default=failed","reason":"Failed to set the engine as the default for cryptographic operations, which prevents its use.","resolution":"Check engine compatibility with your OpenSSL version. Some engines only support specific cryptographic operations."},{"function":"TLS_set_engine","message_template":"engine=%s, loaded=ok","reason":"Successfully loaded and initialized the specified cryptographic engine.","resolution":"Informational log, no resolution required."}]}