{"project":"sendmail","module":"udb.c","summary":"This module implements an interface between sendmail and user databases (Berkeley DB, Hesiod) for address expansion, validation, and mail forwarding. It provides mechanisms to map user addresses, retrieve mailing list information, and forward mail to appropriate destinations.","logs":[{"function":"udbexpand","message_template":"expanded to %s","reason":"Logs when an email address has been successfully expanded through database lookup","resolution":"Informational log, no resolution required"},{"function":"udbexpand","message_template":"expand %.100s => %s","reason":"Logs detailed information about address expansion, showing original and expanded addresses","resolution":"Informational log, no resolution required"},{"function":"udbexpand","message_template":"udbexpand: db-get %.*s stat %d","reason":"Logs an error when database retrieval fails during address expansion","resolution":"Check database permissions, integrity, and connectivity. May indicate a corrupted database or system resource issues."},{"function":"udbexpand","message_template":"Message delivered to mailing list %s\n","reason":"Logs successful delivery to a mailing list","resolution":"Informational log, no resolution required"},{"function":"udbexpand","message_template":"hes_getmailhost(%s): expansion too long: %.30s@%.30s\n","reason":"Logs an error when Hesiod expansion exceeds the maximum allowed length","resolution":"Check if the Hesiod configuration is generating unusually long addresses. Might require adjusting address length limits or fixing Hesiod entries."},{"function":"udbexpand","message_template":"hesioded to %s","reason":"Logs successful address expansion via Hesiod","resolution":"Informational log, no resolution required"},{"function":"udbexpand","message_template":"hesiod %.100s => %s","reason":"Logs detailed information about Hesiod address expansion","resolution":"Informational log, no resolution required"},{"function":"_udbx_init","message_template":"Maximum number of UDB entries exceeded","reason":"Logs an error when too many UDB entries are specified in the configuration","resolution":"Reduce the number of UDB entries in the configuration to be below MAXUDBENT (10). This happens when too many database sources are specified."},{"function":"_udbx_init","message_template":"dbopen(%s): %s","reason":"Logs an error when opening a Berkeley DB database fails","resolution":"Check database file permissions, existence, and integrity. Ensure the sendmail process has read access to the database file."},{"function":"_udbx_init","message_template":"db_open(%s): %s","reason":"Logs an error when opening a Berkeley DB database fails (newer DB version)","resolution":"Check database file permissions, existence, and integrity. Ensure the sendmail process has read access to the database file. May also indicate version compatibility issues with the Berkeley DB."},{"function":"_udbx_init","message_template":"Unknown UDB spec %s","reason":"Logs an error when an unrecognized database specification format is encountered","resolution":"Check and correct the UDB specification in the sendmail configuration. Valid formats include '@hostname', '\/dbname', and 'hesiod'."},{"function":"udbexpand","message_template":"udbexpand: hesiod-get %.*s stat %d","reason":"Logs an error when Hesiod lookup fails during address expansion","resolution":"Check if Hesiod is properly configured and functioning. May indicate network issues or problems with the Hesiod service."},{"function":"udbexpand","message_template":"udbexpand: hesiod-getmail %s stat %d","reason":"Logs an error when Hesiod mail host lookup fails","resolution":"Check if Hesiod is properly configured and functioning. Verify that the mail host entries exist in Hesiod."}]}