{"project":"sendmail","module":"usersmtp.c","summary":"The usersmtp.c module implements the client-side SMTP protocol for Sendmail, handling connections to remote mail servers, SMTP command sequences, authentication, and message delivery. It manages the entire SMTP transaction from connection initiation through DATA transmission to connection termination.","logs":[{"function":"smtpinit","message_template":"451 4.4.0 smtpinit: state CLOSED (was %d)","reason":"An unexpected state was encountered while trying to initialize an SMTP connection. The SMTP connection state should not be CLOSED at this point.","resolution":"This may indicate an internal state machine error in Sendmail. Check for other error messages that might indicate why the connection was closed prematurely."},{"function":"smtpinit","message_template":"553 5.3.5 %s config error: mail loops back to me (MX problem?)","reason":"The MX record for the destination domain points back to the local server, which would create a mail loop.","resolution":"Check the DNS MX records for the destination domain and ensure they don't point back to the sending server. This is typically a DNS configuration issue on the receiving domain."},{"function":"smtpdata","message_template":"+451 4.4.1 timeout writing message to %s","reason":"A timeout occurred while writing the message data to the remote SMTP server.","resolution":"Check network connectivity and remote server health. The remote server may be overloaded or have connection issues. This often requires retrying later."},{"function":"reply","message_template":"421 4.4.1 Connection reset by %s","reason":"The remote server unexpectedly closed the connection during an SMTP transaction.","resolution":"This may be due to network issues, remote server problems, or timeouts. Check network connectivity and remote server status. Often retrying later will succeed."},{"function":"reply","message_template":"451 4.4.2 reply: read error from %s","reason":"Failed to read a response from the remote SMTP server, possibly due to a network error or server disconnect.","resolution":"Verify network connectivity to the remote server. The issue could be due to network problems, firewall issues, or the remote server failing. Retry the connection later."},{"function":"smtpquit","message_template":"smtpquit: mailer%s%s exited with exit value %d","reason":"The mailer process exited with a non-zero status code when closing an SMTP connection.","resolution":"Check logs for additional error messages. This may indicate a problem with the mailer process or its environment. Could be related to resource issues or configuration problems."},{"function":"smtpmailfrom","message_template":"%.100s: SMTP MAIL protocol error: %s","reason":"The remote SMTP server returned an unexpected or malformed response to the MAIL FROM command.","resolution":"This indicates a protocol incompatibility or error in the remote SMTP server. Check if the remote server is compliant with SMTP standards or has unusual requirements."},{"function":"smtprcpt","message_template":"%.100s: SMTP RCPT protocol error: %s","reason":"The remote SMTP server returned an unexpected or malformed response to the RCPT TO command.","resolution":"This could indicate a problem with the recipient address format or a protocol issue with the remote server. Verify the recipient address format is correct and check if the server has special requirements."},{"function":"smtpdata","message_template":"%.100s: SMTP DATA-1 protocol error: %s","reason":"The remote SMTP server returned an unexpected or malformed response to the DATA command.","resolution":"This indicates a protocol incompatibility with the remote mail server. The server may be malfunctioning or not fully SMTP compliant. You may need to report the issue to the administrators of the remote server."},{"function":"smtpdata","message_template":"%.100s: SMTP DATA-2 protocol error: %s","reason":"The remote SMTP server returned an unexpected or malformed response after sending the message data.","resolution":"This could indicate that the server is not properly acknowledging the message data. Check for server compatibility issues or network problems during transmission."},{"function":"smtpgetstat","message_template":"%.100s: SMTP DATA-3 protocol error: %s","reason":"The remote SMTP server returned an unexpected or malformed response when getting delivery status in LMTP mode.","resolution":"This is specific to LMTP (Local Mail Transport Protocol) interactions. Check if the LMTP server is functioning correctly and following the protocol specification."},{"function":"smtpdata","message_template":"%.100s: SMTP DATA-1 protocol error: remote server returned response before final dot","reason":"The remote SMTP server sent a response before the message data was completely transmitted (before the final dot was sent).","resolution":"This indicates a non-compliant or misbehaving SMTP server. The server is responding too early in the protocol exchange. Report the issue to the administrators of the remote server."},{"function":"esmtp_check","message_template":"server=%s [%s] returned extensions despite HELO command","reason":"The server improperly returned SMTP extensions in response to a HELO command, which should only happen for EHLO.","resolution":"This is a minor protocol violation by the remote server. It's usually harmless but indicates the server might not be fully compliant with SMTP standards."},{"function":"str_union","message_template":"str_union: stringlen1=%d, stringlen2=%d, sum=%d, status=overflow","reason":"A string length calculation resulted in an integer overflow when combining SASL authentication mechanism lists.","resolution":"This indicates an internal error in string handling, possibly due to extremely long authentication mechanism lists. Check your SASL configuration for unusually long mechanism lists."},{"function":"readauth","message_template":"AUTH=client, error: can't open %s: %s","reason":"Failed to open the SASL authentication information file for SMTP authentication.","resolution":"Verify that the authentication file exists, has proper permissions, and is readable by the Sendmail process. Check the error message for specific file access issues."},{"function":"readauth","message_template":"AUTH=client, error: can't read %s from %s","reason":"Failed to read required authentication information from the SASL auth file.","resolution":"Check that the authentication file contains all required fields and is properly formatted. The file may be corrupted or incomplete."},{"function":"getauth","message_template":"AUTH=client, relay=%.64s [%.16s], authinfo %sfailed","reason":"Failed to obtain authentication information for the specified relay server.","resolution":"Verify your authentication configuration for the specified relay. This could be due to missing or invalid authentication data. Check authinfo database or files."},{"function":"safesaslfile","message_template":"error: safesasl(%s) failed: %s","reason":"A security check on a SASL configuration file failed, preventing its use for authentication.","resolution":"Check the file permissions and ownership of the SASL file. It may have inappropriate permissions that pose a security risk, or it may not be accessible to the Sendmail process."},{"function":"saslgetrealm","message_template":"AUTH=client, realm=%s, available realms=%s","reason":"Informational message showing the authentication realm being used and the available realms.","resolution":"This is an informational log message for debugging SASL authentication realms. No action is required unless realm selection is not as expected."},{"function":"saslgetrealm","message_template":"AUTH=client, realm=%s not in list=%s","reason":"The authentication realm specified is not in the list of available realms provided by the server.","resolution":"Configure the client to use one of the realms offered by the server, or configure the server to accept the realm used by the client."},{"function":"attemptauth","message_template":"AUTH=client, available mechanisms=%s do not fulfill requirements","reason":"None of the authentication mechanisms available on the server meet the client's requirements.","resolution":"Check the SASL mechanism configuration on both client and server to ensure compatible mechanisms are enabled. You may need to enable additional authentication mechanisms on the server."},{"function":"attemptauth","message_template":"encode64 for AUTH failed","reason":"The Base64 encoding of authentication credentials failed during the SMTP AUTH process.","resolution":"This indicates an internal error in the SASL library or issues with the credentials being encoded. Check the authentication data for any invalid characters or formatting issues."},{"function":"attemptauth","message_template":"AUTH FAIL=%s (%d)","reason":"The SASL authentication attempt failed with the specified error.","resolution":"Check the provided error message and code to understand why authentication failed. Common issues include invalid credentials, unsupported mechanisms, or server configuration problems."}]}