{"project":"sendmail","module":"util.c","summary":"Provides core utility functions for Sendmail including string manipulation, process management, file handling, and logging functionality. It handles error detection, logging operations, and security checks throughout the application.","logs":[{"function":"log_sendmail_pid","message_template":"unable to write pid to %s: file in use by another process","reason":"Logs an error when the PID file is locked by another process, indicating another instance of sendmail might be running.","resolution":"Check if another sendmail process is running. If not, manually remove the PID file and restart sendmail."},{"function":"log_sendmail_pid","message_template":"unable to write pid to %s: %s","reason":"Logs an error when the PID file cannot be written for reasons other than being locked by another process.","resolution":"Check file system permissions and available disk space. Ensure the directory for the PID file exists and is writable by the sendmail user."},{"function":"log_sendmail_pid","message_template":"started as: %s","reason":"Logs the command line arguments used to start sendmail when LogLevel > 9.","resolution":"Informational message, no resolution required."},{"function":"xunlink","message_template":"unlink %s","reason":"Logs file deletion operations at a debug level (LogLevel > 98).","resolution":"Informational message for debugging, no resolution required."},{"function":"xunlink","message_template":"%s: unlink-fail %d","reason":"Logs failed file deletion attempts with the errno at debug level (LogLevel > 97).","resolution":"Check file permissions and whether the file exists. Might indicate file system issues or permission problems."},{"function":"sfgets","message_template":"timeout waiting for input from %.100s during %s","reason":"Logs when a read operation times out while waiting for input, usually during SMTP transactions.","resolution":"Check network connectivity with the remote host. The timeout might be caused by network congestion, a slow client, or a client that has disconnected unexpectedly."},{"function":"denlstring","message_template":"POSSIBLE ATTACK from %.100s: newline in string \"%s\"","reason":"Logs a possible security attack when a string contains newlines, which could indicate a command injection attempt.","resolution":"Investigate the source of the request as this could be a sign of a security attack. Consider adding the source IP to access restrictions if attacks persist."},{"function":"proc_list_probe","message_template":"proc_list_probe: lost pid %d","reason":"Logs when a process in the process list can no longer be found, indicating the process has terminated without proper cleanup.","resolution":"Usually indicates a process crashed or was killed externally. Check system logs for crash information or resource problems if this occurs frequently."},{"function":"proc_list_probe","message_template":"proc_list_probe: found %d children, expected %d","reason":"Logs a discrepancy between the counted child processes and the expected number, indicating a problem with process tracking.","resolution":"This may indicate a bug in sendmail's process management. If persistent, consider restarting sendmail or reporting the issue to developers."},{"function":"checkfdopen","message_template":"checkfdopen(%d): %s not open as expected!","reason":"Logs when a file descriptor is unexpectedly closed or invalid, which can lead to I\/O errors.","resolution":"This indicates a potential software bug or resource issue. Check if the system has reached its file descriptor limit or if there are permission problems."},{"function":"prog_open","message_template":"%s: cannot create pipe for stdout","reason":"Logs an error when creating a pipe for a child process fails, likely due to system resource limits.","resolution":"Check system limits for open files and pipes. Consider increasing system limits or reducing the number of concurrent processes."},{"function":"prog_open","message_template":"%s: cannot fork","reason":"Logs an error when attempting to fork a new process fails, typically due to system resource limits.","resolution":"The system may be out of memory or process slots. Check system resources, reduce load, or increase system limits for processes."},{"function":"prog_open","message_template":"%s: cannot dup2 for stdout","reason":"Logs an error when redirecting stdout for a child process fails.","resolution":"This usually indicates a resource issue or a bug. Check system limits for file descriptors and process resources."},{"function":"prog_open","message_template":"%s: cannot dup2 for stderr","reason":"Logs an error when redirecting stderr for a child process fails.","resolution":"Similar to stdout redirection errors, this indicates a resource issue. Check system limits and available file descriptors."},{"function":"prog_open","message_template":"%s: lockfp does not have a fd","reason":"Logs an error when the lock file pointer does not have a valid file descriptor.","resolution":"This indicates a bug in the code or corruption in file handling. Restart sendmail and check for consistency in your configuration."},{"function":"prog_open","message_template":"prog_open: cannot chroot(%s)","reason":"Logs an error when the chroot operation fails, which may affect security containment of child processes.","resolution":"Ensure the chroot directory exists and that sendmail has sufficient permissions. This often requires root privileges."},{"function":"prog_open","message_template":"prog_open: cannot chdir(\/)","reason":"Logs an error when changing to root directory after chroot fails.","resolution":"This suggests corruption in the chroot environment. Ensure the chroot directory has a proper structure with required directories."},{"function":"prog_open","message_template":"prog_open: setgid(%ld) failed","reason":"Logs an error when setting the group ID for a child process fails, affecting process security.","resolution":"Check that the specified GID exists and that sendmail has sufficient privileges (usually root) to change GIDs."},{"function":"prog_open","message_template":"prog_open: setuid(%ld) failed","reason":"Logs an error when setting the user ID for a child process fails, affecting process security.","resolution":"Check that the specified UID exists and that sendmail has sufficient privileges (usually root) to change UIDs."},{"function":"prog_open","message_template":"Warning: prog_open: program %s unsafe: %s","reason":"Logs a warning when a program to be executed is deemed unsafe according to security checks.","resolution":"Check the permissions and ownership of the program being executed. It may be world-writable or in an unsafe directory. Adjust permissions to make it more secure."},{"function":"prog_open","message_template":"%s: cannot exec","reason":"Logs an error when executing a program fails, which can affect mail delivery or processing.","resolution":"Ensure the program exists and is executable. Check permissions, paths, and that all required libraries are available."},{"function":"cleanstrcpy","message_template":"!cleanstrcpy: length == 0","reason":"Logs a critical error when trying to copy a string with zero buffer length, indicating a programming error.","resolution":"This indicates a bug in the code. Report the issue to the sendmail developers with information about your configuration."},{"function":"xconnect","message_template":"x-connect: rscap=%d","reason":"Logs the result of a ruleset capability check for X-CONNECT functionality at debug level.","resolution":"Informational message for debugging, no resolution required unless the value indicates an error."},{"function":"xconnect","message_template":"x-connect: nope","reason":"Logs that X-CONNECT functionality was rejected by the ruleset at debug level.","resolution":"Informational message for debugging, no resolution required unless X-CONNECT functionality is desired."},{"function":"xconnect","message_template":"x-connect: input=%s","reason":"Logs the input received for an X-CONNECT request at debug level.","resolution":"Informational message for debugging, no resolution required."},{"function":"xconnect","message_template":"haproxy: input=%s, status=ignored","reason":"Logs when HAProxy input is ignored, typically when the UNKNOWN status is received.","resolution":"This might indicate a configuration issue with HAProxy. Check HAProxy configuration and ensure it's correctly identifying the connection."},{"function":"xconnect","message_template":"x-connect: addr=%s","reason":"Logs the address parsed from an X-CONNECT request at debug level.","resolution":"Informational message for debugging, no resolution required."},{"function":"xconnect","message_template":"x-connect: host=%s","reason":"Logs the hostname parsed from an X-CONNECT request at debug level.","resolution":"Informational message for debugging, no resolution required."},{"function":"xconnect","message_template":"x-connect: rest=%s","reason":"Logs the remaining part of an X-CONNECT request after parsing at debug level.","resolution":"Informational message for debugging, no resolution required."}]}