{"project":"sendmail","module":"..\/working\/sendmail\/include\/libmilter\/mfapi.h","summary":"This header file defines the API for libmilter, a mail filter library for Sendmail. It provides functions and structures that mail filters can use to interact with the Mail Transfer Agent (MTA), including examining and modifying messages during SMTP transactions.","logs":[{"function":"smfi_setreply","message_template":"N\/A - Sets SMTP reply that may appear in logs","reason":"This function allows a filter to set a specific SMTP reply code and message which will be returned to the SMTP client and likely logged in SMTP transaction logs","resolution":"The specific resolution depends on the reply code and message set by the filter. Check the filter's logic to understand why it's setting this specific reply."},{"function":"smfi_setmlreply","message_template":"N\/A - Sets multi-line SMTP reply that may appear in logs","reason":"This function allows a filter to set a multi-line SMTP reply which will be returned to the SMTP client and likely logged in SMTP transaction logs","resolution":"The specific resolution depends on the multi-line reply set by the filter. Check the filter's logic to understand why it's setting this specific reply."},{"function":"smfi_quarantine","message_template":"N\/A - Quarantine reason provided by filter","reason":"This function quarantines an email with a specified reason. The quarantine action and reason are likely logged by the MTA","resolution":"Review the quarantine reason to understand why the filter decided to quarantine the message. This might be due to spam, malware, or other policy violations."},{"function":"smfi_addheader","message_template":"N\/A - Header addition operation","reason":"This function adds a header to the message, which might be logged by the MTA as a message modification","resolution":"This is typically an informational operation. If unexpected headers are being added, review the filter's logic to understand why."},{"function":"smfi_chgheader","message_template":"N\/A - Header change\/deletion operation","reason":"This function changes or deletes a header in the message, which might be logged by the MTA as a message modification","resolution":"This is typically an informational operation. If unexpected header modifications are occurring, review the filter's logic to understand why."},{"function":"smfi_insheader","message_template":"N\/A - Header insertion operation","reason":"This function inserts a header into the message, which might be logged by the MTA as a message modification","resolution":"This is typically an informational operation. If unexpected headers are being inserted, review the filter's logic to understand why."},{"function":"smfi_chgfrom","message_template":"N\/A - Sender address modification","reason":"This function modifies the envelope sender address, which might be logged by the MTA as a significant message modification","resolution":"Review why the filter is changing the sender address. This is a significant modification that could affect message delivery and replies."},{"function":"smfi_addrcpt","message_template":"N\/A - Recipient addition operation","reason":"This function adds a recipient to the envelope, which might be logged by the MTA as a message modification","resolution":"This is typically used for adding BCC recipients or for mail archiving. If unexpected recipients are being added, review the filter's logic."},{"function":"smfi_delrcpt","message_template":"N\/A - Recipient deletion operation","reason":"This function deletes a recipient from the envelope, which might be logged by the MTA as a message modification","resolution":"This might be used to implement recipient-based filtering. If legitimate recipients are being removed, review the filter's configuration."},{"function":"smfi_replacebody","message_template":"N\/A - Body replacement operation","reason":"This function replaces the body of the message, which might be logged by the MTA as a significant message modification","resolution":"This is typically used for content filtering, disclaimer addition, or virus removal. If unexpected body modifications are occurring, review the filter's logic."},{"function":"smfi_progress","message_template":"No-op message to keep connection alive","reason":"This function sends a 'no-op' to the MTA to indicate the filter is still processing and prevent timeout","resolution":"If many of these messages appear, it could indicate that the filter is taking too long to process. Consider optimizing the filter or increasing timeouts."}]}