{"module":"util_ldap_cache_mgr.c","summary":"This module manages LDAP caching functionality for Apache, handling creation, purging, insertion, fetching, and removal of entries from LDAP caches. It provides memory management for LDAP cache operations and displays cache statistics.","logs":[{"function":"util_ald_cache_insert","message_template":"Purge of LDAP cache failed","reason":"The cache is full and the purge operation did not free up enough space to insert a new entry. Likely due to cache size constraints or high concurrent usage.","resolution":"Increase the LDAPSharedCacheSize, LDAPCacheEntries, or LDAPOpCacheEntries values in your Apache configuration. Consider reducing the TTL to allow faster cache turnover."},{"function":"util_ald_cache_insert","message_template":"LDAPSharedCacheSize is too small. Increase it or reduce LDAPCacheEntries\/LDAPOpCacheEntries!","reason":"Cannot allocate memory for a new cache node because the shared memory cache size is too small for the number of entries being cached.","resolution":"Increase the LDAPSharedCacheSize directive value in your Apache configuration or reduce LDAPCacheEntries and LDAPOpCacheEntries values to fit within the available shared memory."},{"function":"util_ald_cache_insert","message_template":"Could not allocate memory for LDAP cache entry","reason":"Even after purging the cache, memory allocation for a new cache node still failed. Indicates severely constrained memory resources.","resolution":"Significantly increase the LDAPSharedCacheSize value or decrease the number of cache entries. Check system memory usage and ensure sufficient resources are available to Apache."},{"function":"util_ald_cache_insert","message_template":"LDAPSharedCacheSize is too small. Increase it or reduce LDAPCacheEntries\/LDAPOpCacheEntries!","reason":"Cannot allocate memory for a cache payload value because the shared memory cache size is too small for the content being stored.","resolution":"Increase the LDAPSharedCacheSize directive value in your Apache configuration or reduce LDAPCacheEntries and LDAPOpCacheEntries values to fit within the available shared memory."},{"function":"util_ald_cache_insert","message_template":"Could not allocate memory for LDAP cache value","reason":"Even after purging the cache, memory allocation for a payload value still failed. Indicates severely constrained memory resources or very large entry sizes.","resolution":"Significantly increase the LDAPSharedCacheSize value or decrease the number of cache entries. Consider optimizing LDAP queries to return smaller result sets."}],"project":"apache\/httpd"}