{"project":"sendmail","module":"comm.c","summary":"The comm.c module handles socket communication between sendmail and milter plugins, providing functions to read and write commands with timeouts and error handling. It implements the low-level communication protocol for the libmilter library, ensuring reliable data exchange even with large payloads.","logs":[{"function":"mi_rd_cmd","message_template":"%s, mi_rd_cmd: read returned %d: %s","reason":"Logs an error when a socket read operation fails during the initial phase of reading a command. The error occurs when trying to read the command header.","resolution":"Check network connectivity, socket permissions, and whether the milter process is still running. This could indicate a network interruption or the remote end closing the connection unexpectedly."},{"function":"mi_rd_cmd","message_template":"%s: mi_rd_cmd: %s() returned %d: %s","reason":"Logs an error when the select\/poll operation fails during the initial command reading phase, indicating the socket is not ready for reading.","resolution":"Verify system resources like file descriptors are not exhausted. The issue might be related to system limits, socket configuration, or an overloaded system."},{"function":"mi_rd_cmd","message_template":"%s: mi_rd_cmd: read returned %d: %s","reason":"Logs an error when a socket read operation fails during the data phase of reading a command, after the header has been successfully read.","resolution":"Check for network stability issues or whether the milter process terminated during transmission. May require increasing timeout values if data transfers are large or network is slow."},{"function":"mi_rd_cmd","message_template":"%s: mi_rd_cmd: %s() returned %d: %s","reason":"Logs an error when the select\/poll operation fails during the data phase of reading a command, indicating the socket is not ready for reading the command payload.","resolution":"Check for system resource constraints or network issues. May indicate problems with socket buffer settings or network congestion causing timeouts."}]}