{"project":"sendmail","module":"..\/working\/sendmail\/libmilter\/example.c","summary":"This module implements a sample mail filter (milter) that demonstrates how to archive email messages to files. It processes email messages by saving them to temporary files and adds an 'X-Archived' header to indicate the message was processed by the filter.","logs":[{"function":"mlfi_cleanup","message_template":"localhost","reason":"Used as a fallback hostname when gethostname() fails, to ensure the X-Archived header has a valid domain component.","resolution":"This is a fallback value and not an error. If this appears frequently, check if the system hostname is properly configured."},{"function":"mlfi_cleanup","message_template":"%s@%s","reason":"Format used to create the value for the X-Archived header, combining the archive filename with the hostname.","resolution":"Informational, no resolution required. This creates a unique identifier for the archived message."},{"function":"mlfi_cleanup","message_template":"X-Archived","reason":"Header name added to processed emails to indicate they have been archived by this filter.","resolution":"Informational, no resolution required. This header is expected to be present in all successfully processed messages."},{"function":"mlfi_envfrom","message_template":"\/tmp\/msg.XXXXXXXX","reason":"Template for creating a unique temporary file to store the email message.","resolution":"If file creation fails, ensure the \/tmp directory exists, has proper permissions, and has adequate disk space. This is critical for the filter to function."},{"function":"mlfi_envfrom","message_template":"w+","reason":"File mode used when opening the temporary file, allowing for both reading and writing.","resolution":"Informational, no resolution required. If file operations fail, check file system permissions and available space."},{"function":"mlfi_header","message_template":"%s: %s\r\n","reason":"Format used to write email headers to the archive file, preserving the header name and value format.","resolution":"Informational, no resolution required. If writing fails, the filter will abort and report a temporary failure to the MTA."},{"function":"mlfi_eoh","message_template":"\r\n","reason":"Writes a blank line to separate the email headers from the body in the archive file.","resolution":"Informational, no resolution required. Part of the standard email format."},{"function":"main","message_template":"Illegal conn: %s\n","reason":"Reports an error when the connection string specified with the -p option is invalid or empty.","resolution":"Provide a valid connection string with the -p option. Connection strings should follow the format specified in the libmilter documentation, such as 'inet:port@host' or 'unix:\/path\/to\/socket'."},{"function":"main","message_template":"%s: Missing required -p argument\n","reason":"Reports an error when the required -p argument specifying the connection information is missing.","resolution":"Launch the program with the -p option followed by a valid connection string, such as '-p inet:8025@localhost' or '-p unix:\/var\/run\/milter.sock'."},{"function":"main","message_template":"smfi_register failed\n","reason":"Reports an error when the filter fails to register with the milter library, preventing it from starting.","resolution":"This typically indicates a configuration problem or resource limitation. Check system resources, ensure the filter has necessary permissions, and verify libmilter is correctly installed."}]}