{"project":"sendmail","module":"libmilter\/listener.c","summary":"This module implements socket management for sendmail milter filters, handling socket creation, binding, listening for connections, and spawning threads to process accepted connections with proper error handling and recovery mechanisms.","logs":[{"function":"mi_opensocket","message_template":"%s: Opening listen socket on conn %s","reason":"Debug message indicating that a listening socket is being opened for the specified connection string","resolution":"Informational log, no resolution required"},{"function":"mi_opensocket","message_template":"%s: Unable to create listening socket on conn %s","reason":"The filter failed to create a listening socket using the specified connection information","resolution":"Check the connection string format and ensure it's valid. Verify network configuration and permissions for creating sockets."},{"function":"mi_opensocket","message_template":"%s: fd %d is larger than FD_SETSIZE %d","reason":"The socket file descriptor is larger than the FD_SETSIZE limit, which prevents it from being used with select()","resolution":"Decrease the number of open file descriptors or recompile with a larger FD_SETSIZE. Consider using poll() or epoll() instead of select()."},{"function":"mi_milteropen","message_template":"%s: empty or missing socket information","reason":"The connection string passed to mi_milteropen is empty or NULL","resolution":"Check the filter configuration to ensure a valid connection string is provided for the filter's socket."},{"function":"mi_milteropen","message_template":"%s: no valid socket protocols available","reason":"No socket protocols (UNIX, INET, INET6) are available in the current build","resolution":"Recompile sendmail with at least one socket protocol enabled (NETUNIX, NETINET, or NETINET6)."},{"function":"mi_milteropen","message_template":"%s: unknown socket type %s","reason":"The socket type specified in the connection string is not recognized","resolution":"Use a supported socket type (unix, local, inet, or inet6) in the connection string."},{"function":"mi_milteropen","message_template":"%s: UNIX socket name %s too long","reason":"The path for the UNIX domain socket exceeds the maximum allowed length","resolution":"Use a shorter path for the UNIX socket, possibly by using a relative path or moving it to a location with a shorter path."},{"function":"mi_milteropen","message_template":"%s: UNIX socket name %s unsafe","reason":"The specified UNIX socket path failed safety checks (permissions, ownership, etc.)","resolution":"Ensure the directory for the socket has proper permissions and is owned by the same user running the filter."},{"function":"mi_milteropen","message_template":"%s: invalid port number %s","reason":"The specified port number in the connection string is not a valid number","resolution":"Use a valid port number (1-65535) or a service name in the connection string."},{"function":"mi_milteropen","message_template":"%s: unknown port name %s","reason":"The port name specified in the connection string is not a known service name","resolution":"Use a valid service name that exists in \/etc\/services or specify a numeric port instead."},{"function":"mi_milteropen","message_template":"%s: Invalid numeric domain spec \"%s\"","reason":"The IP address specified in the connection string is not a valid IPv4 or IPv6 address","resolution":"Correct the IP address format in the connection string. For IPv6, ensure it's properly enclosed in square brackets."},{"function":"mi_milteropen","message_template":"%s: Unknown host name %s","reason":"The hostname specified in the connection string could not be resolved","resolution":"Check DNS configuration and ensure the hostname is resolvable. Consider using an IP address instead if the hostname resolution is unreliable."},{"function":"mi_milteropen","message_template":"%s: Unknown protocol for %s (%d)","reason":"The address family returned by hostname resolution is not supported","resolution":"The hostname resolved to an unsupported address family. Ensure IPv4 or IPv6 is enabled and properly configured on the system."},{"function":"mi_milteropen","message_template":"%s: Unable to create new socket: %s","reason":"Failed to create a new socket, possibly due to resource limits or permissions","resolution":"Check system limits for maximum number of sockets and file descriptors. Ensure the process has proper permissions to create sockets."},{"function":"mi_milteropen","message_template":"%s: Unable to set close-on-exec: %s","reason":"Failed to set the close-on-exec flag on the socket","resolution":"This is typically a system resource issue. Check if the system is low on file descriptors or if there are other resource constraints."},{"function":"mi_milteropen","message_template":"%s: set reuseaddr failed (%s)","reason":"Failed to set the SO_REUSEADDR option on the socket","resolution":"This is usually not critical but might cause problems restarting the filter. Check system resource issues or permissions for socket options."},{"function":"mi_milteropen","message_template":"%s: Unable to stat() %s: %s","reason":"Failed to stat() the UNIX socket file, which is needed before unlinking it","resolution":"Check permissions on the socket file and the directory containing it. Ensure the filter has read access to the socket path."},{"function":"mi_milteropen","message_template":"%s: %s is not a UNIX domain socket","reason":"A file exists at the UNIX socket path but it's not a socket file","resolution":"Remove or rename the existing file at the socket path, as it's preventing the filter from creating its socket."},{"function":"mi_milteropen","message_template":"%s: Unable to remove %s: %s","reason":"Failed to unlink (remove) an existing UNIX socket file","resolution":"Check if the filter has write permissions to the socket file and directory. The socket file might be in use by another process."},{"function":"mi_milteropen","message_template":"%s: Unable to bind to port %s: %s","reason":"Failed to bind to the specified port, possibly because it's already in use","resolution":"Ensure the port is not already in use by another process. You may need to wait for the port to be released or choose a different port."},{"function":"mi_milteropen","message_template":"%s: listen call failed: %s","reason":"The listen() system call failed on the socket","resolution":"Check system resource limits and ensure the socket type supports listen(). For UNIX sockets, ensure proper permissions on the socket file."},{"function":"mi_milteropen","message_template":"%s: can't malloc(%d) for sockpath: %s","reason":"Failed to allocate memory for storing the UNIX socket path","resolution":"The system is likely low on memory. Check overall system memory usage and consider increasing available memory."},{"function":"mi_listener","message_template":"MI_SLEEP(): select() returned non-zero result %d, errno = %d","reason":"An error occurred while trying to sleep using select() as a sleep mechanism","resolution":"This is typically a transient error. If it occurs frequently, check for system resource issues or signal handling problems."},{"function":"mi_listener","message_template":"%s: listenfd=%d corrupted, terminating, errno=%d","reason":"The listening socket file descriptor has become invalid","resolution":"This indicates a serious internal error or resource issue. Restart the filter and check for system stability issues or resource problems."},{"function":"mi_listener","message_template":"%s: %s() failed (%s), %s","reason":"A system call (select\/poll) failed while waiting for connections","resolution":"The error message includes either 'try again' or 'abort' indicating whether recovery is being attempted. Check system resources and signal handling."},{"function":"mi_listener","message_template":"%s: %s() returned exception for socket, abort","reason":"The select\/poll call indicated an exception condition on the socket","resolution":"This indicates a serious socket issue. Check network stability and socket configuration. The filter will terminate and need to be restarted."},{"function":"mi_listener","message_template":"%s: accept() returned invalid socket (%s), %s","reason":"Failed to accept a new connection, possibly due to resource issues or client disconnect","resolution":"The error message indicates whether recovery is being attempted ('try again') or if the filter will abort. Check system resources, especially file descriptor limits."},{"function":"mi_listener","message_template":"%s: Unable to set close-on-exec: %s","reason":"Failed to set the close-on-exec flag on a newly accepted socket","resolution":"This is usually non-fatal but could lead to resource leaks if the filter spawns child processes. Check system resource limits."},{"function":"mi_listener","message_template":"%s: set keepalive failed (%s)","reason":"Failed to set the SO_KEEPALIVE option on a newly accepted socket","resolution":"This is a warning and not critical. Connections might not detect disconnects as quickly without keepalive. Check system resources or socket option permissions."},{"function":"mi_listener","message_template":"%s: malloc(ctx) failed (%s), %s","reason":"Failed to allocate memory for a new connection context","resolution":"The system is likely low on memory. The error includes 'try again' or 'abort' indicating recovery attempts. Check system memory usage and availability."},{"function":"mi_listener","message_template":"%s: mi_start_session() failed: %d, %s","reason":"Failed to start a new session for an accepted connection in the worker pool","resolution":"The error message indicates whether recovery is being attempted. Check system resources, especially thread limits and memory."},{"function":"mi_listener","message_template":"%s: thread_create() failed: %d, %s","reason":"Failed to create a new thread to handle an accepted connection","resolution":"The system may have reached its thread limit or be low on memory. Check system thread limits and overall resource usage."},{"function":"mi_listener","message_template":"%s=%s","reason":"Informational message indicating the filter is stopping, with status 'terminating' (normal) or 'aborting' (error)","resolution":"If 'terminating', this is normal shutdown. If 'aborting', check previous error logs to determine the cause of the abnormal termination."}]}