{"project":"sendmail","module":"smfi.c","summary":"This module implements the Milter API functions that allow mail filtering applications to communicate with sendmail. It provides functions for modifying email headers, body, recipients, and setting SMTP responses during mail processing.","logs":[{"function":"smfi_header","message_template":"Failed to allocate memory for header operation","reason":"Memory allocation failure when attempting to create a buffer for header operations (add, insert, change).","resolution":"Check system memory usage and possibly increase available memory. If this occurs frequently, the filter may need to be optimized for lower memory usage."},{"function":"smfi_addheader","message_template":"Failed to add header - operation not permitted by MTA","reason":"The filter attempted to add a header but doesn't have permission from the MTA to perform this operation (SMFIF_ADDHDRS not set).","resolution":"Review milter configuration to ensure proper capabilities are negotiated with sendmail. The filter must register for the SMFIF_ADDHDRS capability during registration."},{"function":"smfi_insheader","message_template":"Failed to insert header - operation not permitted by MTA","reason":"The filter attempted to insert a header but doesn't have permission from the MTA to perform this operation (SMFIF_ADDHDRS not set).","resolution":"Review milter configuration to ensure proper capabilities are negotiated with sendmail. The filter must register for the SMFIF_ADDHDRS capability during registration."},{"function":"smfi_chgheader","message_template":"Failed to change header - operation not permitted by MTA","reason":"The filter attempted to change a header but doesn't have permission from the MTA to perform this operation (SMFIF_CHGHDRS not set).","resolution":"Review milter configuration to ensure proper capabilities are negotiated with sendmail. The filter must register for the SMFIF_CHGHDRS capability during registration."},{"function":"send2","message_template":"Failed to allocate memory for command buffer","reason":"Memory allocation failure when attempting to create a buffer for sending commands to the MTA.","resolution":"Check system memory usage and possibly increase available memory. If this occurs frequently, the filter may need to be optimized for lower memory usage."},{"function":"smfi_chgfrom","message_template":"Failed to change from address - operation not permitted by MTA","reason":"The filter attempted to change the envelope sender but doesn't have permission from the MTA to perform this operation (SMFIF_CHGFROM not set).","resolution":"Review milter configuration to ensure proper capabilities are negotiated with sendmail. The filter must register for the SMFIF_CHGFROM capability during registration."},{"function":"smfi_setsymlist","message_template":"Failed to set symbol list - memory allocation failure","reason":"Memory allocation failure when attempting to set the list of symbols the MTA should send.","resolution":"Check system memory usage and possibly increase available memory. Consider reducing the number of macros requested if this error occurs frequently."},{"function":"smfi_addrcpt_par","message_template":"Failed to add recipient with parameters - operation not permitted by MTA","reason":"The filter attempted to add a recipient with ESMTP parameters but doesn't have permission from the MTA to perform this operation (SMFIF_ADDRCPT_PAR not set).","resolution":"Review milter configuration to ensure proper capabilities are negotiated with sendmail. The filter must register for the SMFIF_ADDRCPT_PAR capability during registration."},{"function":"smfi_addrcpt","message_template":"Failed to add recipient - operation not permitted by MTA","reason":"The filter attempted to add a recipient but doesn't have permission from the MTA to perform this operation (SMFIF_ADDRCPT not set).","resolution":"Review milter configuration to ensure proper capabilities are negotiated with sendmail. The filter must register for the SMFIF_ADDRCPT capability during registration."},{"function":"smfi_delrcpt","message_template":"Failed to delete recipient - operation not permitted by MTA","reason":"The filter attempted to delete a recipient but doesn't have permission from the MTA to perform this operation (SMFIF_DELRCPT not set).","resolution":"Review milter configuration to ensure proper capabilities are negotiated with sendmail. The filter must register for the SMFIF_DELRCPT capability during registration."},{"function":"smfi_replacebody","message_template":"Failed to replace message body - operation not permitted by MTA","reason":"The filter attempted to replace the message body but doesn't have permission from the MTA to perform this operation (SMFIF_CHGBODY not set).","resolution":"Review milter configuration to ensure proper capabilities are negotiated with sendmail. The filter must register for the SMFIF_CHGBODY capability during registration."},{"function":"smfi_quarantine","message_template":"Failed to quarantine message - operation not permitted by MTA","reason":"The filter attempted to quarantine the message but doesn't have permission from the MTA to perform this operation (SMFIF_QUARANTINE not set).","resolution":"Review milter configuration to ensure proper capabilities are negotiated with sendmail. The filter must register for the SMFIF_QUARANTINE capability during registration."},{"function":"smfi_setreply","message_template":"Failed to allocate memory for reply buffer","reason":"Memory allocation failure when attempting to set a custom SMTP reply code and message.","resolution":"Check system memory usage and possibly increase available memory. Consider using shorter reply messages if this error occurs frequently."},{"function":"smfi_setreply","message_template":"Invalid reply code or message format","reason":"The filter attempted to set an SMTP reply with an invalid format, such as incorrectly formatted reply code or message containing line breaks.","resolution":"Check the filter code to ensure reply codes match SMTP format (e.g., '550') and messages don't contain carriage returns or line feeds."},{"function":"smfi_setmlreply","message_template":"Failed to allocate memory for multi-line reply buffer","reason":"Memory allocation failure when attempting to set a custom multi-line SMTP reply code and message.","resolution":"Check system memory usage and possibly increase available memory. Consider using shorter reply messages if this error occurs frequently."},{"function":"smfi_setmlreply","message_template":"Invalid reply code or message format in multi-line reply","reason":"The filter attempted to set a multi-line SMTP reply with an invalid format, such as incorrectly formatted reply code or message containing line breaks.","resolution":"Check the filter code to ensure reply codes match SMTP format (e.g., '550') and messages don't contain carriage returns or line feeds."},{"function":"smfi_progress","message_template":"progress","reason":"The filter is sending a progress notification to prevent timeout during a long-running operation.","resolution":"This is an informational message, no resolution required. If these appear frequently in logs, consider optimizing filter operations to complete more quickly."}]}