{"project":"sendmail","module":"worker.c","summary":"Implements a worker pool system for libmilter that manages multiple connections from mail servers. It provides a pool controller that coordinates worker threads to handle various milter sessions and monitors connections for activity.","logs":[{"function":"PIPE_SEND_SIGNAL","message_template":"Error writing to event pipe: %s","reason":"Failed to write the event signal to the pipe used to notify the pool controller of task completion. This indicates an issue with interprocess communication.","resolution":"Check system resources, file descriptor limits, and overall system stability. May require restarting the milter service."},{"function":"TASKMGR_LOCK","message_template":"TASKMGR_LOCK error","reason":"Failed to acquire the mutex lock that protects the worker pool's task list. This indicates a thread synchronization problem.","resolution":"Check system resources and thread limits. May require restarting the milter service if mutex corruption has occurred."},{"function":"TASKMGR_UNLOCK","message_template":"TASKMGR_UNLOCK error","reason":"Failed to release the mutex lock that protects the worker pool's task list. This indicates a thread synchronization problem.","resolution":"Check system resources and thread limits. May require restarting the milter service if mutex corruption has occurred."},{"function":"TASKMGR_COND_SIGNAL","message_template":"TASKMGR_COND_SIGNAL error","reason":"Failed to signal the condition variable used to wake up idle worker threads. This indicates a thread synchronization problem.","resolution":"Check system resources and thread-related limits. May require restarting the milter service if condition variable has become corrupted."},{"function":"LAUNCH_WORKER","message_template":"LAUNCH_WORKER error: %s","reason":"Failed to create a new worker thread. This may be due to resource limits or system instability.","resolution":"Check system thread limits (ulimit -u), available memory, and overall system load. You may need to increase system resource limits or reduce the number of concurrent connections."},{"function":"nonblocking","message_template":"fcntl(%s, F_GETFL)=%s","reason":"Failed to get file descriptor flags when trying to set a pipe to non-blocking mode.","resolution":"Check file descriptor limits and system stability. May indicate resource exhaustion or a system issue that requires a service restart."},{"function":"nonblocking","message_template":"fcntl(%s, F_SETFL, O_NONBLOCK)=%s","reason":"Failed to set non-blocking mode on a pipe file descriptor.","resolution":"Check file descriptor status, permissions, and system stability. May indicate resource issues requiring system maintenance."},{"function":"mi_pool_controller_init","message_template":"can't create event pipe: %s","reason":"Failed to create the pipe used for signaling between worker threads and the pool controller.","resolution":"Check system file descriptor limits (ulimit -n) and available system resources. Increase limits if necessary or restart the service."},{"function":"mi_pool_controller_init","message_template":"can't create controller thread: %s","reason":"Failed to create the pool controller thread that manages worker distribution.","resolution":"Check system thread limits (ulimit -u), available memory, and overall system load. You may need to increase system resource limits."},{"function":"mi_pool_controller_init","message_template":"can't create workers crew: %s","reason":"Failed to create the initial pool of worker threads.","resolution":"Check system thread limits (ulimit -u), available memory, and overall system load. You may need to increase system resource limits or reduce the MIN_WORKERS setting."},{"function":"mi_pool_controller","message_template":"Failed to detach pool controller thread","reason":"Failed to set the pool controller thread to detached state, which may lead to resource leaks when the thread terminates.","resolution":"Check system thread limits and stability. May require restarting the milter service if thread-related issues persist."},{"function":"mi_pool_controller","message_template":"Failed to malloc pollfd array: %s","reason":"Failed to allocate memory for the poll file descriptor array, which is needed to monitor connections.","resolution":"Check system memory availability and limits. Consider reducing the number of concurrent connections or increasing system memory."},{"function":"mi_pool_controller","message_template":"Closing old connection: sd=%d id=%d","reason":"A session has timed out and is being closed. This is informational but could indicate client connection issues if occurring frequently.","resolution":"If this happens too frequently, consider increasing the timeout value (OLD_SESSION_TIMEOUT) or investigate client connection stability."},{"function":"mi_pool_controller","message_template":"Failed to realloc pollfd array:%s","reason":"Failed to resize the poll file descriptor array to accommodate more connections.","resolution":"Check system memory availability. Consider limiting the number of concurrent connections or increasing system memory allocation."},{"function":"mi_pool_controller","message_template":"%s returned: at epoch %d value %d","reason":"Debug information showing the return value from poll() operation.","resolution":"Informational log, no resolution required."},{"function":"mi_pool_controller","message_template":"%s() failed (%s), %s","reason":"The poll() system call failed with an error other than EINTR. After MAX_FAILS_S consecutive failures, the controller will abort.","resolution":"Check system stability and resources. May indicate a serious system issue requiring OS-level troubleshooting if occurring repeatedly."},{"function":"mi_worker","message_template":"Failed to detach worker thread","reason":"Failed to set a worker thread to detached state, which may lead to resource leaks when the thread terminates.","resolution":"Check system thread limits and stability. May require restarting the milter service if thread-related issues persist."},{"function":"mi_worker","message_template":"worker %d: new task -> let's handle it","reason":"Debug message indicating a worker thread has begun processing a new task.","resolution":"Informational log, no resolution required."},{"function":"mi_worker","message_template":"worker %d: mi_engine returned %d","reason":"Debug message showing the result code from processing a milter session.","resolution":"Informational log, no resolution required."},{"function":"mi_worker","message_template":"writing to event pipe...","reason":"Debug message indicating a worker thread is signaling the pool controller about task completion.","resolution":"Informational log, no resolution required."},{"function":"mi_worker","message_template":"worker %d: checking ... %d %d","reason":"Debug message showing a worker thread checking if it should continue or exit based on idle worker counts.","resolution":"Informational log, no resolution required."},{"function":"mi_worker","message_template":"worker %d: quitting... ","reason":"Debug message indicating a worker thread is exiting because there are enough idle workers in the pool.","resolution":"Informational log, no resolution required."},{"function":"mi_pool_controller","message_template":"PIPE WILL READ evt = %08X %08X","reason":"Debug message showing event flags before reading from the event pipe.","resolution":"Informational log, no resolution required."},{"function":"mi_pool_controller","message_template":"PIPE DONE READ i=[%d] fd=[%d] r=[%d] evt=[%d]","reason":"Debug message showing details after reading from the event pipe.","resolution":"Informational log, no resolution required."},{"function":"mi_pool_controller","message_template":"Checking context sd=%d - fd=%d","reason":"Debug message showing session descriptor check during poll handling.","resolution":"Informational log, no resolution required."},{"function":"mi_pool_controller","message_template":"TASK: found %d for fd[%d]=%d","reason":"Debug message indicating a matching task was found for an active file descriptor.","resolution":"Informational log, no resolution required."},{"function":"mi_pool_controller","message_template":"TASK %s FOUND - Checking PIPE for fd[%d]","reason":"Debug message showing task lookup result and pipe checking status.","resolution":"Informational log, no resolution required."},{"function":"mi_pool_controller","message_template":"PIPE r=[%d] w=[%d]","reason":"Debug message showing the read and write pipe file descriptors.","resolution":"Informational log, no resolution required."},{"function":"mi_pool_controller","message_template":"%s event on pfd[%d\/%d]=%d","reason":"Debug message showing poll event details for a specific file descriptor.","resolution":"Informational log, no resolution required."}]}